<abi-corpus architecture='elf-amd-x86_64' soname='liblttng-ust.so.0'>
  <elf-needed>
    <dependency name='liblttng-ust-tracepoint.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='liburcu-bp.so.6'/>
    <dependency name='liburcu-cds.so.6'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- __sflush -->
    <elf-symbol name='__sflush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __sfvwrite -->
    <elf-symbol name='__sfvwrite' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __swsetup -->
    <elf-symbol name='__swsetup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _get_num_possible_cpus -->
    <elf-symbol name='_get_num_possible_cpus' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _lttng_get_sessions -->
    <elf-symbol name='_lttng_get_sessions' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _lttng_ust_tracef -->
    <elf-symbol name='_lttng_ust_tracef' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _lttng_ust_tracelog_TRACE_ALERT -->

    <elf-symbol name='__tracepoint_lttng_ust_tracelog___TRACE_WARNING' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_provider_lttng_ust_lib -->
    <elf-symbol name='__tracepoint_provider_lttng_ust_lib' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_provider_lttng_ust_statedump -->
    <elf-symbol name='__tracepoint_provider_lttng_ust_statedump' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_provider_lttng_ust_tracef -->
    <elf-symbol name='__tracepoint_provider_lttng_ust_tracef' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_provider_lttng_ust_tracelog -->
    <elf-symbol name='__tracepoint_provider_lttng_ust_tracelog' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoints__disable_destructors -->
    <elf-symbol name='__tracepoints__disable_destructors' size='4' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dl_state_table -->
    <elf-symbol name='dl_state_table' size='2048' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dt_var_fields -->
    <elf-symbol name='dt_var_fields' size='3840' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- global_apps -->
    <elf-symbol name='global_apps' size='8256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lib_ring_buffer_nesting -->
    <elf-symbol name='lib_ring_buffer_nesting' size='4' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- local_apps -->
    <elf-symbol name='local_apps' size='8256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_discard -->
    <elf-symbol name='lttng_client_callbacks_discard' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_discard_rt -->
    <elf-symbol name='lttng_client_callbacks_discard_rt' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_metadata -->
    <elf-symbol name='lttng_client_callbacks_metadata' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_overwrite -->
    <elf-symbol name='lttng_client_callbacks_overwrite' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_overwrite_rt -->
    <elf-symbol name='lttng_client_callbacks_overwrite_rt' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_crash_magic_xor -->
    <elf-symbol name='lttng_crash_magic_xor' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_get_cpu -->
    <elf-symbol name='lttng_get_cpu' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_static_ctx -->
    <elf-symbol name='lttng_static_ctx' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_trace_clock -->
    <elf-symbol name='lttng_trace_clock' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_loaded -->
    <elf-symbol name='lttng_ust_loaded' size='4' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- ust_loglevel -->
    <elf-symbol name='ust_loglevel' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='fflush.c' comp-dir-path='snprintf' language='LANG_C99'>



    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- char[4] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='32' id='type-id-2'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-6'/>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='type-id-7'/>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-8'/>
    <!-- unsigned char[1] -->
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='8' id='type-id-9'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-3' id='type-id-10'/>

    </array-type-def>
    <!-- unsigned char[3] -->
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='24' id='type-id-11'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='type-id-3' id='type-id-12'/>

    </array-type-def>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-13'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- void -->
    <type-decl name='void' id='type-id-14'/>
    <!-- typedef __lttng_ust_sFILE LTTNG_UST_LFILE -->
    <typedef-decl name='LTTNG_UST_LFILE' type-id='type-id-15' filepath='snprintf/various.h' line='99' column='1' id='type-id-16'/>
    <!-- struct __lttng_ust_sFILE -->
    <class-decl name='__lttng_ust_sFILE' size-in-bits='1280' is-struct='yes' visibility='default' filepath='snprintf/various.h' line='67' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned char* __lttng_ust_sFILE::_p -->
        <var-decl name='_p' type-id='type-id-17' visibility='default' filepath='snprintf/various.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int __lttng_ust_sFILE::_r -->
        <var-decl name='_r' type-id='type-id-5' visibility='default' filepath='snprintf/various.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int __lttng_ust_sFILE::_w -->
        <var-decl name='_w' type-id='type-id-5' visibility='default' filepath='snprintf/various.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- short int __lttng_ust_sFILE::_flags -->
        <var-decl name='_flags' type-id='type-id-7' visibility='default' filepath='snprintf/various.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- short int __lttng_ust_sFILE::_file -->
        <var-decl name='_file' type-id='type-id-7' visibility='default' filepath='snprintf/various.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- __lttng_ust_sbuf __lttng_ust_sFILE::_bf -->
        <var-decl name='_bf' type-id='type-id-18' visibility='default' filepath='snprintf/various.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int __lttng_ust_sFILE::_lbfsize -->
        <var-decl name='_lbfsize' type-id='type-id-5' visibility='default' filepath='snprintf/various.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void* __lttng_ust_sFILE::_cookie -->
        <var-decl name='_cookie' type-id='type-id-19' visibility='default' filepath='snprintf/various.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int (void*)* __lttng_ust_sFILE::_close -->
        <var-decl name='_close' type-id='type-id-20' visibility='default' filepath='snprintf/various.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int (void*, char*, int)* __lttng_ust_sFILE::_read -->
        <var-decl name='_read' type-id='type-id-21' visibility='default' filepath='snprintf/various.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- typedef fpos_t (void*, typedef fpos_t, int)* __lttng_ust_sFILE::_seek -->
        <var-decl name='_seek' type-id='type-id-22' visibility='default' filepath='snprintf/various.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int (void*, const char*, int)* __lttng_ust_sFILE::_write -->
        <var-decl name='_write' type-id='type-id-23' visibility='default' filepath='snprintf/various.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- __lttng_ust_sbuf __lttng_ust_sFILE::_ext -->
        <var-decl name='_ext' type-id='type-id-18' visibility='default' filepath='snprintf/various.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- unsigned char* __lttng_ust_sFILE::_up -->
        <var-decl name='_up' type-id='type-id-17' visibility='default' filepath='snprintf/various.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- int __lttng_ust_sFILE::_ur -->
        <var-decl name='_ur' type-id='type-id-5' visibility='default' filepath='snprintf/various.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <!-- unsigned char __lttng_ust_sFILE::_ubuf[3] -->
        <var-decl name='_ubuf' type-id='type-id-11' visibility='default' filepath='snprintf/various.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <!-- unsigned char __lttng_ust_sFILE::_nbuf[1] -->
        <var-decl name='_nbuf' type-id='type-id-9' visibility='default' filepath='snprintf/various.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- __lttng_ust_sbuf __lttng_ust_sFILE::_lb -->
        <var-decl name='_lb' type-id='type-id-18' visibility='default' filepath='snprintf/various.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- int __lttng_ust_sFILE::_blksize -->
        <var-decl name='_blksize' type-id='type-id-5' visibility='default' filepath='snprintf/various.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- fpos_t __lttng_ust_sFILE::_offset -->
        <var-decl name='_offset' type-id='type-id-24' visibility='default' filepath='snprintf/various.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct __lttng_ust_sbuf -->
    <class-decl name='__lttng_ust_sbuf' size-in-bits='128' is-struct='yes' visibility='default' filepath='snprintf/various.h' line='38' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned char* __lttng_ust_sbuf::_base -->
        <var-decl name='_base' type-id='type-id-17' visibility='default' filepath='snprintf/various.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int __lttng_ust_sbuf::_size -->
        <var-decl name='_size' type-id='type-id-5' visibility='default' filepath='snprintf/various.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __fpos_t fpos_t -->
    <typedef-decl name='fpos_t' type-id='type-id-25' filepath='/usr/include/stdio.h' line='84' column='1' id='type-id-24'/>
    <!-- typedef _G_fpos_t __fpos_t -->
    <typedef-decl name='__fpos_t' type-id='type-id-26' filepath='/usr/include/bits/types/__fpos_t.h' line='14' column='1' id='type-id-25'/>
    <!-- struct _G_fpos_t -->
    <class-decl name='_G_fpos_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/__fpos_t.h' line='10' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __off_t _G_fpos_t::__pos -->
        <var-decl name='__pos' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/__fpos_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __mbstate_t _G_fpos_t::__state -->
        <var-decl name='__state' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/__fpos_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int __off_t -->
    <typedef-decl name='__off_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-27'/>
    <!-- typedef __anonymous_struct__ __mbstate_t -->
    <typedef-decl name='__mbstate_t' type-id='type-id-29' filepath='/usr/include/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-28'/>
    <!-- struct {int __count; union {unsigned int __wch; char __wchb[4];} __value;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='13' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int __count -->
        <var-decl name='__count' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {unsigned int __wch; char __wchb[4];} __value -->
        <var-decl name='__value' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {unsigned int __wch; char __wchb[4];} -->
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='16' column='1' id='type-id-30'>
      <data-member access='private'>
        <!-- unsigned int __wch -->
        <var-decl name='__wch' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='18' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __wchb[4] -->
        <var-decl name='__wchb' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='19' column='1'/>
      </data-member>
    </union-decl>
    <!-- LTTNG_UST_LFILE* -->
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-31'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-32'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-33'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <!-- int (void*)* -->
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-20'/>
    <!-- int (void*, char*, int)* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-21'/>
    <!-- int (void*, const char*, int)* -->
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-23'/>
    <!-- typedef fpos_t (void*, typedef fpos_t, int)* -->
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-22'/>
    <!-- unsigned char* -->
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-17'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-19'/>
    <!-- int __sflush(LTTNG_UST_LFILE*) -->
    <function-decl name='__sflush' mangled-name='__sflush' filepath='snprintf/fflush.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sflush'>
      <!-- parameter of type 'LTTNG_UST_LFILE*' -->
      <parameter type-id='type-id-31' name='fp' filepath='snprintf/fflush.c' line='53' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ust_safe_fflush(LTTNG_UST_LFILE*) -->
    <function-decl name='ust_safe_fflush' mangled-name='ust_safe_fflush' filepath='snprintf/fflush.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_safe_fflush'>
      <!-- parameter of type 'LTTNG_UST_LFILE*' -->
      <parameter type-id='type-id-31' name='fp' filepath='snprintf/fflush.c' line='39' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int (void*) -->
    <function-type size-in-bits='64' id='type-id-35'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (void*, char*, int) -->
    <function-type size-in-bits='64' id='type-id-36'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-32'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (void*, const char*, int) -->
    <function-type size-in-bits='64' id='type-id-37'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- fpos_t (void*, fpos_t, int) -->
    <function-type size-in-bits='64' id='type-id-38'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef fpos_t' -->
      <parameter type-id='type-id-24'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- typedef fpos_t -->
      <return type-id='type-id-24'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='fvwrite.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- struct __lttng_ust_suio -->
    <class-decl name='__lttng_ust_suio' size-in-bits='128' is-struct='yes' visibility='default' filepath='snprintf/fvwrite.h' line='42' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __lttng_ust_siov* __lttng_ust_suio::uio_iov -->
        <var-decl name='uio_iov' type-id='type-id-40' visibility='default' filepath='snprintf/fvwrite.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int __lttng_ust_suio::uio_iovcnt -->
        <var-decl name='uio_iovcnt' type-id='type-id-5' visibility='default' filepath='snprintf/fvwrite.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int __lttng_ust_suio::uio_resid -->
        <var-decl name='uio_resid' type-id='type-id-5' visibility='default' filepath='snprintf/fvwrite.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct __lttng_ust_siov -->
    <class-decl name='__lttng_ust_siov' size-in-bits='128' is-struct='yes' visibility='default' filepath='snprintf/fvwrite.h' line='38' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* __lttng_ust_siov::iov_base -->
        <var-decl name='iov_base' type-id='type-id-19' visibility='default' filepath='snprintf/fvwrite.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t __lttng_ust_siov::iov_len -->
        <var-decl name='iov_len' type-id='type-id-42' visibility='default' filepath='snprintf/fvwrite.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/10.2.0/include/stddef.h' line='209' column='1' id='type-id-42'/>
    <!-- __lttng_ust_siov* -->
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-40'/>
    <!-- __lttng_ust_suio* -->
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-43'/>
    <!-- int __sfvwrite(LTTNG_UST_LFILE*, __lttng_ust_suio*) -->
    <function-decl name='__sfvwrite' mangled-name='__sfvwrite' filepath='snprintf/fvwrite.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sfvwrite'>
      <!-- parameter of type 'LTTNG_UST_LFILE*' -->
      <parameter type-id='type-id-31' name='fp' filepath='snprintf/fvwrite.c' line='49' column='1'/>
      <!-- parameter of type '__lttng_ust_suio*' -->
      <parameter type-id='type-id-43' name='uio' filepath='snprintf/fvwrite.c' line='49' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mbrtowc_sb.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- typedef int wchar_t -->
    <typedef-decl name='wchar_t' type-id='type-id-5' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/10.2.0/include/stddef.h' line='321' column='1' id='type-id-44'/>
    <!-- typedef __mbstate_t mbstate_t -->
    <typedef-decl name='mbstate_t' type-id='type-id-28' filepath='/usr/include/bits/types/mbstate_t.h' line='6' column='1' id='type-id-45'/>
    <!-- mbstate_t* -->
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <!-- wchar_t* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-47'/>
    <!-- size_t ust_safe_mbrtowc(wchar_t*, const char*, size_t, mbstate_t*) -->
    <function-decl name='ust_safe_mbrtowc' mangled-name='ust_safe_mbrtowc' filepath='snprintf/mbrtowc_sb.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_safe_mbrtowc'>
      <!-- parameter of type 'wchar_t*' -->
      <parameter type-id='type-id-47' name='pwc' filepath='snprintf/mbrtowc_sb.c' line='39' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='s' filepath='snprintf/mbrtowc_sb.c' line='39' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='n' filepath='snprintf/mbrtowc_sb.c' line='39' column='1'/>
      <!-- parameter of type 'mbstate_t*' -->
      <parameter type-id='type-id-46' name='ps' filepath='snprintf/mbrtowc_sb.c' line='39' column='1'/>
      <!-- typedef size_t -->
      <return type-id='type-id-42'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='snprintf.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- struct __va_list_tag -->
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- __va_list_tag* -->
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <!-- int ust_safe_snprintf(char*, size_t, const char*, ...) -->
    <function-decl name='ust_safe_snprintf' mangled-name='ust_safe_snprintf' filepath='snprintf/snprintf.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_safe_snprintf'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-32' name='str' filepath='snprintf/snprintf.c' line='68' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='n' filepath='snprintf/snprintf.c' line='68' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='fmt' filepath='snprintf/snprintf.c' line='68' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ust_safe_vsnprintf(char*, size_t, const char*, __va_list_tag*) -->
    <function-decl name='ust_safe_vsnprintf' mangled-name='ust_safe_vsnprintf' filepath='snprintf/snprintf.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_safe_vsnprintf'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-32' name='str' filepath='snprintf/snprintf.c' line='43' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='n' filepath='snprintf/snprintf.c' line='43' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='fmt' filepath='snprintf/snprintf.c' line='43' column='1'/>
      <!-- parameter of type '__va_list_tag*' -->
      <parameter type-id='type-id-49' name='ap' filepath='snprintf/snprintf.c' line='43' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='vfprintf.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- int ust_safe_vfprintf(LTTNG_UST_LFILE*, const char*, __va_list_tag*) -->
    <function-decl name='ust_safe_vfprintf' mangled-name='ust_safe_vfprintf' filepath='snprintf/vfprintf.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_safe_vfprintf'>
      <!-- parameter of type 'LTTNG_UST_LFILE*' -->
      <parameter type-id='type-id-31' name='fp' filepath='snprintf/vfprintf.c' line='192' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='fmt0' filepath='snprintf/vfprintf.c' line='192' column='1'/>
      <!-- parameter of type '__va_list_tag*' -->
      <parameter type-id='type-id-49' name='ap' filepath='snprintf/vfprintf.c' line='192' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='wsetup.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- int __swsetup(LTTNG_UST_LFILE*) -->
    <function-decl name='__swsetup' mangled-name='__swsetup' filepath='snprintf/wsetup.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__swsetup'>
      <!-- parameter of type 'LTTNG_UST_LFILE*' -->
      <parameter type-id='type-id-31' name='fp' filepath='snprintf/wsetup.c' line='45' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='core.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-50'/>
    <!-- enum ust_loglevel -->
    <enum-decl name='ust_loglevel' filepath='../include/usterr-signal-safe.h' line='31' column='1' id='type-id-51'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='UST_LOGLEVEL_UNKNOWN' value='0'/>
      <enumerator name='UST_LOGLEVEL_NORMAL' value='1'/>
      <enumerator name='UST_LOGLEVEL_DEBUG' value='2'/>
    </enum-decl>
    <!-- volatile ust_loglevel -->
    <qualified-type-def type-id='type-id-51' volatile='yes' id='type-id-52'/>
    <!-- volatile ust_loglevel ust_loglevel -->
    <var-decl name='ust_loglevel' type-id='type-id-52' mangled-name='ust_loglevel' visibility='default' filepath='../include/usterr-signal-safe.h' line='37' column='1' elf-symbol-id='ust_loglevel'/>
    <!-- void init_usterr() -->
    <function-decl name='init_usterr' mangled-name='init_usterr' filepath='snprintf/core.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='init_usterr'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='patient_write.c' comp-dir-path='snprintf' language='LANG_C99'>
    <!-- typedef __ssize_t ssize_t -->
    <typedef-decl name='ssize_t' type-id='type-id-53' filepath='/usr/include/unistd.h' line='220' column='1' id='type-id-54'/>
    <!-- typedef long int __ssize_t -->
    <typedef-decl name='__ssize_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-53'/>
    <!-- ssize_t patient_send(int, void*, size_t, int) -->
    <function-decl name='patient_send' mangled-name='patient_send' filepath='snprintf/patient_write.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='patient_send'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='fd' filepath='snprintf/patient_write.c' line='59' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='buf' filepath='snprintf/patient_write.c' line='59' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='count' filepath='snprintf/patient_write.c' line='59' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='flags' filepath='snprintf/patient_write.c' line='59' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- ssize_t patient_write(int, void*, size_t) -->
    <function-decl name='patient_write' mangled-name='patient_write' filepath='snprintf/patient_write.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='patient_write'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='fd' filepath='snprintf/patient_write.c' line='35' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='buf' filepath='snprintf/patient_write.c' line='35' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='count' filepath='snprintf/patient_write.c' line='35' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-comm.c' comp-dir-path='liblttng-ust-comm' language='LANG_C99'>











    <!-- cds_hlist_head[4096] -->
    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='262144' id='type-id-56'>
      <!-- <anonymous range>[4096] -->
      <subrange length='4096' type-id='type-id-3' id='type-id-57'/>

    </array-type-def>
    <!-- char[128] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1024' id='type-id-58'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' type-id='type-id-3' id='type-id-59'/>

    </array-type-def>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-60'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-61'/>

    </array-type-def>
    <!-- char[20] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-62'>
      <!-- <anonymous range>[20] -->
      <subrange length='20' type-id='type-id-3' id='type-id-63'/>

    </array-type-def>
    <!-- char[24] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-64'>
      <!-- <anonymous range>[24] -->
      <subrange length='24' type-id='type-id-3' id='type-id-65'/>

    </array-type-def>
    <!-- char[256] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2048' id='type-id-66'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='type-id-3' id='type-id-67'/>

    </array-type-def>
    <!-- char[288] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2304' id='type-id-68'>
      <!-- <anonymous range>[288] -->
      <subrange length='288' type-id='type-id-3' id='type-id-69'/>

    </array-type-def>
    <!-- char[28] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='224' id='type-id-70'>
      <!-- <anonymous range>[28] -->
      <subrange length='28' type-id='type-id-3' id='type-id-71'/>

    </array-type-def>
    <!-- char[32] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='256' id='type-id-72'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='type-id-3' id='type-id-73'/>

    </array-type-def>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-74'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-75'/>

    </array-type-def>
    <!-- char[] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-76'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-77'/>

    </array-type-def>
    <!-- struct channel -->
    <class-decl name='channel' size-in-bits='6144' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-78'/>
    <!-- struct lttng_perf_counter_field -->
    <class-decl name='lttng_perf_counter_field' size-in-bits='1024' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <!-- struct lttng_ust_lib_ring_buffer_ctx -->
    <class-decl name='lttng_ust_lib_ring_buffer_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-80'/>
    <!-- struct lttng_ust_shm_handle -->
    <class-decl name='lttng_ust_shm_handle' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-81'/>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' id='type-id-82'/>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-83'/>
    <!-- unsigned char[16] -->
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='128' id='type-id-84'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-61'/>

    </array-type-def>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-85'/>
    <!-- struct lttng_session -->
    <class-decl name='lttng_session' size-in-bits='525504' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='580' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int lttng_session::active -->
        <var-decl name='active' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int lttng_session::been_active -->
        <var-decl name='been_active' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_session::objd -->
        <var-decl name='objd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* lttng_session::_deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-events.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_session::chan_head -->
        <var-decl name='chan_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- cds_list_head lttng_session::events_head -->
        <var-decl name='events_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- cds_list_head lttng_session::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- cds_list_head lttng_session::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int lttng_session::_deprecated3 -->
        <var-decl name='_deprecated3' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_session::_deprecated4 -->
        <var-decl name='_deprecated4' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- cds_list_head lttng_session::enablers_head -->
        <var-decl name='enablers_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- lttng_ust_event_ht lttng_session::events_ht -->
        <var-decl name='events_ht' type-id='type-id-88' visibility='default' filepath='../include/lttng/ust-events.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='263040'>
        <!-- void* lttng_session::owner -->
        <var-decl name='owner' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-events.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_session::tstate -->
        <var-decl name='tstate' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <!-- int lttng_session::statedump_pending -->
        <var-decl name='statedump_pending' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='263168'>
        <!-- lttng_ust_enum_ht lttng_session::enums_ht -->
        <var-decl name='enums_ht' type-id='type-id-89' visibility='default' filepath='../include/lttng/ust-events.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525312'>
        <!-- cds_list_head lttng_session::enums_head -->
        <var-decl name='enums_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525440'>
        <!-- lttng_ctx* lttng_session::ctx -->
        <var-decl name='ctx' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-events.h' line='605' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_list_head -->
    <class-decl name='cds_list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/urcu/list.h' line='35' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head* cds_list_head::next -->
        <var-decl name='next' type-id='type-id-91' visibility='default' filepath='/usr/include/urcu/list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head* cds_list_head::prev -->
        <var-decl name='prev' type-id='type-id-91' visibility='default' filepath='/usr/include/urcu/list.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_ht -->
    <class-decl name='lttng_ust_event_ht' size-in-bits='262144' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='564' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_head lttng_ust_event_ht::table[4096] -->
        <var-decl name='table' type-id='type-id-56' visibility='default' filepath='../include/lttng/ust-events.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_hlist_head -->
    <class-decl name='cds_hlist_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/urcu/hlist.h' line='21' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_node* cds_hlist_head::next -->
        <var-decl name='next' type-id='type-id-92' visibility='default' filepath='/usr/include/urcu/hlist.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_hlist_node -->
    <class-decl name='cds_hlist_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/urcu/hlist.h' line='25' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_node* cds_hlist_node::next -->
        <var-decl name='next' type-id='type-id-92' visibility='default' filepath='/usr/include/urcu/hlist.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_hlist_node* cds_hlist_node::prev -->
        <var-decl name='prev' type-id='type-id-92' visibility='default' filepath='/usr/include/urcu/hlist.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_enum_ht -->
    <class-decl name='lttng_ust_enum_ht' size-in-bits='262144' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='571' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_head lttng_ust_enum_ht::table[4096] -->
        <var-decl name='table' type-id='type-id-56' visibility='default' filepath='../include/lttng/ust-events.h' line='572' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ctx -->
    <class-decl name='lttng_ctx' size-in-bits='320' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='304' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ctx_field* lttng_ctx::fields -->
        <var-decl name='fields' type-id='type-id-95' visibility='default' filepath='../include/lttng/ust-events.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int lttng_ctx::nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int lttng_ctx::allocated_fields -->
        <var-decl name='allocated_fields' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int lttng_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- char lttng_ctx::padding[20] -->
        <var-decl name='padding' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-events.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ctx_field -->
    <class-decl name='lttng_ctx_field' size-in-bits='3200' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='287' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_event_field lttng_ctx_field::event_field -->
        <var-decl name='event_field' type-id='type-id-97' visibility='default' filepath='../include/lttng/ust-events.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <!-- typedef size_t (lttng_ctx_field*, typedef size_t)* lttng_ctx_field::get_size -->
        <var-decl name='get_size' type-id='type-id-98' visibility='default' filepath='../include/lttng/ust-events.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)* lttng_ctx_field::record -->
        <var-decl name='record' type-id='type-id-99' visibility='default' filepath='../include/lttng/ust-events.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <!-- void (lttng_ctx_field*, lttng_ctx_value*)* lttng_ctx_field::get_value -->
        <var-decl name='get_value' type-id='type-id-100' visibility='default' filepath='../include/lttng/ust-events.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <!-- union {lttng_perf_counter_field* perf_counter; char padding[40];} lttng_ctx_field::u -->
        <var-decl name='u' type-id='type-id-101' visibility='default' filepath='../include/lttng/ust-events.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <!-- void (lttng_ctx_field*)* lttng_ctx_field::destroy -->
        <var-decl name='destroy' type-id='type-id-102' visibility='default' filepath='../include/lttng/ust-events.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <!-- char* lttng_ctx_field::field_name -->
        <var-decl name='field_name' type-id='type-id-32' visibility='default' filepath='../include/lttng/ust-events.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_event_field -->
    <class-decl name='lttng_event_field' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='252' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_event_field::name -->
        <var-decl name='name' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_type lttng_event_field::type -->
        <var-decl name='type' type-id='type-id-103' visibility='default' filepath='../include/lttng/ust-events.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <!-- unsigned int lttng_event_field::nowrite -->
        <var-decl name='nowrite' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <!-- char lttng_event_field::padding[28] -->
        <var-decl name='padding' type-id='type-id-70' visibility='default' filepath='../include/lttng/ust-events.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_type -->
    <class-decl name='lttng_type' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='215' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_abstract_types lttng_type::atype -->
        <var-decl name='atype' type-id='type-id-104' visibility='default' filepath='../include/lttng/ust-events.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {_lttng_basic_type basic; struct {lttng_basic_type elem_type; unsigned int length;} array; struct {lttng_basic_type length_type; lttng_basic_type elem_type;} sequence; struct {uint32_t nr_fields; lttng_event_field* fields;} _struct; char padding[128];} lttng_type::u -->
        <var-decl name='u' type-id='type-id-105' visibility='default' filepath='../include/lttng/ust-events.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_abstract_types -->
    <enum-decl name='lttng_abstract_types' filepath='../include/lttng/ust-events.h' line='84' column='1' id='type-id-104'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='atype_integer' value='0'/>
      <enumerator name='atype_enum' value='1'/>
      <enumerator name='atype_array' value='2'/>
      <enumerator name='atype_sequence' value='3'/>
      <enumerator name='atype_string' value='4'/>
      <enumerator name='atype_float' value='5'/>
      <enumerator name='atype_dynamic' value='6'/>
      <enumerator name='atype_struct' value='7'/>
      <enumerator name='NR_ABSTRACT_TYPES' value='8'/>
    </enum-decl>
    <!-- union {_lttng_basic_type basic; struct {lttng_basic_type elem_type; unsigned int length;} array; struct {lttng_basic_type length_type; lttng_basic_type elem_type;} sequence; struct {uint32_t nr_fields; lttng_event_field* fields;} _struct; char padding[128];} -->
    <union-decl name='__anonymous_union__' size-in-bits='2176' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='217' column='1' id='type-id-105'>
      <data-member access='private'>
        <!-- _lttng_basic_type basic -->
        <var-decl name='basic' type-id='type-id-106' visibility='default' filepath='../include/lttng/ust-events.h' line='218' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_basic_type elem_type; unsigned int length;} array -->
        <var-decl name='array' type-id='type-id-107' visibility='default' filepath='../include/lttng/ust-events.h' line='222' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_basic_type length_type; lttng_basic_type elem_type;} sequence -->
        <var-decl name='sequence' type-id='type-id-108' visibility='default' filepath='../include/lttng/ust-events.h' line='226' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_fields; lttng_event_field* fields;} _struct -->
        <var-decl name='_struct' type-id='type-id-109' visibility='default' filepath='../include/lttng/ust-events.h' line='230' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[128] -->
        <var-decl name='padding' type-id='type-id-58' visibility='default' filepath='../include/lttng/ust-events.h' line='231' column='1'/>
      </data-member>
    </union-decl>
    <!-- union _lttng_basic_type -->
    <union-decl name='_lttng_basic_type' size-in-bits='1024' visibility='default' filepath='../include/lttng/ust-events.h' line='194' column='1' id='type-id-106'>
      <data-member access='private'>
        <!-- lttng_integer_type _lttng_basic_type::integer -->
        <var-decl name='integer' type-id='type-id-110' visibility='default' filepath='../include/lttng/ust-events.h' line='195' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {const lttng_enum_desc* desc; lttng_integer_type container_type;} _lttng_basic_type::enumeration -->
        <var-decl name='enumeration' type-id='type-id-111' visibility='default' filepath='../include/lttng/ust-events.h' line='199' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_string_encodings encoding;} _lttng_basic_type::string -->
        <var-decl name='string' type-id='type-id-112' visibility='default' filepath='../include/lttng/ust-events.h' line='202' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_float_type _lttng_basic_type::_float -->
        <var-decl name='_float' type-id='type-id-113' visibility='default' filepath='../include/lttng/ust-events.h' line='203' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char _lttng_basic_type::padding[128] -->
        <var-decl name='padding' type-id='type-id-58' visibility='default' filepath='../include/lttng/ust-events.h' line='204' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_integer_type -->
    <class-decl name='lttng_integer_type' size-in-bits='320' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='146' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int lttng_integer_type::size -->
        <var-decl name='size' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned short int lttng_integer_type::alignment -->
        <var-decl name='alignment' type-id='type-id-85' visibility='default' filepath='../include/lttng/ust-events.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <!-- unsigned int lttng_integer_type::signedness -->
        <var-decl name='signedness' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <!-- unsigned int lttng_integer_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int lttng_integer_type::base -->
        <var-decl name='base' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- lttng_string_encodings lttng_integer_type::encoding -->
        <var-decl name='encoding' type-id='type-id-114' visibility='default' filepath='../include/lttng/ust-events.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_integer_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-64' visibility='default' filepath='../include/lttng/ust-events.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_string_encodings -->
    <enum-decl name='lttng_string_encodings' filepath='../include/lttng/ust-events.h' line='97' column='1' id='type-id-114'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='lttng_encode_none' value='0'/>
      <enumerator name='lttng_encode_UTF8' value='1'/>
      <enumerator name='lttng_encode_ASCII' value='2'/>
      <enumerator name='NR_STRING_ENCODINGS' value='3'/>
    </enum-decl>
    <!-- struct {const lttng_enum_desc* desc; lttng_integer_type container_type;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='196' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const lttng_enum_desc* desc -->
        <var-decl name='desc' type-id='type-id-115' visibility='default' filepath='../include/lttng/ust-events.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_integer_type container_type -->
        <var-decl name='container_type' type-id='type-id-110' visibility='default' filepath='../include/lttng/ust-events.h' line='198' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enum_desc -->
    <class-decl name='lttng_enum_desc' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='236' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_enum_desc::name -->
        <var-decl name='name' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const lttng_enum_entry* lttng_enum_desc::entries -->
        <var-decl name='entries' type-id='type-id-117' visibility='default' filepath='../include/lttng/ust-events.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int lttng_enum_desc::nr_entries -->
        <var-decl name='nr_entries' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- char lttng_enum_desc::padding[24] -->
        <var-decl name='padding' type-id='type-id-64' visibility='default' filepath='../include/lttng/ust-events.h' line='240' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enum_entry -->
    <class-decl name='lttng_enum_entry' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='114' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_enum_value lttng_enum_entry::start -->
        <var-decl name='start' type-id='type-id-119' visibility='default' filepath='../include/lttng/ust-events.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_enum_value lttng_enum_entry::end -->
        <var-decl name='end' type-id='type-id-119' visibility='default' filepath='../include/lttng/ust-events.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const char* lttng_enum_entry::string -->
        <var-decl name='string' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {struct {unsigned int options;} extra; char padding[16];} lttng_enum_entry::u -->
        <var-decl name='u' type-id='type-id-120' visibility='default' filepath='../include/lttng/ust-events.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enum_value -->
    <class-decl name='lttng_enum_value' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='104' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long long unsigned int lttng_enum_value::value -->
        <var-decl name='value' type-id='type-id-83' visibility='default' filepath='../include/lttng/ust-events.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_enum_value::signedness -->
        <var-decl name='signedness' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {unsigned int options;} extra; char padding[16];} -->
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='117' column='1' id='type-id-120'>
      <data-member access='private'>
        <!-- struct {unsigned int options;} extra -->
        <var-decl name='extra' type-id='type-id-121' visibility='default' filepath='../include/lttng/ust-events.h' line='120' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[16] -->
        <var-decl name='padding' type-id='type-id-60' visibility='default' filepath='../include/lttng/ust-events.h' line='121' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {unsigned int options;} -->
    <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='118' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int options -->
        <var-decl name='options' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {lttng_string_encodings encoding;} -->
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='200' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_string_encodings encoding -->
        <var-decl name='encoding' type-id='type-id-114' visibility='default' filepath='../include/lttng/ust-events.h' line='201' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_float_type -->
    <class-decl name='lttng_float_type' size-in-bits='288' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='185' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int lttng_float_type::exp_dig -->
        <var-decl name='exp_dig' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int lttng_float_type::mant_dig -->
        <var-decl name='mant_dig' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned short int lttng_float_type::alignment -->
        <var-decl name='alignment' type-id='type-id-85' visibility='default' filepath='../include/lttng/ust-events.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <!-- unsigned int lttng_float_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <!-- char lttng_float_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-64' visibility='default' filepath='../include/lttng/ust-events.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {lttng_basic_type elem_type; unsigned int length;} -->
    <class-decl name='__anonymous_struct__3' size-in-bits='1152' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='219' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-122' visibility='default' filepath='../include/lttng/ust-events.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- unsigned int length -->
        <var-decl name='length' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='221' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_basic_type -->
    <class-decl name='lttng_basic_type' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='207' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_abstract_types lttng_basic_type::atype -->
        <var-decl name='atype' type-id='type-id-104' visibility='default' filepath='../include/lttng/ust-events.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {_lttng_basic_type basic;} lttng_basic_type::u -->
        <var-decl name='u' type-id='type-id-123' visibility='default' filepath='../include/lttng/ust-events.h' line='211' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {_lttng_basic_type basic;} -->
    <union-decl name='__anonymous_union__2' size-in-bits='1024' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='209' column='1' id='type-id-123'>
      <data-member access='private'>
        <!-- _lttng_basic_type basic -->
        <var-decl name='basic' type-id='type-id-106' visibility='default' filepath='../include/lttng/ust-events.h' line='210' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {lttng_basic_type length_type; lttng_basic_type elem_type;} -->
    <class-decl name='__anonymous_struct__4' size-in-bits='2176' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='223' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_basic_type length_type -->
        <var-decl name='length_type' type-id='type-id-122' visibility='default' filepath='../include/lttng/ust-events.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- lttng_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-122' visibility='default' filepath='../include/lttng/ust-events.h' line='225' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_fields; lttng_event_field* fields;} -->
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='227' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-events.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_event_field* fields -->
        <var-decl name='fields' type-id='type-id-125' visibility='default' filepath='../include/lttng/ust-events.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint32_t uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-126' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-124'/>
    <!-- typedef unsigned int __uint32_t -->
    <typedef-decl name='__uint32_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-126'/>
    <!-- struct lttng_channel -->
    <class-decl name='lttng_channel' size-in-bits='960' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='525' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- channel* lttng_channel::chan -->
        <var-decl name='chan' type-id='type-id-128' visibility='default' filepath='../include/lttng/ust-events.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_channel::enabled -->
        <var-decl name='enabled' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ctx* lttng_channel::ctx -->
        <var-decl name='ctx' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-events.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_session* lttng_channel::session -->
        <var-decl name='session' type-id='type-id-129' visibility='default' filepath='../include/lttng/ust-events.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_channel::objd -->
        <var-decl name='objd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- unsigned int lttng_channel::_deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned int lttng_channel::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- cds_list_head lttng_channel::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- const lttng_channel_ops* lttng_channel::ops -->
        <var-decl name='ops' type-id='type-id-130' visibility='default' filepath='../include/lttng/ust-events.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int lttng_channel::header_type -->
        <var-decl name='header_type' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- lttng_ust_shm_handle* lttng_channel::handle -->
        <var-decl name='handle' type-id='type-id-131' visibility='default' filepath='../include/lttng/ust-events.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_channel::_deprecated3 -->
        <var-decl name='_deprecated3' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- unsigned int lttng_channel::id -->
        <var-decl name='id' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- lttng_ust_chan_type lttng_channel::type -->
        <var-decl name='type' type-id='type-id-132' visibility='default' filepath='../include/lttng/ust-events.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <!-- unsigned char lttng_channel::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-84' visibility='default' filepath='../include/lttng/ust-events.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_channel::tstate -->
        <var-decl name='tstate' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='550' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_channel_ops -->
    <class-decl name='lttng_channel_ops' size-in-bits='768' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='484' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_channel* (const char*, void*, typedef size_t, typedef size_t, unsigned int, unsigned int, unsigned char*, typedef uint32_t, const int*, int)* lttng_channel_ops::channel_create -->
        <var-decl name='channel_create' type-id='type-id-134' visibility='default' filepath='../include/lttng/ust-events.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (lttng_channel*)* lttng_channel_ops::channel_destroy -->
        <var-decl name='channel_destroy' type-id='type-id-135' visibility='default' filepath='../include/lttng/ust-events.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- union {void* _deprecated1; unsigned long int has_strcpy;} lttng_channel_ops::u -->
        <var-decl name='u' type-id='type-id-136' visibility='default' filepath='../include/lttng/ust-events.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* lttng_channel_ops::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-events.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int (lttng_ust_lib_ring_buffer_ctx*, typedef uint32_t)* lttng_channel_ops::event_reserve -->
        <var-decl name='event_reserve' type-id='type-id-137' visibility='default' filepath='../include/lttng/ust-events.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void (lttng_ust_lib_ring_buffer_ctx*)* lttng_channel_ops::event_commit -->
        <var-decl name='event_commit' type-id='type-id-138' visibility='default' filepath='../include/lttng/ust-events.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (lttng_ust_lib_ring_buffer_ctx*, void*, typedef size_t)* lttng_channel_ops::event_write -->
        <var-decl name='event_write' type-id='type-id-139' visibility='default' filepath='../include/lttng/ust-events.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- typedef size_t (channel*, lttng_ust_shm_handle*)* lttng_channel_ops::packet_avail_size -->
        <var-decl name='packet_avail_size' type-id='type-id-140' visibility='default' filepath='../include/lttng/ust-events.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int (channel*)* lttng_channel_ops::is_finalized -->
        <var-decl name='is_finalized' type-id='type-id-141' visibility='default' filepath='../include/lttng/ust-events.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int (channel*)* lttng_channel_ops::is_disabled -->
        <var-decl name='is_disabled' type-id='type-id-141' visibility='default' filepath='../include/lttng/ust-events.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int (channel*, lttng_ust_shm_handle*)* lttng_channel_ops::flush_buffer -->
        <var-decl name='flush_buffer' type-id='type-id-142' visibility='default' filepath='../include/lttng/ust-events.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void (lttng_ust_lib_ring_buffer_ctx*, const char*, typedef size_t)* lttng_channel_ops::event_strcpy -->
        <var-decl name='event_strcpy' type-id='type-id-143' visibility='default' filepath='../include/lttng/ust-events.h' line='516' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {void* _deprecated1; unsigned long int has_strcpy;} -->
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='494' column='1' id='type-id-136'>
      <data-member access='private'>
        <!-- void* _deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-events.h' line='495' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- unsigned long int has_strcpy -->
        <var-decl name='has_strcpy' type-id='type-id-3' visibility='default' filepath='../include/lttng/ust-events.h' line='496' column='1'/>
      </data-member>
    </union-decl>
    <!-- enum lttng_ust_chan_type -->
    <enum-decl name='lttng_ust_chan_type' filepath='../include/lttng/ust-abi.h' line='64' column='1' id='type-id-132'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_UST_CHAN_PER_CPU' value='0'/>
      <enumerator name='LTTNG_UST_CHAN_METADATA' value='1'/>
    </enum-decl>
    <!-- struct lttng_ctx_value -->
    <class-decl name='lttng_ctx_value' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='275' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_dynamic_type lttng_ctx_value::sel -->
        <var-decl name='sel' type-id='type-id-145' visibility='default' filepath='../include/lttng/ust-events.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {int64_t s64; const char* str; double d;} lttng_ctx_value::u -->
        <var-decl name='u' type-id='type-id-146' visibility='default' filepath='../include/lttng/ust-events.h' line='281' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_dynamic_type -->
    <enum-decl name='lttng_ust_dynamic_type' filepath='../include/lttng/ust-events.h' line='259' column='1' id='type-id-145'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_NONE' value='0'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S8' value='1'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S16' value='2'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S32' value='3'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S64' value='4'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U8' value='5'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U16' value='6'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U32' value='7'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U64' value='8'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_FLOAT' value='9'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_DOUBLE' value='10'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_STRING' value='11'/>
      <enumerator name='_NR_LTTNG_UST_DYNAMIC_TYPES' value='12'/>
    </enum-decl>
    <!-- union {int64_t s64; const char* str; double d;} -->
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='277' column='1' id='type-id-146'>
      <data-member access='private'>
        <!-- int64_t s64 -->
        <var-decl name='s64' type-id='type-id-147' visibility='default' filepath='../include/lttng/ust-events.h' line='278' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- const char* str -->
        <var-decl name='str' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='279' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- double d -->
        <var-decl name='d' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-events.h' line='280' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef __int64_t int64_t -->
    <typedef-decl name='int64_t' type-id='type-id-148' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-147'/>
    <!-- typedef long int __int64_t -->
    <typedef-decl name='__int64_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-148'/>
    <!-- union {lttng_perf_counter_field* perf_counter; char padding[40];} -->
    <union-decl name='__anonymous_union__5' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='295' column='1' id='type-id-101'>
      <data-member access='private'>
        <!-- lttng_perf_counter_field* perf_counter -->
        <var-decl name='perf_counter' type-id='type-id-149' visibility='default' filepath='../include/lttng/ust-events.h' line='296' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[40] -->
        <var-decl name='padding' type-id='type-id-74' visibility='default' filepath='../include/lttng/ust-events.h' line='297' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef __uint64_t uint64_t -->
    <typedef-decl name='uint64_t' type-id='type-id-150' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-151'/>
    <!-- typedef unsigned long int __uint64_t -->
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-150'/>
    <!-- enum ustctl_socket_type -->
    <enum-decl name='ustctl_socket_type' filepath='../include/lttng/ust-ctl.h' line='285' column='1' id='type-id-152'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='USTCTL_SOCKET_CMD' value='0'/>
      <enumerator name='USTCTL_SOCKET_NOTIFY' value='1'/>
    </enum-decl>
    <!-- struct ustcomm_ust_msg -->
    <class-decl name='ustcomm_ust_msg' size-in-bits='4896' is-struct='yes' visibility='default' filepath='../include/ust-comm.h' line='82' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t ustcomm_ust_msg::handle -->
        <var-decl name='handle' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ustcomm_ust_msg::cmd -->
        <var-decl name='cmd' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char ustcomm_ust_msg::padding[32] -->
        <var-decl name='padding' type-id='type-id-72' visibility='default' filepath='../include/ust-comm.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {lttng_ust_channel channel; lttng_ust_stream stream; lttng_ust_event event; lttng_ust_context context; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} filter; struct {uint32_t count;} exclusion; char padding[32];} ustcomm_ust_msg::u -->
        <var-decl name='u' type-id='type-id-154' visibility='default' filepath='../include/ust-comm.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {lttng_ust_channel channel; lttng_ust_stream stream; lttng_ust_event event; lttng_ust_context context; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} filter; struct {uint32_t count;} exclusion; char padding[32];} -->
    <union-decl name='__anonymous_union__6' size-in-bits='4576' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='86' column='1' id='type-id-154'>
      <data-member access='private'>
        <!-- lttng_ust_channel channel -->
        <var-decl name='channel' type-id='type-id-155' visibility='default' filepath='../include/ust-comm.h' line='87' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_stream stream -->
        <var-decl name='stream' type-id='type-id-156' visibility='default' filepath='../include/ust-comm.h' line='88' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_event event -->
        <var-decl name='event' type-id='type-id-157' visibility='default' filepath='../include/ust-comm.h' line='89' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_context context -->
        <var-decl name='context' type-id='type-id-158' visibility='default' filepath='../include/ust-comm.h' line='90' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracer_version version -->
        <var-decl name='version' type-id='type-id-159' visibility='default' filepath='../include/ust-comm.h' line='91' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracepoint_iter tracepoint -->
        <var-decl name='tracepoint' type-id='type-id-160' visibility='default' filepath='../include/ust-comm.h' line='92' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} filter -->
        <var-decl name='filter' type-id='type-id-161' visibility='default' filepath='../include/ust-comm.h' line='97' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t count;} exclusion -->
        <var-decl name='exclusion' type-id='type-id-162' visibility='default' filepath='../include/ust-comm.h' line='100' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-72' visibility='default' filepath='../include/ust-comm.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_channel -->
    <class-decl name='lttng_ust_channel' size-in-bits='2400' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='83' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_channel::len -->
        <var-decl name='len' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-abi.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_chan_type lttng_ust_channel::type -->
        <var-decl name='type' type-id='type-id-132' visibility='default' filepath='../include/lttng/ust-abi.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_channel::padding[288] -->
        <var-decl name='padding' type-id='type-id-68' visibility='default' filepath='../include/lttng/ust-abi.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <!-- char lttng_ust_channel::data[] -->
        <var-decl name='data' type-id='type-id-76' visibility='default' filepath='../include/lttng/ust-abi.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_stream -->
    <class-decl name='lttng_ust_stream' size-in-bits='2400' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='91' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_stream::len -->
        <var-decl name='len' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-abi.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_stream::stream_nr -->
        <var-decl name='stream_nr' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_stream::padding[288] -->
        <var-decl name='padding' type-id='type-id-68' visibility='default' filepath='../include/lttng/ust-abi.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event -->
    <class-decl name='lttng_ust_event' size-in-bits='4576' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='103' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_instrumentation lttng_ust_event::instrumentation -->
        <var-decl name='instrumentation' type-id='type-id-163' visibility='default' filepath='../include/lttng/ust-abi.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_event::name[256] -->
        <var-decl name='name' type-id='type-id-66' visibility='default' filepath='../include/lttng/ust-abi.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- lttng_ust_loglevel_type lttng_ust_event::loglevel_type -->
        <var-decl name='loglevel_type' type-id='type-id-164' visibility='default' filepath='../include/lttng/ust-abi.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <!-- int lttng_ust_event::loglevel -->
        <var-decl name='loglevel' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <!-- char lttng_ust_event::padding[16] -->
        <var-decl name='padding' type-id='type-id-60' visibility='default' filepath='../include/lttng/ust-abi.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <!-- union {char padding[288];} lttng_ust_event::u -->
        <var-decl name='u' type-id='type-id-165' visibility='default' filepath='../include/lttng/ust-abi.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_instrumentation -->
    <enum-decl name='lttng_ust_instrumentation' filepath='../include/lttng/ust-abi.h' line='48' column='1' id='type-id-163'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_UST_TRACEPOINT' value='0'/>
      <enumerator name='LTTNG_UST_PROBE' value='1'/>
      <enumerator name='LTTNG_UST_FUNCTION' value='2'/>
    </enum-decl>
    <!-- enum lttng_ust_loglevel_type -->
    <enum-decl name='lttng_ust_loglevel_type' filepath='../include/lttng/ust-abi.h' line='54' column='1' id='type-id-164'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_UST_LOGLEVEL_ALL' value='0'/>
      <enumerator name='LTTNG_UST_LOGLEVEL_RANGE' value='1'/>
      <enumerator name='LTTNG_UST_LOGLEVEL_SINGLE' value='2'/>
    </enum-decl>
    <!-- union {char padding[288];} -->
    <union-decl name='__anonymous_union__7' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='112' column='1' id='type-id-165'>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-68' visibility='default' filepath='../include/lttng/ust-abi.h' line='113' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_context -->
    <class-decl name='lttng_ust_context' size-in-bits='2464' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='154' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_context_type lttng_ust_context::ctx -->
        <var-decl name='ctx' type-id='type-id-166' visibility='default' filepath='../include/lttng/ust-abi.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_context::padding[16] -->
        <var-decl name='padding' type-id='type-id-60' visibility='default' filepath='../include/lttng/ust-abi.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- union {lttng_ust_perf_counter_ctx perf_counter; struct {uint32_t provider_name_len; uint32_t ctx_name_len;} app_ctx; char padding[288];} lttng_ust_context::u -->
        <var-decl name='u' type-id='type-id-167' visibility='default' filepath='../include/lttng/ust-abi.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_context_type -->
    <enum-decl name='lttng_ust_context_type' filepath='../include/lttng/ust-abi.h' line='135' column='1' id='type-id-166'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_UST_CONTEXT_VTID' value='0'/>
      <enumerator name='LTTNG_UST_CONTEXT_VPID' value='1'/>
      <enumerator name='LTTNG_UST_CONTEXT_PTHREAD_ID' value='2'/>
      <enumerator name='LTTNG_UST_CONTEXT_PROCNAME' value='3'/>
      <enumerator name='LTTNG_UST_CONTEXT_IP' value='4'/>
      <enumerator name='LTTNG_UST_CONTEXT_PERF_THREAD_COUNTER' value='5'/>
      <enumerator name='LTTNG_UST_CONTEXT_CPU_ID' value='6'/>
      <enumerator name='LTTNG_UST_CONTEXT_APP_CONTEXT' value='7'/>
    </enum-decl>
    <!-- union {lttng_ust_perf_counter_ctx perf_counter; struct {uint32_t provider_name_len; uint32_t ctx_name_len;} app_ctx; char padding[288];} -->
    <union-decl name='__anonymous_union__8' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='158' column='1' id='type-id-167'>
      <data-member access='private'>
        <!-- lttng_ust_perf_counter_ctx perf_counter -->
        <var-decl name='perf_counter' type-id='type-id-168' visibility='default' filepath='../include/lttng/ust-abi.h' line='159' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t provider_name_len; uint32_t ctx_name_len;} app_ctx -->
        <var-decl name='app_ctx' type-id='type-id-169' visibility='default' filepath='../include/lttng/ust-abi.h' line='164' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-68' visibility='default' filepath='../include/lttng/ust-abi.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_perf_counter_ctx -->
    <class-decl name='lttng_ust_perf_counter_ctx' size-in-bits='2144' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='146' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_perf_counter_ctx::type -->
        <var-decl name='type' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint64_t lttng_ust_perf_counter_ctx::config -->
        <var-decl name='config' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-abi.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_perf_counter_ctx::name[256] -->
        <var-decl name='name' type-id='type-id-66' visibility='default' filepath='../include/lttng/ust-abi.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t provider_name_len; uint32_t ctx_name_len;} -->
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='160' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t provider_name_len -->
        <var-decl name='provider_name_len' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ctx_name_len -->
        <var-decl name='ctx_name_len' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracer_version -->
    <class-decl name='lttng_ust_tracer_version' size-in-bits='96' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='69' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_tracer_version::major -->
        <var-decl name='major' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_tracer_version::minor -->
        <var-decl name='minor' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_tracer_version::patchlevel -->
        <var-decl name='patchlevel' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_iter -->
    <class-decl name='lttng_ust_tracepoint_iter' size-in-bits='2208' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='184' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_tracepoint_iter::name[256] -->
        <var-decl name='name' type-id='type-id-66' visibility='default' filepath='../include/lttng/ust-abi.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- int lttng_ust_tracepoint_iter::loglevel -->
        <var-decl name='loglevel' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- char lttng_ust_tracepoint_iter::padding[16] -->
        <var-decl name='padding' type-id='type-id-60' visibility='default' filepath='../include/lttng/ust-abi.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} -->
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='93' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t data_size -->
        <var-decl name='data_size' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t reloc_offset -->
        <var-decl name='reloc_offset' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t seqnum -->
        <var-decl name='seqnum' type-id='type-id-151' visibility='default' filepath='../include/ust-comm.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t count;} -->
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='98' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t count -->
        <var-decl name='count' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustcomm_ust_reply -->
    <class-decl name='ustcomm_ust_reply' size-in-bits='2592' is-struct='yes' visibility='default' filepath='../include/ust-comm.h' line='111' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t ustcomm_ust_reply::handle -->
        <var-decl name='handle' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ustcomm_ust_reply::cmd -->
        <var-decl name='cmd' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int32_t ustcomm_ust_reply::ret_code -->
        <var-decl name='ret_code' type-id='type-id-171' visibility='default' filepath='../include/ust-comm.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t ustcomm_ust_reply::ret_val -->
        <var-decl name='ret_val' type-id='type-id-124' visibility='default' filepath='../include/ust-comm.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char ustcomm_ust_reply::padding[32] -->
        <var-decl name='padding' type-id='type-id-72' visibility='default' filepath='../include/ust-comm.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {struct {uint64_t memory_map_size;} channel; struct {uint64_t memory_map_size;} stream; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; char padding[32];} ustcomm_ust_reply::u -->
        <var-decl name='u' type-id='type-id-172' visibility='default' filepath='../include/ust-comm.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __int32_t int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-173' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-171'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-173'/>
    <!-- union {struct {uint64_t memory_map_size;} channel; struct {uint64_t memory_map_size;} stream; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; char padding[32];} -->
    <union-decl name='__anonymous_union__9' size-in-bits='2208' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='117' column='1' id='type-id-172'>
      <data-member access='private'>
        <!-- struct {uint64_t memory_map_size;} channel -->
        <var-decl name='channel' type-id='type-id-174' visibility='default' filepath='../include/ust-comm.h' line='120' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint64_t memory_map_size;} stream -->
        <var-decl name='stream' type-id='type-id-175' visibility='default' filepath='../include/ust-comm.h' line='123' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracer_version version -->
        <var-decl name='version' type-id='type-id-159' visibility='default' filepath='../include/ust-comm.h' line='124' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracepoint_iter tracepoint -->
        <var-decl name='tracepoint' type-id='type-id-160' visibility='default' filepath='../include/ust-comm.h' line='125' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-72' visibility='default' filepath='../include/ust-comm.h' line='126' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {uint64_t memory_map_size;} -->
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='118' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-151' visibility='default' filepath='../include/ust-comm.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint64_t memory_map_size;} -->
    <class-decl name='__anonymous_struct__10' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='121' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-151' visibility='default' filepath='../include/ust-comm.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <!-- cds_hlist_node* -->
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-92'/>
    <!-- cds_list_head* -->
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-91'/>
    <!-- channel* -->
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-128'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-176'/>
    <!-- const int* -->
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <!-- const lttng_channel_ops -->
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-178'/>
    <!-- const lttng_channel_ops* -->
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-130'/>
    <!-- const lttng_ctx_field -->
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-179'/>
    <!-- const lttng_ctx_field* -->
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <!-- const lttng_enum_desc -->
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-181'/>
    <!-- const lttng_enum_desc* -->
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-115'/>
    <!-- const lttng_enum_entry -->
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-182'/>
    <!-- const lttng_enum_entry* -->
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-117'/>
    <!-- const lttng_event_field -->
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-183'/>
    <!-- const lttng_event_field* -->
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <!-- int (channel*)* -->
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-141'/>
    <!-- int (channel*, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-142'/>
    <!-- int (lttng_ust_lib_ring_buffer_ctx*, typedef uint32_t)* -->
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-137'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-188'/>
    <!-- lttng_channel* -->
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-189'/>
    <!-- lttng_channel* (const char*, void*, typedef size_t, typedef size_t, unsigned int, unsigned int, unsigned char*, typedef uint32_t, const int*, int)* -->
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-134'/>
    <!-- lttng_ctx* -->
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-90'/>
    <!-- lttng_ctx_field* -->
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-95'/>
    <!-- lttng_ctx_value* -->
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-191'/>
    <!-- lttng_event_field* -->
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-125'/>
    <!-- lttng_perf_counter_field* -->
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-149'/>
    <!-- lttng_session* -->
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-129'/>
    <!-- lttng_ust_lib_ring_buffer_ctx* -->
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-192'/>
    <!-- lttng_ust_shm_handle* -->
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-131'/>
    <!-- typedef size_t (channel*, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-140'/>
    <!-- typedef size_t (lttng_ctx_field*, typedef size_t)* -->
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-98'/>
    <!-- uint32_t* -->
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-195'/>
    <!-- uint64_t* -->
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-196'/>
    <!-- ustcomm_ust_msg* -->
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-197'/>
    <!-- ustcomm_ust_reply* -->
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-198'/>
    <!-- void (lttng_channel*)* -->
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-135'/>
    <!-- void (lttng_ctx_field*)* -->
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-102'/>
    <!-- void (lttng_ctx_field*, lttng_ctx_value*)* -->
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-100'/>
    <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)* -->
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-99'/>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*)* -->
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-138'/>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, const char*, typedef size_t)* -->
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-143'/>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, void*, typedef size_t)* -->
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-139'/>
    <!-- void** -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-206'/>
    <!-- int ustcomm_setsockopt_snd_timeout(int, unsigned int) -->
    <function-decl name='ustcomm_setsockopt_snd_timeout' mangled-name='ustcomm_setsockopt_snd_timeout' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_setsockopt_snd_timeout'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1598' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-13' name='msec' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1598' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_setsockopt_rcv_timeout(int, unsigned int) -->
    <function-decl name='ustcomm_setsockopt_rcv_timeout' mangled-name='ustcomm_setsockopt_rcv_timeout' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_setsockopt_rcv_timeout'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1578' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-13' name='msec' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1578' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_register_channel(int, lttng_session*, int, int, size_t, const lttng_ctx_field*, uint32_t*, int*) -->
    <function-decl name='ustcomm_register_channel' mangled-name='ustcomm_register_channel' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_register_channel'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1471' column='1'/>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1472' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='session_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1473' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='channel_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1474' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='nr_ctx_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1475' column='1'/>
      <!-- parameter of type 'const lttng_ctx_field*' -->
      <parameter type-id='type-id-180' name='ctx_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1476' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-195' name='chan_id' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1477' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-188' name='header_type' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1478' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_register_enum(int, int, const char*, size_t, const lttng_enum_entry*, uint64_t*) -->
    <function-decl name='ustcomm_register_enum' mangled-name='ustcomm_register_enum' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_register_enum'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1367' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='session_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1368' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='enum_name' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1369' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='nr_entries' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1370' column='1'/>
      <!-- parameter of type 'const lttng_enum_entry*' -->
      <parameter type-id='type-id-117' name='lttng_entries' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1371' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-196' name='id' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1372' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_register_event(int, lttng_session*, int, int, const char*, int, const char*, size_t, const lttng_event_field*, const char*, uint32_t*) -->
    <function-decl name='ustcomm_register_event' mangled-name='ustcomm_register_event' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_register_event'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1224' column='1'/>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1225' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='session_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1226' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='channel_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1227' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='event_name' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1228' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='loglevel' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1229' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='signature' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1230' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='nr_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1231' column='1'/>
      <!-- parameter of type 'const lttng_event_field*' -->
      <parameter type-id='type-id-184' name='lttng_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1232' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='model_emf_uri' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1233' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-195' name='id' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1234' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_send_reg_msg(int, ustctl_socket_type, uint32_t, uint32_t, uint32_t, uint32_t, uint32_t, uint32_t) -->
    <function-decl name='ustcomm_send_reg_msg' mangled-name='ustcomm_send_reg_msg' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_reg_msg'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='715' column='1'/>
      <!-- parameter of type 'enum ustctl_socket_type' -->
      <parameter type-id='type-id-152' name='type' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='716' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='bits_per_long' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='717' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='uint8_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='718' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='uint16_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='719' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='uint32_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='720' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='uint64_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='721' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='long_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='722' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_recv_stream_from_sessiond(int, uint64_t*, int*, int*) -->
    <function-decl name='ustcomm_recv_stream_from_sessiond' mangled-name='ustcomm_recv_stream_from_sessiond' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_stream_from_sessiond'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='655' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-196' name='memory_map_size' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='656' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-188' name='shm_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='657' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-188' name='wakeup_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='657' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- ssize_t ustcomm_recv_channel_from_sessiond(int, void**, uint64_t, int*) -->
    <function-decl name='ustcomm_recv_channel_from_sessiond' mangled-name='ustcomm_recv_channel_from_sessiond' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_channel_from_sessiond'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='595' column='1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-206' name='_chan_data' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='596' column='1'/>
      <!-- parameter of type 'typedef uint64_t' -->
      <parameter type-id='type-id-151' name='var_len' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='596' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-188' name='_wakeup_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='597' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- int ustcomm_send_app_cmd(int, ustcomm_ust_msg*, ustcomm_ust_reply*) -->
    <function-decl name='ustcomm_send_app_cmd' mangled-name='ustcomm_send_app_cmd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_app_cmd'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='576' column='1'/>
      <!-- parameter of type 'ustcomm_ust_msg*' -->
      <parameter type-id='type-id-197' name='lum' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='577' column='1'/>
      <!-- parameter of type 'ustcomm_ust_reply*' -->
      <parameter type-id='type-id-198' name='lur' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='578' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_recv_app_reply(int, ustcomm_ust_reply*, uint32_t, uint32_t) -->
    <function-decl name='ustcomm_recv_app_reply' mangled-name='ustcomm_recv_app_reply' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_app_reply'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='536' column='1'/>
      <!-- parameter of type 'ustcomm_ust_reply*' -->
      <parameter type-id='type-id-198' name='lur' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='536' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='expected_handle' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='537' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124' name='expected_cmd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='537' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_send_app_msg(int, ustcomm_ust_msg*) -->
    <function-decl name='ustcomm_send_app_msg' mangled-name='ustcomm_send_app_msg' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_app_msg'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='517' column='1'/>
      <!-- parameter of type 'ustcomm_ust_msg*' -->
      <parameter type-id='type-id-197' name='lum' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='517' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- ssize_t ustcomm_recv_fds_unix_sock(int, int*, size_t) -->
    <function-decl name='ustcomm_recv_fds_unix_sock' mangled-name='ustcomm_recv_fds_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_fds_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-188' name='fds' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='nb_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- ssize_t ustcomm_send_fds_unix_sock(int, int*, size_t) -->
    <function-decl name='ustcomm_send_fds_unix_sock' mangled-name='ustcomm_send_fds_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_fds_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-188' name='fds' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='nb_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- ssize_t ustcomm_send_unix_sock(int, void*, size_t) -->
    <function-decl name='ustcomm_send_unix_sock' mangled-name='ustcomm_send_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='buf' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='len' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- ssize_t ustcomm_recv_unix_sock(int, void*, size_t) -->
    <function-decl name='ustcomm_recv_unix_sock' mangled-name='ustcomm_recv_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='buf' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='len' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- int ustcomm_close_unix_sock(int) -->
    <function-decl name='ustcomm_close_unix_sock' mangled-name='ustcomm_close_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_close_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='266' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_listen_unix_sock(int) -->
    <function-decl name='ustcomm_listen_unix_sock' mangled-name='ustcomm_listen_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_listen_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='246' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_create_unix_sock(const char*) -->
    <function-decl name='ustcomm_create_unix_sock' mangled-name='ustcomm_create_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_create_unix_sock'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='pathname' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='200' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_accept_unix_sock(int) -->
    <function-decl name='ustcomm_accept_unix_sock' mangled-name='ustcomm_accept_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_accept_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='176' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int ustcomm_connect_unix_sock(const char*, long int) -->
    <function-decl name='ustcomm_connect_unix_sock' mangled-name='ustcomm_connect_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_connect_unix_sock'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='pathname' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='101' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-6' name='timeout' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='101' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- const char* lttng_ust_strerror(int) -->
    <function-decl name='lttng_ust_strerror' mangled-name='lttng_ust_strerror' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_strerror'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='code' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='83' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-34'/>
    </function-decl>
    <!-- int (channel*) -->
    <function-type size-in-bits='64' id='type-id-185'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-128'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (channel*, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-186'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-128'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-131'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (lttng_ust_lib_ring_buffer_ctx*, uint32_t) -->
    <function-type size-in-bits='64' id='type-id-187'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- lttng_channel* (const char*, void*, size_t, size_t, unsigned int, unsigned int, unsigned char*, uint32_t, const int*, int) -->
    <function-type size-in-bits='64' id='type-id-190'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-13'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-13'/>
      <!-- parameter of type 'unsigned char*' -->
      <parameter type-id='type-id-17'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-124'/>
      <!-- parameter of type 'const int*' -->
      <parameter type-id='type-id-177'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- lttng_channel* -->
      <return type-id='type-id-189'/>
    </function-type>
    <!-- size_t (channel*, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-193'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-128'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-131'/>
      <!-- typedef size_t -->
      <return type-id='type-id-42'/>
    </function-type>
    <!-- size_t (lttng_ctx_field*, size_t) -->
    <function-type size-in-bits='64' id='type-id-194'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42'/>
      <!-- typedef size_t -->
      <return type-id='type-id-42'/>
    </function-type>
    <!-- void (lttng_channel*) -->
    <function-type size-in-bits='64' id='type-id-199'>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-189'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (lttng_ctx_field*) -->
    <function-type size-in-bits='64' id='type-id-200'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-95'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (lttng_ctx_field*, lttng_ctx_value*) -->
    <function-type size-in-bits='64' id='type-id-201'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'lttng_ctx_value*' -->
      <parameter type-id='type-id-191'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*) -->
    <function-type size-in-bits='64' id='type-id-202'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-189'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*) -->
    <function-type size-in-bits='64' id='type-id-203'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-192'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, const char*, size_t) -->
    <function-type size-in-bits='64' id='type-id-204'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, void*, size_t) -->
    <function-type size-in-bits='64' id='type-id-205'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-fd-tracker.c' comp-dir-path='liblttng-ust-comm' language='LANG_C99'>
    <!-- char[1] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-207'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-3' id='type-id-10'/>

    </array-type-def>
    <!-- struct _IO_codecvt -->
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-208'/>
    <!-- struct _IO_marker -->
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-209'/>
    <!-- struct _IO_wide_data -->
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-210'/>
    <!-- signed char -->
    <type-decl name='signed char' size-in-bits='8' id='type-id-211'/>
    <!-- typedef _IO_FILE FILE -->
    <typedef-decl name='FILE' type-id='type-id-212' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-213'/>
    <!-- struct _IO_FILE -->
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int _IO_FILE::_flags -->
        <var-decl name='_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* _IO_FILE::_IO_read_ptr -->
        <var-decl name='_IO_read_ptr' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char* _IO_FILE::_IO_read_end -->
        <var-decl name='_IO_read_end' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- char* _IO_FILE::_IO_read_base -->
        <var-decl name='_IO_read_base' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- char* _IO_FILE::_IO_write_base -->
        <var-decl name='_IO_write_base' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char* _IO_FILE::_IO_write_ptr -->
        <var-decl name='_IO_write_ptr' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char* _IO_FILE::_IO_write_end -->
        <var-decl name='_IO_write_end' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- char* _IO_FILE::_IO_buf_base -->
        <var-decl name='_IO_buf_base' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- char* _IO_FILE::_IO_buf_end -->
        <var-decl name='_IO_buf_end' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- char* _IO_FILE::_IO_save_base -->
        <var-decl name='_IO_save_base' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- char* _IO_FILE::_IO_backup_base -->
        <var-decl name='_IO_backup_base' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- char* _IO_FILE::_IO_save_end -->
        <var-decl name='_IO_save_end' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- _IO_marker* _IO_FILE::_markers -->
        <var-decl name='_markers' type-id='type-id-214' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- _IO_FILE* _IO_FILE::_chain -->
        <var-decl name='_chain' type-id='type-id-215' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- int _IO_FILE::_fileno -->
        <var-decl name='_fileno' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <!-- int _IO_FILE::_flags2 -->
        <var-decl name='_flags2' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- __off_t _IO_FILE::_old_offset -->
        <var-decl name='_old_offset' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- unsigned short int _IO_FILE::_cur_column -->
        <var-decl name='_cur_column' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <!-- signed char _IO_FILE::_vtable_offset -->
        <var-decl name='_vtable_offset' type-id='type-id-211' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <!-- char _IO_FILE::_shortbuf[1] -->
        <var-decl name='_shortbuf' type-id='type-id-207' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- _IO_lock_t* _IO_FILE::_lock -->
        <var-decl name='_lock' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- __off64_t _IO_FILE::_offset -->
        <var-decl name='_offset' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- _IO_codecvt* _IO_FILE::_codecvt -->
        <var-decl name='_codecvt' type-id='type-id-218' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- _IO_wide_data* _IO_FILE::_wide_data -->
        <var-decl name='_wide_data' type-id='type-id-219' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- _IO_FILE* _IO_FILE::_freeres_list -->
        <var-decl name='_freeres_list' type-id='type-id-215' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- void* _IO_FILE::_freeres_buf -->
        <var-decl name='_freeres_buf' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- size_t _IO_FILE::__pad5 -->
        <var-decl name='__pad5' type-id='type-id-42' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- int _IO_FILE::_mode -->
        <var-decl name='_mode' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <!-- char _IO_FILE::_unused2[20] -->
        <var-decl name='_unused2' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef void _IO_lock_t -->
    <typedef-decl name='_IO_lock_t' type-id='type-id-14' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-220'/>
    <!-- typedef long int __off64_t -->
    <typedef-decl name='__off64_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-217'/>
    <!-- FILE* -->
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-221'/>
    <!-- _IO_FILE* -->
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-215'/>
    <!-- _IO_codecvt* -->
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-218'/>
    <!-- _IO_lock_t* -->
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-216'/>
    <!-- _IO_marker* -->
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-214'/>
    <!-- _IO_wide_data* -->
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-219'/>
    <!-- int (FILE*)* -->
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <!-- int (int)* -->
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <!-- int lttng_ust_safe_closefrom_fd(int, int (int)*) -->
    <function-decl name='lttng_ust_safe_closefrom_fd' mangled-name='lttng_ust_safe_closefrom_fd' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_safe_closefrom_fd'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='lowfd' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='426' column='1'/>
      <!-- parameter of type 'int (int)*' -->
      <parameter type-id='type-id-225' name='close_cb' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='426' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_ust_safe_fclose_stream(FILE*, int (FILE*)*) -->
    <function-decl name='lttng_ust_safe_fclose_stream' mangled-name='lttng_ust_safe_fclose_stream' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_safe_fclose_stream'>
      <!-- parameter of type 'FILE*' -->
      <parameter type-id='type-id-221' name='stream' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='371' column='1'/>
      <!-- parameter of type 'int (FILE*)*' -->
      <parameter type-id='type-id-223' name='fclose_cb' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='371' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_ust_safe_close_fd(int, int (int)*) -->
    <function-decl name='lttng_ust_safe_close_fd' mangled-name='lttng_ust_safe_close_fd' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_safe_close_fd'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='fd' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='335' column='1'/>
      <!-- parameter of type 'int (int)*' -->
      <parameter type-id='type-id-225' name='close_cb' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='335' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_ust_delete_fd_from_tracker(int) -->
    <function-decl name='lttng_ust_delete_fd_from_tracker' mangled-name='lttng_ust_delete_fd_from_tracker' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_delete_fd_from_tracker'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='fd' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='313' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_ust_add_fd_to_tracker(int) -->
    <function-decl name='lttng_ust_add_fd_to_tracker' mangled-name='lttng_ust_add_fd_to_tracker' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_add_fd_to_tracker'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='fd' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='280' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_ust_unlock_fd_tracker() -->
    <function-decl name='lttng_ust_unlock_fd_tracker' mangled-name='lttng_ust_unlock_fd_tracker' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_unlock_fd_tracker'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_ust_lock_fd_tracker() -->
    <function-decl name='lttng_ust_lock_fd_tracker' mangled-name='lttng_ust_lock_fd_tracker' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_lock_fd_tracker'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_ust_init_fd_tracker() -->
    <function-decl name='lttng_ust_init_fd_tracker' mangled-name='lttng_ust_init_fd_tracker' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_init_fd_tracker'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_ust_fixup_fd_tracker_tls() -->
    <function-decl name='lttng_ust_fixup_fd_tracker_tls' mangled-name='lttng_ust_fixup_fd_tracker_tls' filepath='liblttng-ust-comm/lttng-ust-fd-tracker.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_fixup_fd_tracker_tls'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int (FILE*) -->
    <function-type size-in-bits='64' id='type-id-222'>
      <!-- parameter of type 'FILE*' -->
      <parameter type-id='type-id-221'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (int) -->
    <function-type size-in-bits='64' id='type-id-224'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-comm.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- char[4096] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='32768' id='type-id-226'>
      <!-- <anonymous range>[4096] -->
      <subrange length='4096' type-id='type-id-3' id='type-id-57'/>

    </array-type-def>
    <!-- unsigned long int[16] -->
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='1024' id='type-id-227'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-61'/>

    </array-type-def>
    <!-- struct sock_info -->
    <class-decl name='sock_info' size-in-bits='66048' is-struct='yes' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='243' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* sock_info::name -->
        <var-decl name='name' type-id='type-id-34' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- pthread_t sock_info::ust_listener -->
        <var-decl name='ust_listener' type-id='type-id-229' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int sock_info::root_handle -->
        <var-decl name='root_handle' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int sock_info::registration_done -->
        <var-decl name='registration_done' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int sock_info::allowed -->
        <var-decl name='allowed' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int sock_info::global -->
        <var-decl name='global' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int sock_info::thread_active -->
        <var-decl name='thread_active' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- char sock_info::sock_path[4096] -->
        <var-decl name='sock_path' type-id='type-id-226' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <!-- int sock_info::socket -->
        <var-decl name='socket' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <!-- int sock_info::notify_socket -->
        <var-decl name='notify_socket' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33120'>
        <!-- char sock_info::wait_shm_path[4096] -->
        <var-decl name='wait_shm_path' type-id='type-id-226' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65920'>
        <!-- char* sock_info::wait_shm_mmap -->
        <var-decl name='wait_shm_mmap' type-id='type-id-32' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65984'>
        <!-- int sock_info::statedump_pending -->
        <var-decl name='statedump_pending' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66016'>
        <!-- int sock_info::initial_statedump_done -->
        <var-decl name='initial_statedump_done' type-id='type-id-5' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='260' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned long int pthread_t -->
    <typedef-decl name='pthread_t' type-id='type-id-3' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-229'/>
    <!-- typedef __sigset_t sigset_t -->
    <typedef-decl name='sigset_t' type-id='type-id-230' filepath='/usr/include/bits/types/sigset_t.h' line='7' column='1' id='type-id-231'/>
    <!-- typedef __anonymous_struct__ __sigset_t -->
    <typedef-decl name='__sigset_t' type-id='type-id-232' filepath='/usr/include/bits/types/__sigset_t.h' line='8' column='1' id='type-id-230'/>
    <!-- struct {unsigned long int __val[16];} -->
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-230' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='5' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int __val[16] -->
        <var-decl name='__val' type-id='type-id-227' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>
    <!-- sigset_t* -->
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-233'/>
    <!-- int lttng_ust_loaded -->
    <var-decl name='lttng_ust_loaded' type-id='type-id-5' mangled-name='lttng_ust_loaded' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='118' column='1' elf-symbol-id='lttng_ust_loaded'/>
    <!-- sock_info global_apps -->
    <var-decl name='global_apps' type-id='type-id-228' mangled-name='global_apps' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='264' column='1' elf-symbol-id='global_apps'/>
    <!-- sock_info local_apps -->
    <var-decl name='local_apps' type-id='type-id-228' mangled-name='local_apps' visibility='default' filepath='liblttng-ust/lttng-ust-comm.c' line='285' column='1' elf-symbol-id='local_apps'/>
    <!-- void lttng_ust_sockinfo_session_enabled(void*) -->
    <function-decl name='lttng_ust_sockinfo_session_enabled' mangled-name='lttng_ust_sockinfo_session_enabled' filepath='liblttng-ust/lttng-ust-comm.c' line='2087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_sockinfo_session_enabled'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='owner' filepath='liblttng-ust/lttng-ust-comm.c' line='2087' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void ust_after_fork_child(sigset_t*) -->
    <function-decl name='ust_after_fork_child' mangled-name='ust_after_fork_child' filepath='liblttng-ust/lttng-ust-comm.c' line='2071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_after_fork_child'>
      <!-- parameter of type 'sigset_t*' -->
      <parameter type-id='type-id-233' name='restore_sigset' filepath='liblttng-ust/lttng-ust-comm.c' line='2071' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void ust_after_fork_parent(sigset_t*) -->
    <function-decl name='ust_after_fork_parent' mangled-name='ust_after_fork_parent' filepath='liblttng-ust/lttng-ust-comm.c' line='2052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_after_fork_parent'>
      <!-- parameter of type 'sigset_t*' -->
      <parameter type-id='type-id-233' name='restore_sigset' filepath='liblttng-ust/lttng-ust-comm.c' line='2052' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void ust_before_fork(sigset_t*) -->
    <function-decl name='ust_before_fork' mangled-name='ust_before_fork' filepath='liblttng-ust/lttng-ust-comm.c' line='2003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_before_fork'>
      <!-- parameter of type 'sigset_t*' -->
      <parameter type-id='type-id-233' name='save_sigset' filepath='liblttng-ust/lttng-ust-comm.c' line='2003' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_ust_exit() -->
    <function-decl name='lttng_ust_exit' mangled-name='lttng_ust_exit' filepath='liblttng-ust/lttng-ust-comm.c' line='1944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_exit'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_ust_init() -->
    <function-decl name='lttng_ust_init' mangled-name='lttng_ust_init' filepath='liblttng-ust/lttng-ust-comm.c' line='1753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_init'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_ust_malloc_wrapper_init() -->
    <function-decl name='lttng_ust_malloc_wrapper_init' mangled-name='lttng_ust_malloc_wrapper_init' filepath='liblttng-ust/lttng-ust-comm.c' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_malloc_wrapper_init'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_get_notify_socket(void*) -->
    <function-decl name='lttng_get_notify_socket' mangled-name='lttng_get_notify_socket' filepath='liblttng-ust/lttng-ust-comm.c' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_get_notify_socket'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='owner' filepath='liblttng-ust/lttng-ust-comm.c' line='425' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_ust_fixup_tls() -->
    <function-decl name='lttng_ust_fixup_tls' mangled-name='lttng_ust_fixup_tls' filepath='liblttng-ust/lttng-ust-comm.c' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_fixup_tls'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- ssize_t lttng_ust_read(int, void*, size_t) -->
    <function-decl name='lttng_ust_read' mangled-name='lttng_ust_read' filepath='liblttng-ust/lttng-ust-comm.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_read'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='fd' filepath='liblttng-ust/lttng-ust-comm.c' line='354' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='buf' filepath='liblttng-ust/lttng-ust-comm.c' line='354' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-42' name='len' filepath='liblttng-ust/lttng-ust-comm.c' line='354' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-54'/>
    </function-decl>
    <!-- void ust_unlock() -->
    <function-decl name='ust_unlock' mangled-name='ust_unlock' filepath='liblttng-ust/lttng-ust-comm.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_unlock'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void ust_lock_nocheck() -->
    <function-decl name='ust_lock_nocheck' mangled-name='ust_lock_nocheck' filepath='liblttng-ust/lttng-ust-comm.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_lock_nocheck'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int ust_lock() -->
    <function-decl name='ust_lock' mangled-name='ust_lock' filepath='liblttng-ust/lttng-ust-comm.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ust_lock'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-abi.c' comp-dir-path='liblttng-ust' language='LANG_C99'>

    <!-- char[284] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2272' id='type-id-234'>
      <!-- <anonymous range>[284] -->
      <subrange length='284' type-id='type-id-3' id='type-id-235'/>

    </array-type-def>
    <!-- struct lttng_ust_tracepoint_dlopen -->
    <class-decl name='lttng_ust_tracepoint_dlopen' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint.h' line='215' column='1' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* lttng_ust_tracepoint_dlopen::liblttngust_handle -->
        <var-decl name='liblttngust_handle' type-id='type-id-19' visibility='default' filepath='../include/lttng/tracepoint.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int (lttng_ust_tracepoint* const*, int)* lttng_ust_tracepoint_dlopen::tracepoint_register_lib -->
        <var-decl name='tracepoint_register_lib' type-id='type-id-237' visibility='default' filepath='../include/lttng/tracepoint.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int (lttng_ust_tracepoint* const*)* lttng_ust_tracepoint_dlopen::tracepoint_unregister_lib -->
        <var-decl name='tracepoint_unregister_lib' type-id='type-id-238' visibility='default' filepath='../include/lttng/tracepoint.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_lock_sym_bp -->
        <var-decl name='rcu_read_lock_sym_bp' type-id='type-id-239' visibility='default' filepath='../include/lttng/tracepoint.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_unlock_sym_bp -->
        <var-decl name='rcu_read_unlock_sym_bp' type-id='type-id-239' visibility='default' filepath='../include/lttng/tracepoint.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* (void*)* lttng_ust_tracepoint_dlopen::rcu_dereference_sym_bp -->
        <var-decl name='rcu_dereference_sym_bp' type-id='type-id-240' visibility='default' filepath='../include/lttng/tracepoint.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint -->
    <class-decl name='lttng_ust_tracepoint' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='32' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_ust_tracepoint::name -->
        <var-decl name='name' type-id='type-id-34' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_ust_tracepoint::state -->
        <var-decl name='state' type-id='type-id-5' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_tracepoint_probe* lttng_ust_tracepoint::probes -->
        <var-decl name='probes' type-id='type-id-242' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int* lttng_ust_tracepoint::tracepoint_provider_ref -->
        <var-decl name='tracepoint_provider_ref' type-id='type-id-188' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const char* lttng_ust_tracepoint::signature -->
        <var-decl name='signature' type-id='type-id-34' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char lttng_ust_tracepoint::padding[16] -->
        <var-decl name='padding' type-id='type-id-60' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_probe -->
    <class-decl name='lttng_ust_tracepoint_probe' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='26' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* lttng_ust_tracepoint_probe::func -->
        <var-decl name='func' type-id='type-id-239' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_tracepoint_probe::data -->
        <var-decl name='data' type-id='type-id-19' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {void* chan_data; int wakeup_fd;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='306' column='1' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* chan_data -->
        <var-decl name='chan_data' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-abi.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='308' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int shm_fd; int wakeup_fd;} -->
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='310' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {lttng_ust_field_iter entry;} -->
    <class-decl name='__anonymous_struct__2' size-in-bits='6464' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='314' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_field_iter entry -->
        <var-decl name='entry' type-id='type-id-247' visibility='default' filepath='../include/lttng/ust-abi.h' line='315' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_field_iter -->
    <class-decl name='lttng_ust_field_iter' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='126' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_field_iter::event_name[256] -->
        <var-decl name='event_name' type-id='type-id-66' visibility='default' filepath='../include/lttng/ust-abi.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- char lttng_ust_field_iter::field_name[256] -->
        <var-decl name='field_name' type-id='type-id-66' visibility='default' filepath='../include/lttng/ust-abi.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <!-- lttng_ust_field_type lttng_ust_field_iter::type -->
        <var-decl name='type' type-id='type-id-248' visibility='default' filepath='../include/lttng/ust-abi.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <!-- int lttng_ust_field_iter::loglevel -->
        <var-decl name='loglevel' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <!-- int lttng_ust_field_iter::nowrite -->
        <var-decl name='nowrite' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-abi.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <!-- char lttng_ust_field_iter::padding[284] -->
        <var-decl name='padding' type-id='type-id-234' visibility='default' filepath='../include/lttng/ust-abi.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_field_type -->
    <enum-decl name='lttng_ust_field_type' filepath='../include/lttng/ust-abi.h' line='117' column='1' id='type-id-248'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_UST_FIELD_OTHER' value='0'/>
      <enumerator name='LTTNG_UST_FIELD_INTEGER' value='1'/>
      <enumerator name='LTTNG_UST_FIELD_ENUM' value='2'/>
      <enumerator name='LTTNG_UST_FIELD_FLOAT' value='3'/>
      <enumerator name='LTTNG_UST_FIELD_STRING' value='4'/>
    </enum-decl>
    <!-- struct {char* ctxname;} -->
    <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='317' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char* ctxname -->
        <var-decl name='ctxname' type-id='type-id-32' visibility='default' filepath='../include/lttng/ust-abi.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_objd_ops -->
    <class-decl name='lttng_ust_objd_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='322' column='1' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int (int, unsigned int, unsigned long int, ust_args*, void*)* lttng_ust_objd_ops::cmd -->
        <var-decl name='cmd' type-id='type-id-251' visibility='default' filepath='../include/lttng/ust-abi.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int (int)* lttng_ust_objd_ops::release -->
        <var-decl name='release' type-id='type-id-225' visibility='default' filepath='../include/lttng/ust-abi.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <!-- union ust_args -->
    <union-decl name='ust_args' size-in-bits='6464' visibility='default' filepath='../include/lttng/ust-abi.h' line='305' column='1' id='type-id-252'>
      <data-member access='private'>
        <!-- struct {void* chan_data; int wakeup_fd;} ust_args::channel -->
        <var-decl name='channel' type-id='type-id-244' visibility='default' filepath='../include/lttng/ust-abi.h' line='309' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int shm_fd; int wakeup_fd;} ust_args::stream -->
        <var-decl name='stream' type-id='type-id-245' visibility='default' filepath='../include/lttng/ust-abi.h' line='313' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_ust_field_iter entry;} ust_args::field_list -->
        <var-decl name='field_list' type-id='type-id-246' visibility='default' filepath='../include/lttng/ust-abi.h' line='316' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char* ctxname;} ust_args::app_context -->
        <var-decl name='app_context' type-id='type-id-249' visibility='default' filepath='../include/lttng/ust-abi.h' line='319' column='1'/>
      </data-member>
    </union-decl>
    <!-- const lttng_ust_objd_ops -->
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-253'/>
    <!-- const lttng_ust_objd_ops* -->
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <!-- int (lttng_ust_tracepoint* const*)* -->
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-238'/>
    <!-- int (lttng_ust_tracepoint* const*, int)* -->
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-237'/>
    <!-- long int (int, unsigned int, unsigned long int, ust_args*, void*)* -->
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-251'/>
    <!-- lttng_ust_channel* -->
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-258'/>
    <!-- lttng_ust_tracepoint* -->
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-259'/>
    <!-- lttng_ust_tracepoint* const -->
    <qualified-type-def type-id='type-id-259' const='yes' id='type-id-260'/>
    <!-- lttng_ust_tracepoint* const* -->
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <!-- lttng_ust_tracepoint_dlopen* -->
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-262'/>
    <!-- lttng_ust_tracepoint_probe* -->
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-242'/>
    <!-- ust_args* -->
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-263'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-239'/>
    <!-- void* (void*)* -->
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-240'/>
    <!-- int __tracepoints__disable_destructors -->
    <var-decl name='__tracepoints__disable_destructors' type-id='type-id-5' mangled-name='__tracepoints__disable_destructors' visibility='default' filepath='../include/lttng/tracepoint.h' line='230' column='1' elf-symbol-id='__tracepoints__disable_destructors'/>
    <!-- lttng_ust_tracepoint_dlopen tracepoint_dlopen -->
    <var-decl name='tracepoint_dlopen' type-id='type-id-236' visibility='default' filepath='../include/lttng/tracepoint.h' line='226' column='1'/>
    <!-- lttng_ust_tracepoint_dlopen* tracepoint_dlopen_ptr -->
    <var-decl name='tracepoint_dlopen_ptr' type-id='type-id-262' visibility='default' filepath='../include/lttng/tracepoint.h' line='227' column='1'/>
    <!-- void lttng_ust_abi_exit() -->
    <function-decl name='lttng_ust_abi_exit' mangled-name='lttng_ust_abi_exit' filepath='liblttng-ust/lttng-ust-abi.c' line='993' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_abi_exit'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_abi_map_channel(int, lttng_ust_channel*, ust_args*, void*) -->
    <function-decl name='lttng_abi_map_channel' mangled-name='lttng_abi_map_channel' filepath='liblttng-ust/lttng-ust-abi.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_abi_map_channel'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='session_objd' filepath='liblttng-ust/lttng-ust-abi.c' line='395' column='1'/>
      <!-- parameter of type 'lttng_ust_channel*' -->
      <parameter type-id='type-id-258' name='ust_chan' filepath='liblttng-ust/lttng-ust-abi.c' line='396' column='1'/>
      <!-- parameter of type 'ust_args*' -->
      <parameter type-id='type-id-263' name='uargs' filepath='liblttng-ust/lttng-ust-abi.c' line='397' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='owner' filepath='liblttng-ust/lttng-ust-abi.c' line='398' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_abi_create_root_handle() -->
    <function-decl name='lttng_abi_create_root_handle' mangled-name='lttng_abi_create_root_handle' filepath='liblttng-ust/lttng-ust-abi.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_abi_create_root_handle'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_ust_objd_table_owner_cleanup(void*) -->
    <function-decl name='lttng_ust_objd_table_owner_cleanup' mangled-name='lttng_ust_objd_table_owner_cleanup' filepath='liblttng-ust/lttng-ust-abi.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_objd_table_owner_cleanup'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='owner' filepath='liblttng-ust/lttng-ust-abi.c' line='252' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- const char* lttng_ust_obj_get_name(int) -->
    <function-decl name='lttng_ust_obj_get_name' mangled-name='lttng_ust_obj_get_name' filepath='liblttng-ust/lttng-ust-abi.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_obj_get_name'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='id' filepath='liblttng-ust/lttng-ust-abi.c' line='243' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-34'/>
    </function-decl>
    <!-- int lttng_ust_objd_unref(int, int) -->
    <function-decl name='lttng_ust_objd_unref' mangled-name='lttng_ust_objd_unref' filepath='liblttng-ust/lttng-ust-abi.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_objd_unref'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='id' filepath='liblttng-ust/lttng-ust-abi.c' line='194' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='is_owner' filepath='liblttng-ust/lttng-ust-abi.c' line='194' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- const lttng_ust_objd_ops* objd_ops(int) -->
    <function-decl name='objd_ops' mangled-name='objd_ops' filepath='liblttng-ust/lttng-ust-abi.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='objd_ops'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='id' filepath='liblttng-ust/lttng-ust-abi.c' line='165' column='1'/>
      <!-- const lttng_ust_objd_ops* -->
      <return type-id='type-id-254'/>
    </function-decl>
    <!-- int (lttng_ust_tracepoint* const*) -->
    <function-type size-in-bits='64' id='type-id-255'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-261'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (lttng_ust_tracepoint* const*, int) -->
    <function-type size-in-bits='64' id='type-id-256'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-261'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- long int (int, unsigned int, unsigned long int, ust_args*, void*) -->
    <function-type size-in-bits='64' id='type-id-257'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-13'/>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'ust_args*' -->
      <parameter type-id='type-id-263'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- long int -->
      <return type-id='type-id-6'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-264'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void* (void*) -->
    <function-type size-in-bits='64' id='type-id-265'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- void* -->
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-probes.c' comp-dir-path='liblttng-ust' language='LANG_C99'>

    <!-- char[12] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='96' id='type-id-266'>
      <!-- <anonymous range>[12] -->
      <subrange length='12' type-id='type-id-3' id='type-id-267'/>

    </array-type-def>
    <!-- struct lttng_event_ctx -->
    <class-decl name='lttng_event_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-268'/>
    <!-- struct lttng_ust_field_list -->
    <class-decl name='lttng_ust_field_list' size-in-bits='192' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='383' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- tp_field_list_entry* lttng_ust_field_list::iter -->
        <var-decl name='iter' type-id='type-id-270' visibility='default' filepath='../include/lttng/ust-events.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head lttng_ust_field_list::head -->
        <var-decl name='head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct tp_field_list_entry -->
    <class-decl name='tp_field_list_entry' size-in-bits='6592' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='378' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_field_iter tp_field_list_entry::field -->
        <var-decl name='field' type-id='type-id-247' visibility='default' filepath='../include/lttng/ust-events.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <!-- cds_list_head tp_field_list_entry::head -->
        <var-decl name='head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='380' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_list -->
    <class-decl name='lttng_ust_tracepoint_list' size-in-bits='192' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='373' column='1' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- tp_list_entry* lttng_ust_tracepoint_list::iter -->
        <var-decl name='iter' type-id='type-id-273' visibility='default' filepath='../include/lttng/ust-events.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head lttng_ust_tracepoint_list::head -->
        <var-decl name='head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='375' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct tp_list_entry -->
    <class-decl name='tp_list_entry' size-in-bits='2368' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='368' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_tracepoint_iter tp_list_entry::tp -->
        <var-decl name='tp' type-id='type-id-160' visibility='default' filepath='../include/lttng/ust-events.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <!-- cds_list_head tp_list_entry::head -->
        <var-decl name='head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='370' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_probe_desc -->
    <class-decl name='lttng_probe_desc' size-in-bits='640' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='330' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_probe_desc::provider -->
        <var-decl name='provider' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const lttng_event_desc** lttng_probe_desc::event_desc -->
        <var-decl name='event_desc' type-id='type-id-276' visibility='default' filepath='../include/lttng/ust-events.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int lttng_probe_desc::nr_events -->
        <var-decl name='nr_events' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_probe_desc::head -->
        <var-decl name='head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- cds_list_head lttng_probe_desc::lazy_init_head -->
        <var-decl name='lazy_init_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int lttng_probe_desc::lazy -->
        <var-decl name='lazy' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- uint32_t lttng_probe_desc::major -->
        <var-decl name='major' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-events.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- uint32_t lttng_probe_desc::minor -->
        <var-decl name='minor' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-events.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- char lttng_probe_desc::padding[12] -->
        <var-decl name='padding' type-id='type-id-266' visibility='default' filepath='../include/lttng/ust-events.h' line='339' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_event_desc -->
    <class-decl name='lttng_event_desc' size-in-bits='768' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='313' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_event_desc::name -->
        <var-decl name='name' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void ()* lttng_event_desc::probe_callback -->
        <var-decl name='probe_callback' type-id='type-id-239' visibility='default' filepath='../include/lttng/ust-events.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const lttng_event_ctx* lttng_event_desc::ctx -->
        <var-decl name='ctx' type-id='type-id-278' visibility='default' filepath='../include/lttng/ust-events.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- const lttng_event_field* lttng_event_desc::fields -->
        <var-decl name='fields' type-id='type-id-184' visibility='default' filepath='../include/lttng/ust-events.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned int lttng_event_desc::nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- const int** lttng_event_desc::loglevel -->
        <var-decl name='loglevel' type-id='type-id-279' visibility='default' filepath='../include/lttng/ust-events.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- const char* lttng_event_desc::signature -->
        <var-decl name='signature' type-id='type-id-34' visibility='default' filepath='../include/lttng/ust-events.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- union {struct {const char** model_emf_uri;} ext; char padding[40];} lttng_event_desc::u -->
        <var-decl name='u' type-id='type-id-280' visibility='default' filepath='../include/lttng/ust-events.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {const char** model_emf_uri;} ext; char padding[40];} -->
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='321' column='1' id='type-id-280'>
      <data-member access='private'>
        <!-- struct {const char** model_emf_uri;} ext -->
        <var-decl name='ext' type-id='type-id-281' visibility='default' filepath='../include/lttng/ust-events.h' line='324' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[40] -->
        <var-decl name='padding' type-id='type-id-74' visibility='default' filepath='../include/lttng/ust-events.h' line='325' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {const char** model_emf_uri;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='322' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char** model_emf_uri -->
        <var-decl name='model_emf_uri' type-id='type-id-282' visibility='default' filepath='../include/lttng/ust-events.h' line='323' column='1'/>
      </data-member>
    </class-decl>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-282'/>
    <!-- const int** -->
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-279'/>
    <!-- const lttng_event_ctx -->
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-283'/>
    <!-- const lttng_event_ctx* -->
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-278'/>
    <!-- const lttng_event_desc -->
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-284'/>
    <!-- const lttng_event_desc* -->
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <!-- const lttng_event_desc** -->
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-276'/>
    <!-- lttng_probe_desc* -->
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-286'/>
    <!-- lttng_ust_field_iter* -->
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-287'/>
    <!-- lttng_ust_field_list* -->
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-288'/>
    <!-- lttng_ust_tracepoint_iter* -->
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-289'/>
    <!-- lttng_ust_tracepoint_list* -->
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-290'/>
    <!-- tp_field_list_entry* -->
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-270'/>
    <!-- tp_list_entry* -->
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-273'/>
    <!-- lttng_ust_field_iter* lttng_ust_field_list_get_iter_next(lttng_ust_field_list*) -->
    <function-decl name='lttng_ust_field_list_get_iter_next' mangled-name='lttng_ust_field_list_get_iter_next' filepath='liblttng-ust/lttng-probes.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_field_list_get_iter_next'>
      <!-- parameter of type 'lttng_ust_field_list*' -->
      <parameter type-id='type-id-288' name='list' filepath='liblttng-ust/lttng-probes.c' line='455' column='1'/>
      <!-- lttng_ust_field_iter* -->
      <return type-id='type-id-287'/>
    </function-decl>
    <!-- int lttng_probes_get_field_list(lttng_ust_field_list*) -->
    <function-decl name='lttng_probes_get_field_list' mangled-name='lttng_probes_get_field_list' filepath='liblttng-ust/lttng-probes.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_probes_get_field_list'>
      <!-- parameter of type 'lttng_ust_field_list*' -->
      <parameter type-id='type-id-288' name='list' filepath='liblttng-ust/lttng-probes.c' line='345' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_probes_prune_field_list(lttng_ust_field_list*) -->
    <function-decl name='lttng_probes_prune_field_list' mangled-name='lttng_probes_prune_field_list' filepath='liblttng-ust/lttng-probes.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_probes_prune_field_list'>
      <!-- parameter of type 'lttng_ust_field_list*' -->
      <parameter type-id='type-id-288' name='list' filepath='liblttng-ust/lttng-probes.c' line='332' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- lttng_ust_tracepoint_iter* lttng_ust_tracepoint_list_get_iter_next(lttng_ust_tracepoint_list*) -->
    <function-decl name='lttng_ust_tracepoint_list_get_iter_next' mangled-name='lttng_ust_tracepoint_list_get_iter_next' filepath='liblttng-ust/lttng-probes.c' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_tracepoint_list_get_iter_next'>
      <!-- parameter of type 'lttng_ust_tracepoint_list*' -->
      <parameter type-id='type-id-290' name='list' filepath='liblttng-ust/lttng-probes.c' line='317' column='1'/>
      <!-- lttng_ust_tracepoint_iter* -->
      <return type-id='type-id-289'/>
    </function-decl>
    <!-- int lttng_probes_get_event_list(lttng_ust_tracepoint_list*) -->
    <function-decl name='lttng_probes_get_event_list' mangled-name='lttng_probes_get_event_list' filepath='liblttng-ust/lttng-probes.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_probes_get_event_list'>
      <!-- parameter of type 'lttng_ust_tracepoint_list*' -->
      <parameter type-id='type-id-290' name='list' filepath='liblttng-ust/lttng-probes.c' line='273' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_probes_prune_event_list(lttng_ust_tracepoint_list*) -->
    <function-decl name='lttng_probes_prune_event_list' mangled-name='lttng_probes_prune_event_list' filepath='liblttng-ust/lttng-probes.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_probes_prune_event_list'>
      <!-- parameter of type 'lttng_ust_tracepoint_list*' -->
      <parameter type-id='type-id-290' name='list' filepath='liblttng-ust/lttng-probes.c' line='260' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void ltt_probe_unregister(lttng_probe_desc*) -->
    <function-decl name='ltt_probe_unregister' mangled-name='ltt_probe_unregister' filepath='liblttng-ust/lttng-probes.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ltt_probe_unregister'>
      <!-- parameter of type 'lttng_probe_desc*' -->
      <parameter type-id='type-id-286' name='desc' filepath='liblttng-ust/lttng-probes.c' line='255' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_probe_unregister(lttng_probe_desc*) -->
    <function-decl name='lttng_probe_unregister' mangled-name='lttng_probe_unregister' filepath='liblttng-ust/lttng-probes.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_probe_unregister'>
      <!-- parameter of type 'lttng_probe_desc*' -->
      <parameter type-id='type-id-286' name='desc' filepath='liblttng-ust/lttng-probes.c' line='238' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int ltt_probe_register(lttng_probe_desc*) -->
    <function-decl name='ltt_probe_register' mangled-name='ltt_probe_register' filepath='liblttng-ust/lttng-probes.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ltt_probe_register'>
      <!-- parameter of type 'lttng_probe_desc*' -->
      <parameter type-id='type-id-286' name='desc' filepath='liblttng-ust/lttng-probes.c' line='233' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_probe_register(lttng_probe_desc*) -->
    <function-decl name='lttng_probe_register' mangled-name='lttng_probe_register' filepath='liblttng-ust/lttng-probes.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_probe_register'>
      <!-- parameter of type 'lttng_probe_desc*' -->
      <parameter type-id='type-id-286' name='desc' filepath='liblttng-ust/lttng-probes.c' line='194' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- cds_list_head* lttng_get_probe_list_head() -->
    <function-decl name='lttng_get_probe_list_head' mangled-name='lttng_get_probe_list_head' filepath='liblttng-ust/lttng-probes.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_get_probe_list_head'>
      <!-- cds_list_head* -->
      <return type-id='type-id-91'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-provider.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- struct lttng_ust_lib_ring_buffer -->
    <class-decl name='lttng_ust_lib_ring_buffer' size-in-bits='5120' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-291'/>
    <!-- struct lttng_ust_lib_ring_buffer_backend_pages -->
    <class-decl name='lttng_ust_lib_ring_buffer_backend_pages' size-in-bits='512' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-292'/>
    <!-- struct lttng_ust_context_provider -->
    <class-decl name='lttng_ust_context_provider' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-context-provider.h' line='29' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char* lttng_ust_context_provider::name -->
        <var-decl name='name' type-id='type-id-32' visibility='default' filepath='../include/lttng/ust-context-provider.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- typedef size_t (lttng_ctx_field*, typedef size_t)* lttng_ust_context_provider::get_size -->
        <var-decl name='get_size' type-id='type-id-98' visibility='default' filepath='../include/lttng/ust-context-provider.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)* lttng_ust_context_provider::record -->
        <var-decl name='record' type-id='type-id-99' visibility='default' filepath='../include/lttng/ust-context-provider.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (lttng_ctx_field*, lttng_ctx_value*)* lttng_ust_context_provider::get_value -->
        <var-decl name='get_value' type-id='type-id-100' visibility='default' filepath='../include/lttng/ust-context-provider.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- cds_hlist_node lttng_ust_context_provider::node -->
        <var-decl name='node' type-id='type-id-93' visibility='default' filepath='../include/lttng/ust-context-provider.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_lib_ring_buffer_ctx -->
    <class-decl name='lttng_ust_lib_ring_buffer_ctx' size-in-bits='960' is-struct='yes' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='232' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- channel* lttng_ust_lib_ring_buffer_ctx::chan -->
        <var-decl name='chan' type-id='type-id-128' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::priv -->
        <var-decl name='priv' type-id='type-id-19' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_shm_handle* lttng_ust_lib_ring_buffer_ctx::handle -->
        <var-decl name='handle' type-id='type-id-131' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- size_t lttng_ust_lib_ring_buffer_ctx::data_size -->
        <var-decl name='data_size' type-id='type-id-42' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_ust_lib_ring_buffer_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-5' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int lttng_ust_lib_ring_buffer_ctx::cpu -->
        <var-decl name='cpu' type-id='type-id-5' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_lib_ring_buffer* lttng_ust_lib_ring_buffer_ctx::buf -->
        <var-decl name='buf' type-id='type-id-295' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- size_t lttng_ust_lib_ring_buffer_ctx::slot_size -->
        <var-decl name='slot_size' type-id='type-id-42' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_ctx::buf_offset -->
        <var-decl name='buf_offset' type-id='type-id-3' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_ctx::pre_offset -->
        <var-decl name='pre_offset' type-id='type-id-3' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint64_t lttng_ust_lib_ring_buffer_ctx::tsc -->
        <var-decl name='tsc' type-id='type-id-151' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_ctx::rflags -->
        <var-decl name='rflags' type-id='type-id-13' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_ctx::ctx_len -->
        <var-decl name='ctx_len' type-id='type-id-13' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::ip -->
        <var-decl name='ip' type-id='type-id-19' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::priv2 -->
        <var-decl name='priv2' type-id='type-id-19' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- char lttng_ust_lib_ring_buffer_ctx::padding2[4] -->
        <var-decl name='padding2' type-id='type-id-2' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- lttng_ust_lib_ring_buffer_backend_pages* lttng_ust_lib_ring_buffer_ctx::backend_pages -->
        <var-decl name='backend_pages' type-id='type-id-296' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <!-- lttng_ctx** -->
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-297'/>
    <!-- lttng_ust_context_provider* -->
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-298'/>
    <!-- lttng_ust_lib_ring_buffer* -->
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-295'/>
    <!-- lttng_ust_lib_ring_buffer_backend_pages* -->
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-296'/>
    <!-- lttng_ust_lib_ring_buffer_ctx* -->
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-299'/>
    <!-- int lttng_ust_add_app_context_to_ctx_rcu(const char*, lttng_ctx**) -->
    <function-decl name='lttng_ust_add_app_context_to_ctx_rcu' mangled-name='lttng_ust_add_app_context_to_ctx_rcu' filepath='liblttng-ust/lttng-context-provider.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_add_app_context_to_ctx_rcu'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='name' filepath='liblttng-ust/lttng-context-provider.c' line='120' column='1'/>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-provider.c' line='121' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_ust_context_provider_unregister(lttng_ust_context_provider*) -->
    <function-decl name='lttng_ust_context_provider_unregister' mangled-name='lttng_ust_context_provider_unregister' filepath='liblttng-ust/lttng-context-provider.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_context_provider_unregister'>
      <!-- parameter of type 'lttng_ust_context_provider*' -->
      <parameter type-id='type-id-298' name='provider' filepath='liblttng-ust/lttng-context-provider.c' line='98' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_ust_context_provider_register(lttng_ust_context_provider*) -->
    <function-decl name='lttng_ust_context_provider_register' mangled-name='lttng_ust_context_provider_register' filepath='liblttng-ust/lttng-context-provider.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_context_provider_register'>
      <!-- parameter of type 'lttng_ust_context_provider*' -->
      <parameter type-id='type-id-298' name='provider' filepath='liblttng-ust/lttng-context-provider.c' line='64' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-vtid.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- void lttng_fixup_vtid_tls() -->
    <function-decl name='lttng_fixup_vtid_tls' mangled-name='lttng_fixup_vtid_tls' filepath='liblttng-ust/lttng-context-vtid.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_fixup_vtid_tls'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_add_vtid_to_ctx(lttng_ctx**) -->
    <function-decl name='lttng_add_vtid_to_ctx' mangled-name='lttng_add_vtid_to_ctx' filepath='liblttng-ust/lttng-context-vtid.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_add_vtid_to_ctx'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-vtid.c' line='80' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_context_vtid_reset() -->
    <function-decl name='lttng_context_vtid_reset' mangled-name='lttng_context_vtid_reset' filepath='liblttng-ust/lttng-context-vtid.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_vtid_reset'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-vpid.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- int lttng_add_vpid_to_ctx(lttng_ctx**) -->
    <function-decl name='lttng_add_vpid_to_ctx' mangled-name='lttng_add_vpid_to_ctx' filepath='liblttng-ust/lttng-context-vpid.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_add_vpid_to_ctx'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-vpid.c' line='85' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_context_vpid_reset() -->
    <function-decl name='lttng_context_vpid_reset' mangled-name='lttng_context_vpid_reset' filepath='liblttng-ust/lttng-context-vpid.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_vpid_reset'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-pthread-id.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- int lttng_add_pthread_id_to_ctx(lttng_ctx**) -->
    <function-decl name='lttng_add_pthread_id_to_ctx' mangled-name='lttng_add_pthread_id_to_ctx' filepath='liblttng-ust/lttng-context-pthread-id.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_add_pthread_id_to_ctx'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-pthread-id.c' line='61' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-procname.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- void lttng_fixup_procname_tls() -->
    <function-decl name='lttng_fixup_procname_tls' mangled-name='lttng_fixup_procname_tls' filepath='liblttng-ust/lttng-context-procname.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_fixup_procname_tls'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_add_procname_to_ctx(lttng_ctx**) -->
    <function-decl name='lttng_add_procname_to_ctx' mangled-name='lttng_add_procname_to_ctx' filepath='liblttng-ust/lttng-context-procname.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_add_procname_to_ctx'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-procname.c' line='88' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_context_procname_reset() -->
    <function-decl name='lttng_context_procname_reset' mangled-name='lttng_context_procname_reset' filepath='liblttng-ust/lttng-context-procname.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_procname_reset'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-ip.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- int lttng_add_ip_to_ctx(lttng_ctx**) -->
    <function-decl name='lttng_add_ip_to_ctx' mangled-name='lttng_add_ip_to_ctx' filepath='liblttng-ust/lttng-context-ip.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_add_ip_to_ctx'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-ip.c' line='52' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context-cpu-id.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- int lttng_add_cpu_id_to_ctx(lttng_ctx**) -->
    <function-decl name='lttng_add_cpu_id_to_ctx' mangled-name='lttng_add_cpu_id_to_ctx' filepath='liblttng-ust/lttng-context-cpu-id.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_add_cpu_id_to_ctx'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context-cpu-id.c' line='70' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-context.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- lttng_ctx* lttng_static_ctx -->
    <var-decl name='lttng_static_ctx' type-id='type-id-90' mangled-name='lttng_static_ctx' visibility='default' filepath='../include/lttng/ust-events.h' line='740' column='1' elf-symbol-id='lttng_static_ctx'/>
    <!-- void lttng_context_exit() -->
    <function-decl name='lttng_context_exit' mangled-name='lttng_context_exit' filepath='liblttng-ust/lttng-context.c' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_exit'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_context_init() -->
    <function-decl name='lttng_context_init' mangled-name='lttng_context_init' filepath='liblttng-ust/lttng-context.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_init'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_session_context_init(lttng_ctx**) -->
    <function-decl name='lttng_session_context_init' mangled-name='lttng_session_context_init' filepath='liblttng-ust/lttng-context.c' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_context_init'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-context.c' line='346' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_ust_context_set_provider_rcu(lttng_ctx**, const char*, typedef size_t (lttng_ctx_field*, typedef size_t)*, void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)*, void (lttng_ctx_field*, lttng_ctx_value*)*) -->
    <function-decl name='lttng_ust_context_set_provider_rcu' mangled-name='lttng_ust_context_set_provider_rcu' filepath='liblttng-ust/lttng-context.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_context_set_provider_rcu'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='_ctx' filepath='liblttng-ust/lttng-context.c' line='297' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='name' filepath='liblttng-ust/lttng-context.c' line='298' column='1'/>
      <!-- parameter of type 'typedef size_t (lttng_ctx_field*, typedef size_t)*' -->
      <parameter type-id='type-id-98' name='get_size' filepath='liblttng-ust/lttng-context.c' line='299' column='1'/>
      <!-- parameter of type 'void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)*' -->
      <parameter type-id='type-id-99' name='record' filepath='liblttng-ust/lttng-context.c' line='300' column='1'/>
      <!-- parameter of type 'void (lttng_ctx_field*, lttng_ctx_value*)*' -->
      <parameter type-id='type-id-100' name='get_value' filepath='liblttng-ust/lttng-context.c' line='303' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_destroy_context(lttng_ctx*) -->
    <function-decl name='lttng_destroy_context' mangled-name='lttng_destroy_context' filepath='liblttng-ust/lttng-context.c' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_destroy_context'>
      <!-- parameter of type 'lttng_ctx*' -->
      <parameter type-id='type-id-90' name='ctx' filepath='liblttng-ust/lttng-context.c' line='270' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_remove_context_field(lttng_ctx**, lttng_ctx_field*) -->
    <function-decl name='lttng_remove_context_field' mangled-name='lttng_remove_context_field' filepath='liblttng-ust/lttng-context.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_remove_context_field'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx_p' filepath='liblttng-ust/lttng-context.c' line='258' column='1'/>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-95' name='field' filepath='liblttng-ust/lttng-context.c' line='259' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_context_update(lttng_ctx*) -->
    <function-decl name='lttng_context_update' mangled-name='lttng_context_update' filepath='liblttng-ust/lttng-context.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_update'>
      <!-- parameter of type 'lttng_ctx*' -->
      <parameter type-id='type-id-90' name='ctx' filepath='liblttng-ust/lttng-context.c' line='170' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_context_add_rcu(lttng_ctx**, const lttng_ctx_field*) -->
    <function-decl name='lttng_context_add_rcu' mangled-name='lttng_context_add_rcu' filepath='liblttng-ust/lttng-context.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_context_add_rcu'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx_p' filepath='liblttng-ust/lttng-context.c' line='127' column='1'/>
      <!-- parameter of type 'const lttng_ctx_field*' -->
      <parameter type-id='type-id-180' name='f' filepath='liblttng-ust/lttng-context.c' line='128' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- lttng_ctx_field* lttng_append_context(lttng_ctx**) -->
    <function-decl name='lttng_append_context' mangled-name='lttng_append_context' filepath='liblttng-ust/lttng-context.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_append_context'>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx_p' filepath='liblttng-ust/lttng-context.c' line='98' column='1'/>
      <!-- lttng_ctx_field* -->
      <return type-id='type-id-95'/>
    </function-decl>
    <!-- int lttng_get_context_index(lttng_ctx*, const char*) -->
    <function-decl name='lttng_get_context_index' mangled-name='lttng_get_context_index' filepath='liblttng-ust/lttng-context.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_get_context_index'>
      <!-- parameter of type 'lttng_ctx*' -->
      <parameter type-id='type-id-90' name='ctx' filepath='liblttng-ust/lttng-context.c' line='58' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='name' filepath='liblttng-ust/lttng-context.c' line='58' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_find_context(lttng_ctx*, const char*) -->
    <function-decl name='lttng_find_context' mangled-name='lttng_find_context' filepath='liblttng-ust/lttng-context.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_find_context'>
      <!-- parameter of type 'lttng_ctx*' -->
      <parameter type-id='type-id-90' name='ctx' filepath='liblttng-ust/lttng-context.c' line='38' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='name' filepath='liblttng-ust/lttng-context.c' line='38' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-events.c' comp-dir-path='liblttng-ust' language='LANG_C99'>

    <!-- char[256][] -->
    <array-type-def dimensions='2' type-id='type-id-1' size-in-bits='infinite' id='type-id-300'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='type-id-3' id='type-id-67'/>

      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-77'/>

    </array-type-def>
    <!-- int[2] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='64' id='type-id-301'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-302'/>

    </array-type-def>
    <!-- shm_object[] -->
    <array-type-def dimensions='1' type-id='type-id-303' size-in-bits='infinite' id='type-id-304'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-77'/>

    </array-type-def>
    <!-- struct lttng_ust_lib_ring_buffer_ctx -->
    <class-decl name='lttng_ust_lib_ring_buffer_ctx' size-in-bits='960' is-struct='yes' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='232' column='1' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- channel* lttng_ust_lib_ring_buffer_ctx::chan -->
        <var-decl name='chan' type-id='type-id-128' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::priv -->
        <var-decl name='priv' type-id='type-id-19' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_shm_handle* lttng_ust_lib_ring_buffer_ctx::handle -->
        <var-decl name='handle' type-id='type-id-306' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- size_t lttng_ust_lib_ring_buffer_ctx::data_size -->
        <var-decl name='data_size' type-id='type-id-42' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_ust_lib_ring_buffer_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-5' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int lttng_ust_lib_ring_buffer_ctx::cpu -->
        <var-decl name='cpu' type-id='type-id-5' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_lib_ring_buffer* lttng_ust_lib_ring_buffer_ctx::buf -->
        <var-decl name='buf' type-id='type-id-295' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- size_t lttng_ust_lib_ring_buffer_ctx::slot_size -->
        <var-decl name='slot_size' type-id='type-id-42' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_ctx::buf_offset -->
        <var-decl name='buf_offset' type-id='type-id-3' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_ctx::pre_offset -->
        <var-decl name='pre_offset' type-id='type-id-3' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint64_t lttng_ust_lib_ring_buffer_ctx::tsc -->
        <var-decl name='tsc' type-id='type-id-151' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_ctx::rflags -->
        <var-decl name='rflags' type-id='type-id-13' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_ctx::ctx_len -->
        <var-decl name='ctx_len' type-id='type-id-13' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::ip -->
        <var-decl name='ip' type-id='type-id-19' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::priv2 -->
        <var-decl name='priv2' type-id='type-id-19' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- char lttng_ust_lib_ring_buffer_ctx::padding2[4] -->
        <var-decl name='padding2' type-id='type-id-2' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- lttng_ust_lib_ring_buffer_backend_pages* lttng_ust_lib_ring_buffer_ctx::backend_pages -->
        <var-decl name='backend_pages' type-id='type-id-296' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_shm_handle -->
    <class-decl name='lttng_ust_shm_handle' size-in-bits='192' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='52' column='1' id='type-id-307'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- shm_object_table* lttng_ust_shm_handle::table -->
        <var-decl name='table' type-id='type-id-308' visibility='default' filepath='../libringbuffer/shm_types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {shm_ref _ref; channel* _type;} lttng_ust_shm_handle::chan -->
        <var-decl name='chan' type-id='type-id-309' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct shm_object_table -->
    <class-decl name='shm_object_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='46' column='1' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- size_t shm_object_table::size -->
        <var-decl name='size' type-id='type-id-42' visibility='default' filepath='../libringbuffer/shm_types.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t shm_object_table::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-42' visibility='default' filepath='../libringbuffer/shm_types.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- shm_object shm_object_table::objects[] -->
        <var-decl name='objects' type-id='type-id-304' visibility='default' filepath='../libringbuffer/shm_types.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct shm_object -->
    <class-decl name='shm_object' size-in-bits='512' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='35' column='1' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- shm_object_type shm_object::type -->
        <var-decl name='type' type-id='type-id-311' visibility='default' filepath='../libringbuffer/shm_types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t shm_object::index -->
        <var-decl name='index' type-id='type-id-42' visibility='default' filepath='../libringbuffer/shm_types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int shm_object::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-5' visibility='default' filepath='../libringbuffer/shm_types.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int shm_object::wait_fd[2] -->
        <var-decl name='wait_fd' type-id='type-id-301' visibility='default' filepath='../libringbuffer/shm_types.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- char* shm_object::memory_map -->
        <var-decl name='memory_map' type-id='type-id-32' visibility='default' filepath='../libringbuffer/shm_types.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- size_t shm_object::memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-42' visibility='default' filepath='../libringbuffer/shm_types.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint64_t shm_object::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-151' visibility='default' filepath='../libringbuffer/shm_types.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int shm_object::shm_fd_ownership -->
        <var-decl name='shm_fd_ownership' type-id='type-id-5' visibility='default' filepath='../libringbuffer/shm_types.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum shm_object_type -->
    <enum-decl name='shm_object_type' filepath='../libringbuffer/shm_types.h' line='30' column='1' id='type-id-311'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='SHM_OBJECT_SHM' value='0'/>
      <enumerator name='SHM_OBJECT_MEM' value='1'/>
    </enum-decl>
    <!-- union {shm_ref _ref; channel* _type;} -->
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1' id='type-id-309'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-312' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- channel* _type -->
        <var-decl name='_type' type-id='type-id-128' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct shm_ref -->
    <class-decl name='shm_ref' size-in-bits='128' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_internal.h' line='24' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- volatile ssize_t shm_ref::index -->
        <var-decl name='index' type-id='type-id-313' visibility='default' filepath='../libringbuffer/shm_internal.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- volatile ssize_t shm_ref::offset -->
        <var-decl name='offset' type-id='type-id-313' visibility='default' filepath='../libringbuffer/shm_internal.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_channel -->
    <class-decl name='lttng_channel' size-in-bits='960' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='525' column='1' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- channel* lttng_channel::chan -->
        <var-decl name='chan' type-id='type-id-128' visibility='default' filepath='../include/lttng/ust-events.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_channel::enabled -->
        <var-decl name='enabled' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ctx* lttng_channel::ctx -->
        <var-decl name='ctx' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-events.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_session* lttng_channel::session -->
        <var-decl name='session' type-id='type-id-129' visibility='default' filepath='../include/lttng/ust-events.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_channel::objd -->
        <var-decl name='objd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- unsigned int lttng_channel::_deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned int lttng_channel::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- cds_list_head lttng_channel::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- const lttng_channel_ops* lttng_channel::ops -->
        <var-decl name='ops' type-id='type-id-130' visibility='default' filepath='../include/lttng/ust-events.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int lttng_channel::header_type -->
        <var-decl name='header_type' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- lttng_ust_shm_handle* lttng_channel::handle -->
        <var-decl name='handle' type-id='type-id-306' visibility='default' filepath='../include/lttng/ust-events.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_channel::_deprecated3 -->
        <var-decl name='_deprecated3' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- unsigned int lttng_channel::id -->
        <var-decl name='id' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- lttng_ust_chan_type lttng_channel::type -->
        <var-decl name='type' type-id='type-id-132' visibility='default' filepath='../include/lttng/ust-events.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <!-- unsigned char lttng_channel::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-84' visibility='default' filepath='../include/lttng/ust-events.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_channel::tstate -->
        <var-decl name='tstate' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='550' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enabler -->
    <class-decl name='lttng_enabler' size-in-bits='5248' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='353' column='1' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_enabler_type lttng_enabler::type -->
        <var-decl name='type' type-id='type-id-316' visibility='default' filepath='../include/lttng/ust-events.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head lttng_enabler::filter_bytecode_head -->
        <var-decl name='filter_bytecode_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_enabler::excluder_head -->
        <var-decl name='excluder_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- cds_list_head lttng_enabler::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- lttng_ust_event lttng_enabler::event_param -->
        <var-decl name='event_param' type-id='type-id-157' visibility='default' filepath='../include/lttng/ust-events.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <!-- lttng_channel* lttng_enabler::chan -->
        <var-decl name='chan' type-id='type-id-317' visibility='default' filepath='../include/lttng/ust-events.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <!-- lttng_ctx* lttng_enabler::ctx -->
        <var-decl name='ctx' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-events.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_enabler::enabled -->
        <var-decl name='enabled' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='365' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_enabler_type -->
    <enum-decl name='lttng_enabler_type' filepath='../include/lttng/ust-events.h' line='344' column='1' id='type-id-316'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='LTTNG_ENABLER_WILDCARD' value='0'/>
      <enumerator name='LTTNG_ENABLER_EVENT' value='1'/>
    </enum-decl>
    <!-- struct lttng_ust_excluder_node -->
    <class-decl name='lttng_ust_excluder_node' size-in-bits='512' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='401' column='1' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head lttng_ust_excluder_node::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_enabler* lttng_ust_excluder_node::enabler -->
        <var-decl name='enabler' type-id='type-id-319' visibility='default' filepath='../include/lttng/ust-events.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_event_exclusion lttng_ust_excluder_node::excluder -->
        <var-decl name='excluder' type-id='type-id-320' visibility='default' filepath='../include/lttng/ust-events.h' line='408' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_exclusion -->
    <class-decl name='lttng_ust_event_exclusion' size-in-bits='288' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='247' column='1' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_event_exclusion::count -->
        <var-decl name='count' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_event_exclusion::padding[32] -->
        <var-decl name='padding' type-id='type-id-72' visibility='default' filepath='../include/lttng/ust-abi.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- char lttng_ust_event_exclusion::names[256][] -->
        <var-decl name='names' type-id='type-id-300' visibility='default' filepath='../include/lttng/ust-abi.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_filter_bytecode_node -->
    <class-decl name='lttng_ust_filter_bytecode_node' size-in-bits='576' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='391' column='1' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head lttng_ust_filter_bytecode_node::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_enabler* lttng_ust_filter_bytecode_node::enabler -->
        <var-decl name='enabler' type-id='type-id-319' visibility='default' filepath='../include/lttng/ust-events.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_filter_bytecode lttng_ust_filter_bytecode_node::bc -->
        <var-decl name='bc' type-id='type-id-322' visibility='default' filepath='../include/lttng/ust-events.h' line='398' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_filter_bytecode -->
    <class-decl name='lttng_ust_filter_bytecode' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='238' column='1' id='type-id-322'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_filter_bytecode::len -->
        <var-decl name='len' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_filter_bytecode::reloc_offset -->
        <var-decl name='reloc_offset' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-abi.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_filter_bytecode::seqnum -->
        <var-decl name='seqnum' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-abi.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_ust_filter_bytecode::padding[32] -->
        <var-decl name='padding' type-id='type-id-72' visibility='default' filepath='../include/lttng/ust-abi.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_filter_bytecode::data[] -->
        <var-decl name='data' type-id='type-id-76' visibility='default' filepath='../include/lttng/ust-abi.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <!-- lttng_channel* -->
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-317'/>
    <!-- lttng_enabler* -->
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-319'/>
    <!-- lttng_ust_context* -->
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-323'/>
    <!-- lttng_ust_event* -->
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-324'/>
    <!-- lttng_ust_excluder_node* -->
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-325'/>
    <!-- lttng_ust_filter_bytecode_node* -->
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-326'/>
    <!-- lttng_ust_lib_ring_buffer_ctx* -->
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-327'/>
    <!-- lttng_ust_shm_handle* -->
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-306'/>
    <!-- shm_object_table* -->
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-308'/>
    <!-- volatile ssize_t -->
    <qualified-type-def type-id='type-id-54' volatile='yes' id='type-id-313'/>
    <!-- void lttng_ust_context_set_session_provider(const char*, typedef size_t (lttng_ctx_field*, typedef size_t)*, void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)*, void (lttng_ctx_field*, lttng_ctx_value*)*) -->
    <function-decl name='lttng_ust_context_set_session_provider' mangled-name='lttng_ust_context_set_session_provider' filepath='liblttng-ust/lttng-events.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_context_set_session_provider'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='name' filepath='liblttng-ust/lttng-events.c' line='1155' column='1'/>
      <!-- parameter of type 'typedef size_t (lttng_ctx_field*, typedef size_t)*' -->
      <parameter type-id='type-id-98' name='get_size' filepath='liblttng-ust/lttng-events.c' line='1156' column='1'/>
      <!-- parameter of type 'void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)*' -->
      <parameter type-id='type-id-99' name='record' filepath='liblttng-ust/lttng-events.c' line='1157' column='1'/>
      <!-- parameter of type 'void (lttng_ctx_field*, lttng_ctx_value*)*' -->
      <parameter type-id='type-id-100' name='get_value' filepath='liblttng-ust/lttng-events.c' line='1160' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_enabler_attach_context(lttng_enabler*, lttng_ust_context*) -->
    <function-decl name='lttng_enabler_attach_context' mangled-name='lttng_enabler_attach_context' filepath='liblttng-ust/lttng-events.c' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_attach_context'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-319' name='enabler' filepath='liblttng-ust/lttng-events.c' line='1021' column='1'/>
      <!-- parameter of type 'lttng_ust_context*' -->
      <parameter type-id='type-id-323' name='context_param' filepath='liblttng-ust/lttng-events.c' line='1022' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_attach_context(lttng_ust_context*, ust_args*, lttng_ctx**, lttng_session*) -->
    <function-decl name='lttng_attach_context' mangled-name='lttng_attach_context' filepath='liblttng-ust/lttng-events.c' line='977' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_attach_context'>
      <!-- parameter of type 'lttng_ust_context*' -->
      <parameter type-id='type-id-323' name='context_param' filepath='liblttng-ust/lttng-events.c' line='977' column='1'/>
      <!-- parameter of type 'ust_args*' -->
      <parameter type-id='type-id-263' name='uargs' filepath='liblttng-ust/lttng-events.c' line='978' column='1'/>
      <!-- parameter of type 'lttng_ctx**' -->
      <parameter type-id='type-id-297' name='ctx' filepath='liblttng-ust/lttng-events.c' line='979' column='1'/>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust/lttng-events.c' line='979' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_enabler_attach_exclusion(lttng_enabler*, lttng_ust_excluder_node*) -->
    <function-decl name='lttng_enabler_attach_exclusion' mangled-name='lttng_enabler_attach_exclusion' filepath='liblttng-ust/lttng-events.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_attach_exclusion'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-319' name='enabler' filepath='liblttng-ust/lttng-events.c' line='968' column='1'/>
      <!-- parameter of type 'lttng_ust_excluder_node*' -->
      <parameter type-id='type-id-325' name='excluder' filepath='liblttng-ust/lttng-events.c' line='969' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_enabler_attach_bytecode(lttng_enabler*, lttng_ust_filter_bytecode_node*) -->
    <function-decl name='lttng_enabler_attach_bytecode' mangled-name='lttng_enabler_attach_bytecode' filepath='liblttng-ust/lttng-events.c' line='959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_attach_bytecode'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-319' name='enabler' filepath='liblttng-ust/lttng-events.c' line='959' column='1'/>
      <!-- parameter of type 'lttng_ust_filter_bytecode_node*' -->
      <parameter type-id='type-id-326' name='bytecode' filepath='liblttng-ust/lttng-events.c' line='960' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_enabler_disable(lttng_enabler*) -->
    <function-decl name='lttng_enabler_disable' mangled-name='lttng_enabler_disable' filepath='liblttng-ust/lttng-events.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_disable'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-319' name='enabler' filepath='liblttng-ust/lttng-events.c' line='952' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_enabler_enable(lttng_enabler*) -->
    <function-decl name='lttng_enabler_enable' mangled-name='lttng_enabler_enable' filepath='liblttng-ust/lttng-events.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_enable'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-319' name='enabler' filepath='liblttng-ust/lttng-events.c' line='945' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- lttng_enabler* lttng_enabler_create(lttng_enabler_type, lttng_ust_event*, lttng_channel*) -->
    <function-decl name='lttng_enabler_create' mangled-name='lttng_enabler_create' filepath='liblttng-ust/lttng-events.c' line='923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_create'>
      <!-- parameter of type 'enum lttng_enabler_type' -->
      <parameter type-id='type-id-316' name='type' filepath='liblttng-ust/lttng-events.c' line='923' column='1'/>
      <!-- parameter of type 'lttng_ust_event*' -->
      <parameter type-id='type-id-324' name='event_param' filepath='liblttng-ust/lttng-events.c' line='924' column='1'/>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-317' name='chan' filepath='liblttng-ust/lttng-events.c' line='925' column='1'/>
      <!-- lttng_enabler* -->
      <return type-id='type-id-319'/>
    </function-decl>
    <!-- void lttng_ust_events_exit() -->
    <function-decl name='lttng_ust_events_exit' mangled-name='lttng_ust_events_exit' filepath='liblttng-ust/lttng-events.c' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_ust_events_exit'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_handle_pending_statedump(void*) -->
    <function-decl name='lttng_handle_pending_statedump' mangled-name='lttng_handle_pending_statedump' filepath='liblttng-ust/lttng-events.c' line='864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_handle_pending_statedump'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='owner' filepath='liblttng-ust/lttng-events.c' line='864' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_fix_pending_events() -->
    <function-decl name='lttng_fix_pending_events' mangled-name='lttng_fix_pending_events' filepath='liblttng-ust/lttng-events.c' line='849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_fix_pending_events'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_channel_disable(lttng_channel*) -->
    <function-decl name='lttng_channel_disable' mangled-name='lttng_channel_disable' filepath='liblttng-ust/lttng-events.c' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_channel_disable'>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-317' name='channel' filepath='liblttng-ust/lttng-events.c' line='510' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_channel_enable(lttng_channel*) -->
    <function-decl name='lttng_channel_enable' mangled-name='lttng_channel_enable' filepath='liblttng-ust/lttng-events.c' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_channel_enable'>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-317' name='channel' filepath='liblttng-ust/lttng-events.c' line='493' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_session_disable(lttng_session*) -->
    <function-decl name='lttng_session_disable' mangled-name='lttng_session_disable' filepath='liblttng-ust/lttng-events.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_disable'>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust/lttng-events.c' line='475' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_session_enable(lttng_session*) -->
    <function-decl name='lttng_session_enable' mangled-name='lttng_session_enable' filepath='liblttng-ust/lttng-events.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_enable'>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust/lttng-events.c' line='400' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int lttng_session_statedump(lttng_session*) -->
    <function-decl name='lttng_session_statedump' mangled-name='lttng_session_statedump' filepath='liblttng-ust/lttng-events.c' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_statedump'>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust/lttng-events.c' line='393' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_session_destroy(lttng_session*) -->
    <function-decl name='lttng_session_destroy' mangled-name='lttng_session_destroy' filepath='liblttng-ust/lttng-events.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_destroy'>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-129' name='session' filepath='liblttng-ust/lttng-events.c' line='222' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- lttng_session* lttng_session_create() -->
    <function-decl name='lttng_session_create' mangled-name='lttng_session_create' filepath='liblttng-ust/lttng-events.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_create'>
      <!-- lttng_session* -->
      <return type-id='type-id-129'/>
    </function-decl>
    <!-- void synchronize_trace() -->
    <function-decl name='synchronize_trace' mangled-name='synchronize_trace' filepath='liblttng-ust/lttng-events.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='synchronize_trace'>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_session_active() -->
    <function-decl name='lttng_session_active' mangled-name='lttng_session_active' filepath='liblttng-ust/lttng-events.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_session_active'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- cds_list_head* _lttng_get_sessions() -->
    <function-decl name='_lttng_get_sessions' mangled-name='_lttng_get_sessions' filepath='liblttng-ust/lttng-events.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_lttng_get_sessions'>
      <!-- cds_list_head* -->
      <return type-id='type-id-91'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-filter.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- struct lttng_event -->
    <class-decl name='lttng_event' size-in-bits='1344' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='444' column='1' id='type-id-328'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int lttng_event::id -->
        <var-decl name='id' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_channel* lttng_event::chan -->
        <var-decl name='chan' type-id='type-id-189' visibility='default' filepath='../include/lttng/ust-events.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int lttng_event::enabled -->
        <var-decl name='enabled' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- const lttng_event_desc* lttng_event::desc -->
        <var-decl name='desc' type-id='type-id-285' visibility='default' filepath='../include/lttng/ust-events.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void* lttng_event::_deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-events.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ctx* lttng_event::ctx -->
        <var-decl name='ctx' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-events.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- lttng_ust_instrumentation lttng_event::instrumentation -->
        <var-decl name='instrumentation' type-id='type-id-163' visibility='default' filepath='../include/lttng/ust-events.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- cds_list_head lttng_event::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- cds_list_head lttng_event::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void* lttng_event::_deprecated3 -->
        <var-decl name='_deprecated3' type-id='type-id-19' visibility='default' filepath='../include/lttng/ust-events.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_event::_deprecated4 -->
        <var-decl name='_deprecated4' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- cds_list_head lttng_event::bytecode_runtime_head -->
        <var-decl name='bytecode_runtime_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- int lttng_event::has_enablers_without_bytecode -->
        <var-decl name='has_enablers_without_bytecode' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- cds_list_head lttng_event::enablers_ref_head -->
        <var-decl name='enablers_ref_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- cds_hlist_node lttng_event::hlist -->
        <var-decl name='hlist' type-id='type-id-93' visibility='default' filepath='../include/lttng/ust-events.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- int lttng_event::registered -->
        <var-decl name='registered' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='465' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enabler -->
    <class-decl name='lttng_enabler' size-in-bits='5248' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='353' column='1' id='type-id-329'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_enabler_type lttng_enabler::type -->
        <var-decl name='type' type-id='type-id-316' visibility='default' filepath='../include/lttng/ust-events.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head lttng_enabler::filter_bytecode_head -->
        <var-decl name='filter_bytecode_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_enabler::excluder_head -->
        <var-decl name='excluder_head' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- cds_list_head lttng_enabler::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- lttng_ust_event lttng_enabler::event_param -->
        <var-decl name='event_param' type-id='type-id-157' visibility='default' filepath='../include/lttng/ust-events.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <!-- lttng_channel* lttng_enabler::chan -->
        <var-decl name='chan' type-id='type-id-189' visibility='default' filepath='../include/lttng/ust-events.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <!-- lttng_ctx* lttng_enabler::ctx -->
        <var-decl name='ctx' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-events.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_enabler::enabled -->
        <var-decl name='enabled' type-id='type-id-13' visibility='default' filepath='../include/lttng/ust-events.h' line='365' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_filter_bytecode_node -->
    <class-decl name='lttng_ust_filter_bytecode_node' size-in-bits='576' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='391' column='1' id='type-id-330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head lttng_ust_filter_bytecode_node::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_enabler* lttng_ust_filter_bytecode_node::enabler -->
        <var-decl name='enabler' type-id='type-id-331' visibility='default' filepath='../include/lttng/ust-events.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_filter_bytecode lttng_ust_filter_bytecode_node::bc -->
        <var-decl name='bc' type-id='type-id-322' visibility='default' filepath='../include/lttng/ust-events.h' line='398' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_bytecode_runtime -->
    <class-decl name='lttng_bytecode_runtime' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='419' column='1' id='type-id-332'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_filter_bytecode_node* lttng_bytecode_runtime::bc -->
        <var-decl name='bc' type-id='type-id-333' visibility='default' filepath='../include/lttng/ust-events.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- typedef uint64_t (void*, const char*)* lttng_bytecode_runtime::filter -->
        <var-decl name='filter' type-id='type-id-334' visibility='default' filepath='../include/lttng/ust-events.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int lttng_bytecode_runtime::link_failed -->
        <var-decl name='link_failed' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-events.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_bytecode_runtime::node -->
        <var-decl name='node' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-events.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_session* lttng_bytecode_runtime::session -->
        <var-decl name='session' type-id='type-id-129' visibility='default' filepath='../include/lttng/ust-events.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum filter_op -->
    <enum-decl name='filter_op' filepath='liblttng-ust/filter-bytecode.h' line='48' column='1' id='type-id-335'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='FILTER_OP_UNKNOWN' value='0'/>
      <enumerator name='FILTER_OP_RETURN' value='1'/>
      <enumerator name='FILTER_OP_MUL' value='2'/>
      <enumerator name='FILTER_OP_DIV' value='3'/>
      <enumerator name='FILTER_OP_MOD' value='4'/>
      <enumerator name='FILTER_OP_PLUS' value='5'/>
      <enumerator name='FILTER_OP_MINUS' value='6'/>
      <enumerator name='FILTER_OP_RSHIFT' value='7'/>
      <enumerator name='FILTER_OP_LSHIFT' value='8'/>
      <enumerator name='FILTER_OP_BIN_AND' value='9'/>
      <enumerator name='FILTER_OP_BIN_OR' value='10'/>
      <enumerator name='FILTER_OP_BIN_XOR' value='11'/>
      <enumerator name='FILTER_OP_EQ' value='12'/>
      <enumerator name='FILTER_OP_NE' value='13'/>
      <enumerator name='FILTER_OP_GT' value='14'/>
      <enumerator name='FILTER_OP_LT' value='15'/>
      <enumerator name='FILTER_OP_GE' value='16'/>
      <enumerator name='FILTER_OP_LE' value='17'/>
      <enumerator name='FILTER_OP_EQ_STRING' value='18'/>
      <enumerator name='FILTER_OP_NE_STRING' value='19'/>
      <enumerator name='FILTER_OP_GT_STRING' value='20'/>
      <enumerator name='FILTER_OP_LT_STRING' value='21'/>
      <enumerator name='FILTER_OP_GE_STRING' value='22'/>
      <enumerator name='FILTER_OP_LE_STRING' value='23'/>
      <enumerator name='FILTER_OP_EQ_S64' value='24'/>
      <enumerator name='FILTER_OP_NE_S64' value='25'/>
      <enumerator name='FILTER_OP_GT_S64' value='26'/>
      <enumerator name='FILTER_OP_LT_S64' value='27'/>
      <enumerator name='FILTER_OP_GE_S64' value='28'/>
      <enumerator name='FILTER_OP_LE_S64' value='29'/>
      <enumerator name='FILTER_OP_EQ_DOUBLE' value='30'/>
      <enumerator name='FILTER_OP_NE_DOUBLE' value='31'/>
      <enumerator name='FILTER_OP_GT_DOUBLE' value='32'/>
      <enumerator name='FILTER_OP_LT_DOUBLE' value='33'/>
      <enumerator name='FILTER_OP_GE_DOUBLE' value='34'/>
      <enumerator name='FILTER_OP_LE_DOUBLE' value='35'/>
      <enumerator name='FILTER_OP_EQ_DOUBLE_S64' value='36'/>
      <enumerator name='FILTER_OP_NE_DOUBLE_S64' value='37'/>
      <enumerator name='FILTER_OP_GT_DOUBLE_S64' value='38'/>
      <enumerator name='FILTER_OP_LT_DOUBLE_S64' value='39'/>
      <enumerator name='FILTER_OP_GE_DOUBLE_S64' value='40'/>
      <enumerator name='FILTER_OP_LE_DOUBLE_S64' value='41'/>
      <enumerator name='FILTER_OP_EQ_S64_DOUBLE' value='42'/>
      <enumerator name='FILTER_OP_NE_S64_DOUBLE' value='43'/>
      <enumerator name='FILTER_OP_GT_S64_DOUBLE' value='44'/>
      <enumerator name='FILTER_OP_LT_S64_DOUBLE' value='45'/>
      <enumerator name='FILTER_OP_GE_S64_DOUBLE' value='46'/>
      <enumerator name='FILTER_OP_LE_S64_DOUBLE' value='47'/>
      <enumerator name='FILTER_OP_UNARY_PLUS' value='48'/>
      <enumerator name='FILTER_OP_UNARY_MINUS' value='49'/>
      <enumerator name='FILTER_OP_UNARY_NOT' value='50'/>
      <enumerator name='FILTER_OP_UNARY_PLUS_S64' value='51'/>
      <enumerator name='FILTER_OP_UNARY_MINUS_S64' value='52'/>
      <enumerator name='FILTER_OP_UNARY_NOT_S64' value='53'/>
      <enumerator name='FILTER_OP_UNARY_PLUS_DOUBLE' value='54'/>
      <enumerator name='FILTER_OP_UNARY_MINUS_DOUBLE' value='55'/>
      <enumerator name='FILTER_OP_UNARY_NOT_DOUBLE' value='56'/>
      <enumerator name='FILTER_OP_AND' value='57'/>
      <enumerator name='FILTER_OP_OR' value='58'/>
      <enumerator name='FILTER_OP_LOAD_FIELD_REF' value='59'/>
      <enumerator name='FILTER_OP_LOAD_FIELD_REF_STRING' value='60'/>
      <enumerator name='FILTER_OP_LOAD_FIELD_REF_SEQUENCE' value='61'/>
      <enumerator name='FILTER_OP_LOAD_FIELD_REF_S64' value='62'/>
      <enumerator name='FILTER_OP_LOAD_FIELD_REF_DOUBLE' value='63'/>
      <enumerator name='FILTER_OP_LOAD_STRING' value='64'/>
      <enumerator name='FILTER_OP_LOAD_S64' value='65'/>
      <enumerator name='FILTER_OP_LOAD_DOUBLE' value='66'/>
      <enumerator name='FILTER_OP_CAST_TO_S64' value='67'/>
      <enumerator name='FILTER_OP_CAST_DOUBLE_TO_S64' value='68'/>
      <enumerator name='FILTER_OP_CAST_NOP' value='69'/>
      <enumerator name='FILTER_OP_GET_CONTEXT_REF' value='70'/>
      <enumerator name='FILTER_OP_GET_CONTEXT_REF_STRING' value='71'/>
      <enumerator name='FILTER_OP_GET_CONTEXT_REF_S64' value='72'/>
      <enumerator name='FILTER_OP_GET_CONTEXT_REF_DOUBLE' value='73'/>
      <enumerator name='NR_FILTER_OPS' value='74'/>
    </enum-decl>
    <!-- lttng_bytecode_runtime* -->
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-336'/>
    <!-- lttng_enabler* -->
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-331'/>
    <!-- lttng_event* -->
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-337'/>
    <!-- lttng_ust_filter_bytecode_node* -->
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-333'/>
    <!-- typedef uint64_t (void*, const char*)* -->
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-334'/>
    <!-- void lttng_free_event_filter_runtime(lttng_event*) -->
    <function-decl name='lttng_free_event_filter_runtime' mangled-name='lttng_free_event_filter_runtime' filepath='liblttng-ust/lttng-filter.c' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_free_event_filter_runtime'>
      <!-- parameter of type 'lttng_event*' -->
      <parameter type-id='type-id-337' name='event' filepath='liblttng-ust/lttng-filter.c' line='489' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_free_enabler_filter_bytecode(lttng_enabler*) -->
    <function-decl name='lttng_free_enabler_filter_bytecode' mangled-name='lttng_free_enabler_filter_bytecode' filepath='liblttng-ust/lttng-filter.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_free_enabler_filter_bytecode'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-331' name='enabler' filepath='liblttng-ust/lttng-filter.c' line='479' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- int lttng_filter_enabler_attach_bytecode(lttng_enabler*, lttng_ust_filter_bytecode_node*) -->
    <function-decl name='lttng_filter_enabler_attach_bytecode' mangled-name='lttng_filter_enabler_attach_bytecode' filepath='liblttng-ust/lttng-filter.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_filter_enabler_attach_bytecode'>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-331' name='enabler' filepath='liblttng-ust/lttng-filter.c' line='472' column='1'/>
      <!-- parameter of type 'lttng_ust_filter_bytecode_node*' -->
      <parameter type-id='type-id-333' name='filter_bytecode' filepath='liblttng-ust/lttng-filter.c' line='473' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void lttng_enabler_event_link_bytecode(lttng_event*, lttng_enabler*) -->
    <function-decl name='lttng_enabler_event_link_bytecode' mangled-name='lttng_enabler_event_link_bytecode' filepath='liblttng-ust/lttng-filter.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_enabler_event_link_bytecode'>
      <!-- parameter of type 'lttng_event*' -->
      <parameter type-id='type-id-337' name='event' filepath='liblttng-ust/lttng-filter.c' line='420' column='1'/>
      <!-- parameter of type 'lttng_enabler*' -->
      <parameter type-id='type-id-331' name='enabler' filepath='liblttng-ust/lttng-filter.c' line='421' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void lttng_filter_sync_state(lttng_bytecode_runtime*) -->
    <function-decl name='lttng_filter_sync_state' mangled-name='lttng_filter_sync_state' filepath='liblttng-ust/lttng-filter.c' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_filter_sync_state'>
      <!-- parameter of type 'lttng_bytecode_runtime*' -->
      <parameter type-id='type-id-336' name='runtime' filepath='liblttng-ust/lttng-filter.c' line='407' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- const char* print_op(filter_op) -->
    <function-decl name='print_op' mangled-name='print_op' filepath='liblttng-ust/lttng-filter.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_op'>
      <!-- parameter of type 'enum filter_op' -->
      <parameter type-id='type-id-335' name='op' filepath='liblttng-ust/lttng-filter.c' line='130' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-34'/>
    </function-decl>
    <!-- uint64_t (void*, const char*) -->
    <function-type size-in-bits='64' id='type-id-338'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34'/>
      <!-- typedef uint64_t -->
      <return type-id='type-id-151'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-filter-validator.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- struct bytecode_runtime -->
    <class-decl name='bytecode_runtime' size-in-bits='448' is-struct='yes' visibility='default' filepath='liblttng-ust/lttng-filter.h' line='72' column='1' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_bytecode_runtime bytecode_runtime::p -->
        <var-decl name='p' type-id='type-id-332' visibility='default' filepath='liblttng-ust/lttng-filter.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint16_t bytecode_runtime::len -->
        <var-decl name='len' type-id='type-id-340' visibility='default' filepath='liblttng-ust/lttng-filter.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <!-- char bytecode_runtime::data[] -->
        <var-decl name='data' type-id='type-id-76' visibility='default' filepath='liblttng-ust/lttng-filter.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint16_t uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-341' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-340'/>
    <!-- typedef unsigned short int __uint16_t -->
    <typedef-decl name='__uint16_t' type-id='type-id-85' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-341'/>
    <!-- bytecode_runtime* -->
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-342'/>
    <!-- int lttng_filter_validate_bytecode(bytecode_runtime*) -->
    <function-decl name='lttng_filter_validate_bytecode' mangled-name='lttng_filter_validate_bytecode' filepath='liblttng-ust/lttng-filter-validator.c' line='1168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_filter_validate_bytecode'>
      <!-- parameter of type 'bytecode_runtime*' -->
      <parameter type-id='type-id-342' name='bytecode' filepath='liblttng-ust/lttng-filter-validator.c' line='1168' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-filter-specialize.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- int lttng_filter_specialize_bytecode(bytecode_runtime*) -->
    <function-decl name='lttng_filter_specialize_bytecode' mangled-name='lttng_filter_specialize_bytecode' filepath='liblttng-ust/lttng-filter-specialize.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_filter_specialize_bytecode'>
      <!-- parameter of type 'bytecode_runtime*' -->
      <parameter type-id='type-id-342' name='bytecode' filepath='liblttng-ust/lttng-filter-specialize.c' line='26' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-filter-interpreter.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- uint64_t lttng_filter_interpret_bytecode(void*, const char*) -->
    <function-decl name='lttng_filter_interpret_bytecode' mangled-name='lttng_filter_interpret_bytecode' filepath='liblttng-ust/lttng-filter-interpreter.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_filter_interpret_bytecode'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='filter_data' filepath='liblttng-ust/lttng-filter-interpreter.c' line='180' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='filter_stack_data' filepath='liblttng-ust/lttng-filter-interpreter.c' line='181' column='1'/>
      <!-- typedef uint64_t -->
      <return type-id='type-id-151'/>
    </function-decl>
    <!-- uint64_t lttng_filter_false(void*, const char*) -->
    <function-decl name='lttng_filter_false' mangled-name='lttng_filter_false' filepath='liblttng-ust/lttng-filter-interpreter.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lttng_filter_false'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' name='filter_data' filepath='liblttng-ust/lttng-filter-interpreter.c' line='116' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-34' name='filter_stack_data' filepath='liblttng-ust/lttng-filter-interpreter.c' line='117' column='1'/>
      <!-- typedef uint64_t -->
      <return type-id='type-id-151'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-elf.c' comp-dir-path='liblttng-ust' language='LANG_C99'>
    <!-- struct lttng_ust_elf -->
    <class-decl name='lttng_ust_elf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-elf.h' line='199' column='1' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- off_t lttng_ust_elf::section_names_offset -->
        <var-decl name='section_names_offset' type-id='type-id-344' visibility='default' filepath='../include/lttng/ust-elf.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t lttng_ust_elf::section_names_size -->
        <var-decl name='section_names_size' type-id='type-id-42' visibility='default' filepath='../include/lttng/ust-elf.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char* lttng_ust_elf::path -->
        <var-decl name='path' type-id='type-id-32' visibility='default' filepath='../include/lttng/ust-elf.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int lttng_ust_elf::fd -->
        <var-decl name='fd' type-id='type-id-5' visibility='default' filepath='../include/lttng/ust-elf.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- lttng_ust_elf_ehdr* lttng_ust_elf::ehdr -->
        <var-decl name='ehdr' type-id='type-id-345' visibility='default' filepath='../include/lttng/ust-elf.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint8_t lttng_ust_elf::bitness -->
        <var-decl name='bitness' type-id='type-id-346' visibility='default' filepath='../include/lttng/ust-elf.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <!-- uint8_t lttng_ust_elf::endianness -->
        <var-decl name='endianness' type-id='type-id-346' visibility='default' filepath='../include/lttng/ust-elf.h' line='208' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __off_t off_t -->
    <typedef-decl name='off_t' type-id='type-id-27' filepath='/usr/include/sys/types.h' line='85' column='1' id='type-id-344'/>
    <!-- struct lttng_ust_elf_ehdr -->
    <class-decl name='lttng_ust_elf_ehdr' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-elf.h' line='155' column='1' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint16_t lttng_ust_elf_ehdr::e_type -->
        <var-decl name='e_type' type-id='type-id-340' visibility='default' filepath='../include/lttng/ust-elf.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- uint16_t lttng_ust_elf_ehdr::e_machine -->
        <var-decl name='e_machine' type-id='type-id-340' visibility='default' filepath='../include/lttng/ust-elf.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_elf_ehdr::e_version -->
        <var-decl name='e_version' type-id='type-id-124' visibility='default' filepath='../include/lttng/ust-elf.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_elf_ehdr::e_entry -->
        <var-decl name='e_entry' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-elf.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint64_t lttng_ust_elf_ehdr::e_phoff -->
        <var-decl name='e_phoff' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-elf.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint64_t lttng_ust_elf_ehdr::e_shoff -->
        <var-decl name='e_shoff' type-id='type-id-151' visibility='default' filepath='../include/lttng/ust-elf.h' line='161' column='1'/>
      </data-member>
