<abi-corpus architecture='elf-amd-x86_64' soname='liblttng-ust-python-agent.so.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='liblttng-ust.so.0'/>
    <dependency name='liblttng-ust-tracepoint.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='liburcu-bp.so.6'/>
    <dependency name='liburcu-cds.so.6'/>
    <dependency name='libpthread.so.0'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- py_tracepoint -->
    <elf-symbol name='py_tracepoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __tracepoint_lttng_python___event -->
    <elf-symbol name='__tracepoint_lttng_python___event' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_provider_lttng_python -->
    <elf-symbol name='__tracepoint_provider_lttng_python' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoints__disable_destructors -->
    <elf-symbol name='__tracepoints__disable_destructors' size='4' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='lttng_ust_python.c' comp-dir-path='liblttng-ust-python-agent' language='LANG_C99'>

    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-2'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-6'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- void -->
    <type-decl name='void' id='type-id-7'/>
    <!-- struct lttng_ust_tracepoint_dlopen -->
    <class-decl name='lttng_ust_tracepoint_dlopen' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint.h' line='215' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* lttng_ust_tracepoint_dlopen::liblttngust_handle -->
        <var-decl name='liblttngust_handle' type-id='type-id-9' visibility='default' filepath='../include/lttng/tracepoint.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int (lttng_ust_tracepoint* const*, int)* lttng_ust_tracepoint_dlopen::tracepoint_register_lib -->
        <var-decl name='tracepoint_register_lib' type-id='type-id-10' visibility='default' filepath='../include/lttng/tracepoint.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int (lttng_ust_tracepoint* const*)* lttng_ust_tracepoint_dlopen::tracepoint_unregister_lib -->
        <var-decl name='tracepoint_unregister_lib' type-id='type-id-11' visibility='default' filepath='../include/lttng/tracepoint.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_lock_sym_bp -->
        <var-decl name='rcu_read_lock_sym_bp' type-id='type-id-12' visibility='default' filepath='../include/lttng/tracepoint.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_unlock_sym_bp -->
        <var-decl name='rcu_read_unlock_sym_bp' type-id='type-id-12' visibility='default' filepath='../include/lttng/tracepoint.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* (void*)* lttng_ust_tracepoint_dlopen::rcu_dereference_sym_bp -->
        <var-decl name='rcu_dereference_sym_bp' type-id='type-id-13' visibility='default' filepath='../include/lttng/tracepoint.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint -->
    <class-decl name='lttng_ust_tracepoint' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='32' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_ust_tracepoint::name -->
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_ust_tracepoint::state -->
        <var-decl name='state' type-id='type-id-5' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_tracepoint_probe* lttng_ust_tracepoint::probes -->
        <var-decl name='probes' type-id='type-id-16' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int* lttng_ust_tracepoint::tracepoint_provider_ref -->
        <var-decl name='tracepoint_provider_ref' type-id='type-id-17' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const char* lttng_ust_tracepoint::signature -->
        <var-decl name='signature' type-id='type-id-15' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char lttng_ust_tracepoint::padding[16] -->
        <var-decl name='padding' type-id='type-id-2' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_probe -->
    <class-decl name='lttng_ust_tracepoint_probe' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='26' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* lttng_ust_tracepoint_probe::func -->
        <var-decl name='func' type-id='type-id-12' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_tracepoint_probe::data -->
        <var-decl name='data' type-id='type-id-9' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <!-- const char -->
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-19'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-15'/>
    <!-- int (lttng_ust_tracepoint* const*)* -->
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-11'/>
    <!-- int (lttng_ust_tracepoint* const*, int)* -->
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-10'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-17'/>
    <!-- lttng_ust_tracepoint* -->
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-22'/>
    <!-- lttng_ust_tracepoint* const -->
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-23'/>
    <!-- lttng_ust_tracepoint* const* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <!-- lttng_ust_tracepoint_dlopen* -->
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-25'/>
    <!-- lttng_ust_tracepoint_probe* -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-16'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-12'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-9'/>
    <!-- void* (void*)* -->
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-13'/>
    <!-- int __tracepoints__disable_destructors -->
    <var-decl name='__tracepoints__disable_destructors' type-id='type-id-5' mangled-name='__tracepoints__disable_destructors' visibility='default' filepath='../include/lttng/tracepoint.h' line='230' column='1' elf-symbol-id='__tracepoints__disable_destructors'/>
    <!-- lttng_ust_tracepoint_dlopen tracepoint_dlopen -->
    <var-decl name='tracepoint_dlopen' type-id='type-id-8' visibility='default' filepath='../include/lttng/tracepoint.h' line='226' column='1'/>
    <!-- lttng_ust_tracepoint_dlopen* tracepoint_dlopen_ptr -->
    <var-decl name='tracepoint_dlopen_ptr' type-id='type-id-25' visibility='default' filepath='../include/lttng/tracepoint.h' line='227' column='1'/>
    <!-- lttng_ust_tracepoint __tracepoint_lttng_python___event -->
    <var-decl name='__tracepoint_lttng_python___event' type-id='type-id-14' mangled-name='__tracepoint_lttng_python___event' visibility='default' filepath='liblttng-ust-python-agent/lttng_ust_python.h' line='27' column='1' elf-symbol-id='__tracepoint_lttng_python___event'/>
    <!-- int __tracepoint_provider_lttng_python -->
    <var-decl name='__tracepoint_provider_lttng_python' type-id='type-id-5' mangled-name='__tracepoint_provider_lttng_python' visibility='default' filepath='liblttng-ust-python-agent/lttng_ust_python.h' line='27' column='1' elf-symbol-id='__tracepoint_provider_lttng_python'/>
    <!-- void py_tracepoint(const char*, const char*, const char*, const char*, unsigned int, unsigned int, unsigned int, const char*) -->
    <function-decl name='py_tracepoint' mangled-name='py_tracepoint' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='py_tracepoint'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='asctime' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='27' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='msg' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='27' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='logger_name' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='28' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='funcName' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='28' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-6' name='lineno' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='28' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-6' name='int_loglevel' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='29' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-6' name='thread' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='29' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='threadName' filepath='liblttng-ust-python-agent/lttng_ust_python.c' line='29' column='1'/>
      <!-- void -->
      <return type-id='type-id-7'/>
    </function-decl>
    <!-- int (lttng_ust_tracepoint* const*) -->
    <function-type size-in-bits='64' id='type-id-20'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-24'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (lttng_ust_tracepoint* const*, int) -->
    <function-type size-in-bits='64' id='type-id-21'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-24'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-26'>
      <!-- void -->
      <return type-id='type-id-7'/>
    </function-type>
    <!-- void* (void*) -->
    <function-type size-in-bits='64' id='type-id-27'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-9'/>
      <!-- void* -->
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
</abi-corpus>
