<abi-corpus architecture='elf-amd-x86_64' soname='liblttng-ust-ctl.so.2'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='liburcu-bp.so.6'/>
    <dependency name='liburcu-cds.so.6'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- __sflush -->
    <elf-symbol name='__sflush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __sfvwrite -->
    <elf-symbol name='__sfvwrite' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __swsetup -->
    <elf-symbol name='__swsetup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _get_num_possible_cpus -->
    <elf-symbol name='_get_num_possible_cpus' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- align_shm -->
    <elf-symbol name='align_shm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- channel_backend_free -->
    <elf-symbol name='channel_backend_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- channel_backend_init -->

    <elf-symbol name='ustctl_wait_quiescent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- ustctl_write_metadata_to_channel -->
    <elf-symbol name='ustctl_write_metadata_to_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- ustctl_write_one_packet_to_channel -->
    <elf-symbol name='ustctl_write_one_packet_to_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- zalloc_shm -->
    <elf-symbol name='zalloc_shm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __num_possible_cpus -->
    <elf-symbol name='__num_possible_cpus' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dt_var_fields -->
    <elf-symbol name='dt_var_fields' size='3840' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lib_ring_buffer_nesting -->
    <elf-symbol name='lib_ring_buffer_nesting' size='4' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_discard -->
    <elf-symbol name='lttng_client_callbacks_discard' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_discard_rt -->
    <elf-symbol name='lttng_client_callbacks_discard_rt' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_metadata -->
    <elf-symbol name='lttng_client_callbacks_metadata' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_overwrite -->
    <elf-symbol name='lttng_client_callbacks_overwrite' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_client_callbacks_overwrite_rt -->
    <elf-symbol name='lttng_client_callbacks_overwrite_rt' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_crash_magic_xor -->
    <elf-symbol name='lttng_crash_magic_xor' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_get_cpu -->
    <elf-symbol name='lttng_get_cpu' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_trace_clock -->
    <elf-symbol name='lttng_trace_clock' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- ust_loglevel -->
    <elf-symbol name='ust_loglevel' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='ustctl.c' comp-dir-path='liblttng-ust-ctl' language='LANG_C99'>



















    <!-- cds_hlist_head[4096] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='262144' id='type-id-2'>
      <!-- <anonymous range>[4096] -->
      <subrange length='4096' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-5'/>
    <!-- char[128] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='1024' id='type-id-6'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' type-id='type-id-3' id='type-id-7'/>

    </array-type-def>
    <!-- char[15] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='120' id='type-id-8'>
      <!-- <anonymous range>[15] -->
      <subrange length='15' type-id='type-id-3' id='type-id-9'/>

    </array-type-def>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='128' id='type-id-10'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-11'/>

    </array-type-def>
    <!-- char[20] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='160' id='type-id-12'>
      <!-- <anonymous range>[20] -->
      <subrange length='20' type-id='type-id-3' id='type-id-13'/>

    </array-type-def>
    <!-- char[24] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='192' id='type-id-14'>
      <!-- <anonymous range>[24] -->
      <subrange length='24' type-id='type-id-3' id='type-id-15'/>

    </array-type-def>
    <!-- char[255] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2040' id='type-id-16'>
      <!-- <anonymous range>[255] -->
      <subrange length='255' type-id='type-id-3' id='type-id-17'/>

    </array-type-def>
    <!-- char[256] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2048' id='type-id-18'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='type-id-3' id='type-id-19'/>

    </array-type-def>
    <!-- char[256][] -->
    <array-type-def dimensions='2' type-id='type-id-5' size-in-bits='infinite' id='type-id-20'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='type-id-3' id='type-id-19'/>

      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-21'/>

    </array-type-def>
    <!-- char[284] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2272' id='type-id-22'>
      <!-- <anonymous range>[284] -->
      <subrange length='284' type-id='type-id-3' id='type-id-23'/>

    </array-type-def>
    <!-- char[288] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2304' id='type-id-24'>
      <!-- <anonymous range>[288] -->
      <subrange length='288' type-id='type-id-3' id='type-id-25'/>

    </array-type-def>
    <!-- char[28] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='224' id='type-id-26'>
      <!-- <anonymous range>[28] -->
      <subrange length='28' type-id='type-id-3' id='type-id-27'/>

    </array-type-def>
    <!-- char[296] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2368' id='type-id-28'>
      <!-- <anonymous range>[296] -->
      <subrange length='296' type-id='type-id-3' id='type-id-29'/>

    </array-type-def>
    <!-- char[32] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='256' id='type-id-30'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='type-id-3' id='type-id-31'/>

    </array-type-def>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='320' id='type-id-32'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-33'/>

    </array-type-def>
    <!-- char[4] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='32' id='type-id-34'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-3' id='type-id-35'/>

    </array-type-def>
    <!-- char[60] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='480' id='type-id-36'>
      <!-- <anonymous range>[60] -->
      <subrange length='60' type-id='type-id-3' id='type-id-37'/>

    </array-type-def>
    <!-- char[64] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='512' id='type-id-38'>
      <!-- <anonymous range>[64] -->
      <subrange length='64' type-id='type-id-3' id='type-id-39'/>

    </array-type-def>
    <!-- char[] -->
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='infinite' id='type-id-40'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-21'/>

    </array-type-def>
    <!-- struct lttng_perf_counter_field -->
    <class-decl name='lttng_perf_counter_field' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-41'/>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' id='type-id-42'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-43'/>
    <!-- int[2] -->
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='64' id='type-id-44'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-45'/>

    </array-type-def>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-46'/>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-47'/>
    <!-- lttng_ust_lib_ring_buffer_shmp[] -->
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='infinite' id='type-id-49'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-21'/>

    </array-type-def>
    <!-- shm_object[] -->
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='infinite' id='type-id-51'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-3' id='type-id-21'/>

    </array-type-def>
    <!-- uint8_t[16] -->
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='128' id='type-id-53'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-11'/>

    </array-type-def>
    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-54'/>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-55'/>
    <!-- unsigned char[16] -->
    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='128' id='type-id-56'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-11'/>

    </array-type-def>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-57'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-58'/>
    <!-- void -->
    <type-decl name='void' id='type-id-59'/>
    <!-- enum ust_loglevel -->
    <enum-decl name='ust_loglevel' filepath='../include/usterr-signal-safe.h' line='31' column='1' id='type-id-60'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='UST_LOGLEVEL_UNKNOWN' value='0'/>
      <enumerator name='UST_LOGLEVEL_NORMAL' value='1'/>
      <enumerator name='UST_LOGLEVEL_DEBUG' value='2'/>
    </enum-decl>
    <!-- typedef __uint32_t uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-61' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-62'/>
    <!-- typedef unsigned int __uint32_t -->
    <typedef-decl name='__uint32_t' type-id='type-id-57' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-61'/>
    <!-- enum ustctl_channel_header -->
    <enum-decl name='ustctl_channel_header' filepath='../include/lttng/ust-ctl.h' line='296' column='1' id='type-id-63'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='USTCTL_CHANNEL_HEADER_UNKNOWN' value='0'/>
      <enumerator name='USTCTL_CHANNEL_HEADER_COMPACT' value='1'/>
      <enumerator name='USTCTL_CHANNEL_HEADER_LARGE' value='2'/>
    </enum-decl>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/10.2.0/include/stddef.h' line='209' column='1' id='type-id-64'/>
    <!-- struct ustctl_field -->
    <class-decl name='ustctl_field' size-in-bits='7360' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='415' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char ustctl_field::name[256] -->
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-ctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- ustctl_type ustctl_field::type -->
        <var-decl name='type' type-id='type-id-66' visibility='default' filepath='../include/lttng/ust-ctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <!-- char ustctl_field::padding[28] -->
        <var-decl name='padding' type-id='type-id-26' visibility='default' filepath='../include/lttng/ust-ctl.h' line='418' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustctl_type -->
    <class-decl name='ustctl_type' size-in-bits='5088' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='389' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- ustctl_abstract_types ustctl_type::atype -->
        <var-decl name='atype' type-id='type-id-67' visibility='default' filepath='../include/lttng/ust-ctl.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {_ustctl_basic_type basic; struct {ustctl_basic_type elem_type; uint32_t length;} array; struct {ustctl_basic_type length_type; ustctl_basic_type elem_type;} sequence; struct {uint32_t nr_choices; char tag_name[256];} variant; struct {uint32_t nr_fields;} _struct; char padding[128];} ustctl_type::u -->
        <var-decl name='u' type-id='type-id-68' visibility='default' filepath='../include/lttng/ust-ctl.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum ustctl_abstract_types -->
    <enum-decl name='ustctl_abstract_types' filepath='../include/lttng/ust-ctl.h' line='304' column='1' id='type-id-67'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='ustctl_atype_integer' value='0'/>
      <enumerator name='ustctl_atype_enum' value='1'/>
      <enumerator name='ustctl_atype_array' value='2'/>
      <enumerator name='ustctl_atype_sequence' value='3'/>
      <enumerator name='ustctl_atype_string' value='4'/>
      <enumerator name='ustctl_atype_float' value='5'/>
      <enumerator name='ustctl_atype_variant' value='6'/>
      <enumerator name='ustctl_atype_struct' value='7'/>
      <enumerator name='NR_USTCTL_ABSTRACT_TYPES' value='8'/>
    </enum-decl>
    <!-- union {_ustctl_basic_type basic; struct {ustctl_basic_type elem_type; uint32_t length;} array; struct {ustctl_basic_type length_type; ustctl_basic_type elem_type;} sequence; struct {uint32_t nr_choices; char tag_name[256];} variant; struct {uint32_t nr_fields;} _struct; char padding[128];} -->
    <union-decl name='__anonymous_union__' size-in-bits='5056' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='391' column='1' id='type-id-68'>
      <data-member access='private'>
        <!-- _ustctl_basic_type basic -->
        <var-decl name='basic' type-id='type-id-69' visibility='default' filepath='../include/lttng/ust-ctl.h' line='392' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {ustctl_basic_type elem_type; uint32_t length;} array -->
        <var-decl name='array' type-id='type-id-70' visibility='default' filepath='../include/lttng/ust-ctl.h' line='396' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {ustctl_basic_type length_type; ustctl_basic_type elem_type;} sequence -->
        <var-decl name='sequence' type-id='type-id-71' visibility='default' filepath='../include/lttng/ust-ctl.h' line='400' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_choices; char tag_name[256];} variant -->
        <var-decl name='variant' type-id='type-id-72' visibility='default' filepath='../include/lttng/ust-ctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_fields;} _struct -->
        <var-decl name='_struct' type-id='type-id-73' visibility='default' filepath='../include/lttng/ust-ctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[128] -->
        <var-decl name='padding' type-id='type-id-6' visibility='default' filepath='../include/lttng/ust-ctl.h' line='410' column='1'/>
      </data-member>
    </union-decl>
    <!-- union _ustctl_basic_type -->
    <union-decl name='_ustctl_basic_type' size-in-bits='2496' visibility='default' filepath='../include/lttng/ust-ctl.h' line='367' column='1' id='type-id-69'>
      <data-member access='private'>
        <!-- ustctl_integer_type _ustctl_basic_type::integer -->
        <var-decl name='integer' type-id='type-id-74' visibility='default' filepath='../include/lttng/ust-ctl.h' line='368' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char name[256]; ustctl_integer_type container_type; uint64_t id;} _ustctl_basic_type::enumeration -->
        <var-decl name='enumeration' type-id='type-id-75' visibility='default' filepath='../include/lttng/ust-ctl.h' line='373' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int32_t encoding;} _ustctl_basic_type::string -->
        <var-decl name='string' type-id='type-id-76' visibility='default' filepath='../include/lttng/ust-ctl.h' line='376' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- ustctl_float_type _ustctl_basic_type::_float -->
        <var-decl name='_float' type-id='type-id-77' visibility='default' filepath='../include/lttng/ust-ctl.h' line='377' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char _ustctl_basic_type::padding[296] -->
        <var-decl name='padding' type-id='type-id-28' visibility='default' filepath='../include/lttng/ust-ctl.h' line='378' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct ustctl_integer_type -->
    <class-decl name='ustctl_integer_type' size-in-bits='368' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='324' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t ustctl_integer_type::size -->
        <var-decl name='size' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ustctl_integer_type::signedness -->
        <var-decl name='signedness' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t ustctl_integer_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t ustctl_integer_type::base -->
        <var-decl name='base' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int32_t ustctl_integer_type::encoding -->
        <var-decl name='encoding' type-id='type-id-78' visibility='default' filepath='../include/lttng/ust-ctl.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint16_t ustctl_integer_type::alignment -->
        <var-decl name='alignment' type-id='type-id-79' visibility='default' filepath='../include/lttng/ust-ctl.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <!-- char ustctl_integer_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-14' visibility='default' filepath='../include/lttng/ust-ctl.h' line='331' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __int32_t int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-80' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-78'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-43' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-80'/>
    <!-- typedef __uint16_t uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-81' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-79'/>
    <!-- typedef unsigned short int __uint16_t -->
    <typedef-decl name='__uint16_t' type-id='type-id-58' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-81'/>
    <!-- struct {char name[256]; ustctl_integer_type container_type; uint64_t id;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='2496' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='369' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char name[256] -->
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-ctl.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- ustctl_integer_type container_type -->
        <var-decl name='container_type' type-id='type-id-74' visibility='default' filepath='../include/lttng/ust-ctl.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <!-- uint64_t id -->
        <var-decl name='id' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-ctl.h' line='372' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint64_t uint64_t -->
    <typedef-decl name='uint64_t' type-id='type-id-83' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-82'/>
    <!-- typedef unsigned long int __uint64_t -->
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-83'/>
    <!-- struct {int32_t encoding;} -->
    <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='374' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t encoding -->
        <var-decl name='encoding' type-id='type-id-78' visibility='default' filepath='../include/lttng/ust-ctl.h' line='375' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustctl_float_type -->
    <class-decl name='ustctl_float_type' size-in-bits='304' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='335' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t ustctl_float_type::exp_dig -->
        <var-decl name='exp_dig' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ustctl_float_type::mant_dig -->
        <var-decl name='mant_dig' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t ustctl_float_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint16_t ustctl_float_type::alignment -->
        <var-decl name='alignment' type-id='type-id-79' visibility='default' filepath='../include/lttng/ust-ctl.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <!-- char ustctl_float_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-14' visibility='default' filepath='../include/lttng/ust-ctl.h' line='340' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {ustctl_basic_type elem_type; uint32_t length;} -->
    <class-decl name='__anonymous_struct__2' size-in-bits='2560' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='393' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- ustctl_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-84' visibility='default' filepath='../include/lttng/ust-ctl.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <!-- uint32_t length -->
        <var-decl name='length' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustctl_basic_type -->
    <class-decl name='ustctl_basic_type' size-in-bits='2528' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='381' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- ustctl_abstract_types ustctl_basic_type::atype -->
        <var-decl name='atype' type-id='type-id-67' visibility='default' filepath='../include/lttng/ust-ctl.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {_ustctl_basic_type basic;} ustctl_basic_type::u -->
        <var-decl name='u' type-id='type-id-85' visibility='default' filepath='../include/lttng/ust-ctl.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {_ustctl_basic_type basic;} -->
    <union-decl name='__anonymous_union__1' size-in-bits='2496' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='383' column='1' id='type-id-85'>
      <data-member access='private'>
        <!-- _ustctl_basic_type basic -->
        <var-decl name='basic' type-id='type-id-69' visibility='default' filepath='../include/lttng/ust-ctl.h' line='384' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {ustctl_basic_type length_type; ustctl_basic_type elem_type;} -->
    <class-decl name='__anonymous_struct__3' size-in-bits='5056' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='397' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- ustctl_basic_type length_type -->
        <var-decl name='length_type' type-id='type-id-84' visibility='default' filepath='../include/lttng/ust-ctl.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <!-- ustctl_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-84' visibility='default' filepath='../include/lttng/ust-ctl.h' line='399' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_choices; char tag_name[256];} -->
    <class-decl name='__anonymous_struct__4' size-in-bits='2080' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='401' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_choices -->
        <var-decl name='nr_choices' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char tag_name[256] -->
        <var-decl name='tag_name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-ctl.h' line='403' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_fields;} -->
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='406' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='407' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustctl_enum_entry -->
    <class-decl name='ustctl_enum_entry' size-in-bits='2688' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='355' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- ustctl_enum_value ustctl_enum_entry::start -->
        <var-decl name='start' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-ctl.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- ustctl_enum_value ustctl_enum_entry::end -->
        <var-decl name='end' type-id='type-id-87' visibility='default' filepath='../include/lttng/ust-ctl.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char ustctl_enum_entry::string[256] -->
        <var-decl name='string' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-ctl.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <!-- union {struct {uint32_t options;} extra; char padding[32];} ustctl_enum_entry::u -->
        <var-decl name='u' type-id='type-id-88' visibility='default' filepath='../include/lttng/ust-ctl.h' line='363' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustctl_enum_value -->
    <class-decl name='ustctl_enum_value' size-in-bits='192' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='344' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t ustctl_enum_value::value -->
        <var-decl name='value' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-ctl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint8_t ustctl_enum_value::signedness -->
        <var-decl name='signedness' type-id='type-id-52' visibility='default' filepath='../include/lttng/ust-ctl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <!-- char ustctl_enum_value::padding[15] -->
        <var-decl name='padding' type-id='type-id-8' visibility='default' filepath='../include/lttng/ust-ctl.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint8_t uint8_t -->
    <typedef-decl name='uint8_t' type-id='type-id-89' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-52'/>
    <!-- typedef unsigned char __uint8_t -->
    <typedef-decl name='__uint8_t' type-id='type-id-55' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-89'/>
    <!-- union {struct {uint32_t options;} extra; char padding[32];} -->
    <union-decl name='__anonymous_union__2' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='358' column='1' id='type-id-88'>
      <data-member access='private'>
        <!-- struct {uint32_t options;} extra -->
        <var-decl name='extra' type-id='type-id-90' visibility='default' filepath='../include/lttng/ust-ctl.h' line='361' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/lttng/ust-ctl.h' line='362' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {uint32_t options;} -->
    <class-decl name='__anonymous_struct__6' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='359' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t options -->
        <var-decl name='options' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='360' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum ustctl_notify_cmd -->
    <enum-decl name='ustctl_notify_cmd' filepath='../include/lttng/ust-ctl.h' line='290' column='1' id='type-id-91'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='USTCTL_NOTIFY_CMD_EVENT' value='0'/>
      <enumerator name='USTCTL_NOTIFY_CMD_CHANNEL' value='1'/>
      <enumerator name='USTCTL_NOTIFY_CMD_ENUM' value='2'/>
    </enum-decl>
    <!-- enum ustctl_socket_type -->
    <enum-decl name='ustctl_socket_type' filepath='../include/lttng/ust-ctl.h' line='285' column='1' id='type-id-92'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='USTCTL_SOCKET_CMD' value='0'/>
      <enumerator name='USTCTL_SOCKET_NOTIFY' value='1'/>
    </enum-decl>
    <!-- struct ustctl_consumer_stream -->
    <class-decl name='ustctl_consumer_stream' size-in-bits='384' is-struct='yes' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='60' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_shm_handle* ustctl_consumer_stream::handle -->
        <var-decl name='handle' type-id='type-id-94' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_lib_ring_buffer* ustctl_consumer_stream::buf -->
        <var-decl name='buf' type-id='type-id-95' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- ustctl_consumer_channel* ustctl_consumer_stream::chan -->
        <var-decl name='chan' type-id='type-id-96' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int ustctl_consumer_stream::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-43' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int ustctl_consumer_stream::wait_fd -->
        <var-decl name='wait_fd' type-id='type-id-43' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int ustctl_consumer_stream::wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-43' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int ustctl_consumer_stream::cpu -->
        <var-decl name='cpu' type-id='type-id-43' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint64_t ustctl_consumer_stream::memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-82' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_shm_handle -->
    <class-decl name='lttng_ust_shm_handle' size-in-bits='192' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='52' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- shm_object_table* lttng_ust_shm_handle::table -->
        <var-decl name='table' type-id='type-id-98' visibility='default' filepath='../libringbuffer/shm_types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {shm_ref _ref; channel* _type;} lttng_ust_shm_handle::chan -->
        <var-decl name='chan' type-id='type-id-99' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct shm_object_table -->
    <class-decl name='shm_object_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='46' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- size_t shm_object_table::size -->
        <var-decl name='size' type-id='type-id-64' visibility='default' filepath='../libringbuffer/shm_types.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t shm_object_table::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-64' visibility='default' filepath='../libringbuffer/shm_types.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- shm_object shm_object_table::objects[] -->
        <var-decl name='objects' type-id='type-id-51' visibility='default' filepath='../libringbuffer/shm_types.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct shm_object -->
    <class-decl name='shm_object' size-in-bits='512' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='35' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- shm_object_type shm_object::type -->
        <var-decl name='type' type-id='type-id-101' visibility='default' filepath='../libringbuffer/shm_types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t shm_object::index -->
        <var-decl name='index' type-id='type-id-64' visibility='default' filepath='../libringbuffer/shm_types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int shm_object::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-43' visibility='default' filepath='../libringbuffer/shm_types.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int shm_object::wait_fd[2] -->
        <var-decl name='wait_fd' type-id='type-id-44' visibility='default' filepath='../libringbuffer/shm_types.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- char* shm_object::memory_map -->
        <var-decl name='memory_map' type-id='type-id-102' visibility='default' filepath='../libringbuffer/shm_types.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- size_t shm_object::memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-64' visibility='default' filepath='../libringbuffer/shm_types.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint64_t shm_object::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-82' visibility='default' filepath='../libringbuffer/shm_types.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int shm_object::shm_fd_ownership -->
        <var-decl name='shm_fd_ownership' type-id='type-id-43' visibility='default' filepath='../libringbuffer/shm_types.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum shm_object_type -->
    <enum-decl name='shm_object_type' filepath='../libringbuffer/shm_types.h' line='30' column='1' id='type-id-101'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='SHM_OBJECT_SHM' value='0'/>
      <enumerator name='SHM_OBJECT_MEM' value='1'/>
    </enum-decl>
    <!-- union {shm_ref _ref; channel* _type;} -->
    <union-decl name='__anonymous_union__3' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1' id='type-id-99'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- channel* _type -->
        <var-decl name='_type' type-id='type-id-104' visibility='default' filepath='../libringbuffer/shm_types.h' line='54' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct shm_ref -->
    <class-decl name='shm_ref' size-in-bits='128' is-struct='yes' visibility='default' filepath='../libringbuffer/shm_internal.h' line='24' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- volatile ssize_t shm_ref::index -->
        <var-decl name='index' type-id='type-id-105' visibility='default' filepath='../libringbuffer/shm_internal.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- volatile ssize_t shm_ref::offset -->
        <var-decl name='offset' type-id='type-id-105' visibility='default' filepath='../libringbuffer/shm_internal.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __ssize_t ssize_t -->
    <typedef-decl name='ssize_t' type-id='type-id-106' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-107'/>
    <!-- typedef long int __ssize_t -->
    <typedef-decl name='__ssize_t' type-id='type-id-46' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-106'/>
    <!-- struct channel -->
    <class-decl name='channel' size-in-bits='6144' is-struct='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='52' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int channel::record_disabled -->
        <var-decl name='record_disabled' type-id='type-id-43' visibility='default' filepath='../libringbuffer/frontend_types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned long int channel::commit_count_mask -->
        <var-decl name='commit_count_mask' type-id='type-id-3' visibility='default' filepath='../libringbuffer/frontend_types.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned long int channel::switch_timer_interval -->
        <var-decl name='switch_timer_interval' type-id='type-id-3' visibility='default' filepath='../libringbuffer/frontend_types.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- timer_t channel::switch_timer -->
        <var-decl name='switch_timer' type-id='type-id-109' visibility='default' filepath='../libringbuffer/frontend_types.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int channel::switch_timer_enabled -->
        <var-decl name='switch_timer_enabled' type-id='type-id-43' visibility='default' filepath='../libringbuffer/frontend_types.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned long int channel::read_timer_interval -->
        <var-decl name='read_timer_interval' type-id='type-id-3' visibility='default' filepath='../libringbuffer/frontend_types.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- timer_t channel::read_timer -->
        <var-decl name='read_timer' type-id='type-id-109' visibility='default' filepath='../libringbuffer/frontend_types.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int channel::read_timer_enabled -->
        <var-decl name='read_timer_enabled' type-id='type-id-43' visibility='default' filepath='../libringbuffer/frontend_types.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int channel::finalized -->
        <var-decl name='finalized' type-id='type-id-43' visibility='default' filepath='../libringbuffer/frontend_types.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- size_t channel::priv_data_offset -->
        <var-decl name='priv_data_offset' type-id='type-id-64' visibility='default' filepath='../libringbuffer/frontend_types.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- unsigned int channel::nr_streams -->
        <var-decl name='nr_streams' type-id='type-id-57' visibility='default' filepath='../libringbuffer/frontend_types.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- lttng_ust_shm_handle* channel::handle -->
        <var-decl name='handle' type-id='type-id-94' visibility='default' filepath='../libringbuffer/frontend_types.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- char channel::padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../libringbuffer/frontend_types.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- channel_backend channel::backend -->
        <var-decl name='backend' type-id='type-id-110' visibility='default' filepath='../libringbuffer/frontend_types.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __timer_t timer_t -->
    <typedef-decl name='timer_t' type-id='type-id-111' filepath='/usr/include/bits/types/timer_t.h' line='7' column='1' id='type-id-109'/>
    <!-- typedef void* __timer_t -->
    <typedef-decl name='__timer_t' type-id='type-id-112' filepath='/usr/include/bits/types.h' line='172' column='1' id='type-id-111'/>
    <!-- struct channel_backend -->
    <class-decl name='channel_backend' size-in-bits='4352' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='92' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int channel_backend::buf_size -->
        <var-decl name='buf_size' type-id='type-id-3' visibility='default' filepath='../libringbuffer/backend_types.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned long int channel_backend::subbuf_size -->
        <var-decl name='subbuf_size' type-id='type-id-3' visibility='default' filepath='../libringbuffer/backend_types.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int channel_backend::subbuf_size_order -->
        <var-decl name='subbuf_size_order' type-id='type-id-57' visibility='default' filepath='../libringbuffer/backend_types.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- unsigned int channel_backend::num_subbuf_order -->
        <var-decl name='num_subbuf_order' type-id='type-id-57' visibility='default' filepath='../libringbuffer/backend_types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int channel_backend::buf_size_order -->
        <var-decl name='buf_size_order' type-id='type-id-57' visibility='default' filepath='../libringbuffer/backend_types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int channel_backend::extra_reader_sb -->
        <var-decl name='extra_reader_sb' type-id='type-id-57' visibility='default' filepath='../libringbuffer/backend_types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned long int channel_backend::num_subbuf -->
        <var-decl name='num_subbuf' type-id='type-id-3' visibility='default' filepath='../libringbuffer/backend_types.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint64_t channel_backend::start_tsc -->
        <var-decl name='start_tsc' type-id='type-id-82' visibility='default' filepath='../libringbuffer/backend_types.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {shm_ref _ref; void** _type;} channel_backend::priv_data -->
        <var-decl name='priv_data' type-id='type-id-113' visibility='default' filepath='../libringbuffer/backend_types.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- lttng_ust_lib_ring_buffer_config channel_backend::config -->
        <var-decl name='config' type-id='type-id-114' visibility='default' filepath='../libringbuffer/backend_types.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <!-- char channel_backend::name[255] -->
        <var-decl name='name' type-id='type-id-16' visibility='default' filepath='../libringbuffer/backend_types.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3832'>
        <!-- char channel_backend::padding[64] -->
        <var-decl name='padding' type-id='type-id-38' visibility='default' filepath='../libringbuffer/backend_types.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <!-- lttng_ust_lib_ring_buffer_shmp channel_backend::buf[] -->
        <var-decl name='buf' type-id='type-id-49' visibility='default' filepath='../libringbuffer/backend_types.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; void** _type;} -->
    <union-decl name='__anonymous_union__4' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='104' column='1' id='type-id-113'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='104' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- void** _type -->
        <var-decl name='_type' type-id='type-id-115' visibility='default' filepath='../libringbuffer/backend_types.h' line='104' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_lib_ring_buffer_config -->
    <class-decl name='lttng_ust_lib_ring_buffer_config' size-in-bits='1280' is-struct='yes' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='193' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_lib_ring_buffer_alloc_types lttng_ust_lib_ring_buffer_config::alloc -->
        <var-decl name='alloc' type-id='type-id-116' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- lttng_ust_lib_ring_buffer_sync_types lttng_ust_lib_ring_buffer_config::sync -->
        <var-decl name='sync' type-id='type-id-117' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_lib_ring_buffer_mode_types lttng_ust_lib_ring_buffer_config::mode -->
        <var-decl name='mode' type-id='type-id-118' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- lttng_ust_lib_ring_buffer_output_types lttng_ust_lib_ring_buffer_config::output -->
        <var-decl name='output' type-id='type-id-119' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_lib_ring_buffer_backend_types lttng_ust_lib_ring_buffer_config::backend -->
        <var-decl name='backend' type-id='type-id-120' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- lttng_ust_lib_ring_buffer_oops_types lttng_ust_lib_ring_buffer_config::oops -->
        <var-decl name='oops' type-id='type-id-121' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_lib_ring_buffer_ipi_types lttng_ust_lib_ring_buffer_config::ipi -->
        <var-decl name='ipi' type-id='type-id-122' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- lttng_ust_lib_ring_buffer_wakeup_types lttng_ust_lib_ring_buffer_config::wakeup -->
        <var-decl name='wakeup' type-id='type-id-123' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_config::tsc_bits -->
        <var-decl name='tsc_bits' type-id='type-id-57' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_lib_ring_buffer_client_cb lttng_ust_lib_ring_buffer_config::cb -->
        <var-decl name='cb' type-id='type-id-124' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- int lttng_ust_lib_ring_buffer_config::client_type -->
        <var-decl name='client_type' type-id='type-id-43' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <!-- int lttng_ust_lib_ring_buffer_config::_unused1 -->
        <var-decl name='_unused1' type-id='type-id-43' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- const lttng_ust_lib_ring_buffer_client_cb* lttng_ust_lib_ring_buffer_config::cb_ptr -->
        <var-decl name='cb_ptr' type-id='type-id-125' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- char lttng_ust_lib_ring_buffer_config::padding[20] -->
        <var-decl name='padding' type-id='type-id-12' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_lib_ring_buffer_alloc_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_alloc_types' filepath='../include/lttng/ringbuffer-config.h' line='145' column='1' id='type-id-116'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_ALLOC_PER_CPU' value='0'/>
      <enumerator name='RING_BUFFER_ALLOC_GLOBAL' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_sync_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_sync_types' filepath='../include/lttng/ringbuffer-config.h' line='150' column='1' id='type-id-117'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_SYNC_PER_CPU' value='0'/>
      <enumerator name='RING_BUFFER_SYNC_GLOBAL' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_mode_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_mode_types' filepath='../include/lttng/ringbuffer-config.h' line='155' column='1' id='type-id-118'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_OVERWRITE' value='0'/>
      <enumerator name='RING_BUFFER_DISCARD' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_output_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_output_types' filepath='../include/lttng/ringbuffer-config.h' line='160' column='1' id='type-id-119'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_SPLICE' value='0'/>
      <enumerator name='RING_BUFFER_MMAP' value='1'/>
      <enumerator name='RING_BUFFER_READ' value='2'/>
      <enumerator name='RING_BUFFER_ITERATOR' value='3'/>
      <enumerator name='RING_BUFFER_NONE' value='4'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_backend_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_backend_types' filepath='../include/lttng/ringbuffer-config.h' line='168' column='1' id='type-id-120'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_PAGE' value='0'/>
      <enumerator name='RING_BUFFER_VMAP' value='1'/>
      <enumerator name='RING_BUFFER_STATIC' value='2'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_oops_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_oops_types' filepath='../include/lttng/ringbuffer-config.h' line='174' column='1' id='type-id-121'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_NO_OOPS_CONSISTENCY' value='0'/>
      <enumerator name='RING_BUFFER_OOPS_CONSISTENCY' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_ipi_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_ipi_types' filepath='../include/lttng/ringbuffer-config.h' line='179' column='1' id='type-id-122'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_IPI_BARRIER' value='0'/>
      <enumerator name='RING_BUFFER_NO_IPI_BARRIER' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_lib_ring_buffer_wakeup_types -->
    <enum-decl name='lttng_ust_lib_ring_buffer_wakeup_types' filepath='../include/lttng/ringbuffer-config.h' line='184' column='1' id='type-id-123'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='RING_BUFFER_WAKEUP_BY_TIMER' value='0'/>
      <enumerator name='RING_BUFFER_WAKEUP_BY_WRITER' value='1'/>
    </enum-decl>
    <!-- struct lttng_ust_lib_ring_buffer_client_cb -->
    <class-decl name='lttng_ust_lib_ring_buffer_client_cb' size-in-bits='640' is-struct='yes' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='52' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- typedef uint64_t (channel*)* lttng_ust_lib_ring_buffer_client_cb::ring_buffer_clock_read -->
        <var-decl name='ring_buffer_clock_read' type-id='type-id-126' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- typedef size_t (const lttng_ust_lib_ring_buffer_config*, channel*, typedef size_t, size_t*, lttng_ust_lib_ring_buffer_ctx*)* lttng_ust_lib_ring_buffer_client_cb::record_header_size -->
        <var-decl name='record_header_size' type-id='type-id-127' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- typedef size_t ()* lttng_ust_lib_ring_buffer_client_cb::subbuffer_header_size -->
        <var-decl name='subbuffer_header_size' type-id='type-id-128' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (lttng_ust_lib_ring_buffer*, typedef uint64_t, unsigned int, lttng_ust_shm_handle*)* lttng_ust_lib_ring_buffer_client_cb::buffer_begin -->
        <var-decl name='buffer_begin' type-id='type-id-129' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (lttng_ust_lib_ring_buffer*, typedef uint64_t, unsigned int, unsigned long int, lttng_ust_shm_handle*)* lttng_ust_lib_ring_buffer_client_cb::buffer_end -->
        <var-decl name='buffer_end' type-id='type-id-130' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int (lttng_ust_lib_ring_buffer*, void*, int, const char*, lttng_ust_shm_handle*)* lttng_ust_lib_ring_buffer_client_cb::buffer_create -->
        <var-decl name='buffer_create' type-id='type-id-131' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (lttng_ust_lib_ring_buffer*, void*, int, lttng_ust_shm_handle*)* lttng_ust_lib_ring_buffer_client_cb::buffer_finalize -->
        <var-decl name='buffer_finalize' type-id='type-id-132' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- void (const lttng_ust_lib_ring_buffer_config*, channel*, lttng_ust_lib_ring_buffer*, typedef size_t, size_t*, size_t*, uint64_t*, lttng_ust_shm_handle*)* lttng_ust_lib_ring_buffer_client_cb::record_get -->
        <var-decl name='record_get' type-id='type-id-133' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void (const lttng_ust_lib_ring_buffer_config*, size_t*, size_t*)* lttng_ust_lib_ring_buffer_client_cb::content_size_field -->
        <var-decl name='content_size_field' type-id='type-id-134' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- void (const lttng_ust_lib_ring_buffer_config*, size_t*, size_t*)* lttng_ust_lib_ring_buffer_client_cb::packet_size_field -->
        <var-decl name='packet_size_field' type-id='type-id-134' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_lib_ring_buffer_ctx -->
    <class-decl name='lttng_ust_lib_ring_buffer_ctx' size-in-bits='960' is-struct='yes' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='232' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- channel* lttng_ust_lib_ring_buffer_ctx::chan -->
        <var-decl name='chan' type-id='type-id-104' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::priv -->
        <var-decl name='priv' type-id='type-id-112' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_shm_handle* lttng_ust_lib_ring_buffer_ctx::handle -->
        <var-decl name='handle' type-id='type-id-94' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- size_t lttng_ust_lib_ring_buffer_ctx::data_size -->
        <var-decl name='data_size' type-id='type-id-64' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_ust_lib_ring_buffer_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-43' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int lttng_ust_lib_ring_buffer_ctx::cpu -->
        <var-decl name='cpu' type-id='type-id-43' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_lib_ring_buffer* lttng_ust_lib_ring_buffer_ctx::buf -->
        <var-decl name='buf' type-id='type-id-95' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- size_t lttng_ust_lib_ring_buffer_ctx::slot_size -->
        <var-decl name='slot_size' type-id='type-id-64' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_ctx::buf_offset -->
        <var-decl name='buf_offset' type-id='type-id-3' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_ctx::pre_offset -->
        <var-decl name='pre_offset' type-id='type-id-3' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint64_t lttng_ust_lib_ring_buffer_ctx::tsc -->
        <var-decl name='tsc' type-id='type-id-82' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_ctx::rflags -->
        <var-decl name='rflags' type-id='type-id-57' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_ctx::ctx_len -->
        <var-decl name='ctx_len' type-id='type-id-57' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::ip -->
        <var-decl name='ip' type-id='type-id-112' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- void* lttng_ust_lib_ring_buffer_ctx::priv2 -->
        <var-decl name='priv2' type-id='type-id-112' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- char lttng_ust_lib_ring_buffer_ctx::padding2[4] -->
        <var-decl name='padding2' type-id='type-id-34' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- lttng_ust_lib_ring_buffer_backend_pages* lttng_ust_lib_ring_buffer_ctx::backend_pages -->
        <var-decl name='backend_pages' type-id='type-id-136' visibility='default' filepath='../include/lttng/ringbuffer-config.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_lib_ring_buffer -->
    <class-decl name='lttng_ust_lib_ring_buffer' size-in-bits='5120' is-struct='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='174' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_crash_abi lttng_ust_lib_ring_buffer::crash_abi -->
        <var-decl name='crash_abi' type-id='type-id-138' visibility='default' filepath='../libringbuffer/frontend_types.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::offset -->
        <var-decl name='offset' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- union {shm_ref _ref; commit_counters_hot* _type;} lttng_ust_lib_ring_buffer::commit_hot -->
        <var-decl name='commit_hot' type-id='type-id-140' visibility='default' filepath='../libringbuffer/frontend_types.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- long int lttng_ust_lib_ring_buffer::consumed -->
        <var-decl name='consumed' type-id='type-id-46' visibility='default' filepath='../libringbuffer/frontend_types.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- int lttng_ust_lib_ring_buffer::record_disabled -->
        <var-decl name='record_disabled' type-id='type-id-43' visibility='default' filepath='../libringbuffer/frontend_types.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::last_tsc -->
        <var-decl name='last_tsc' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- lttng_ust_lib_ring_buffer_backend lttng_ust_lib_ring_buffer::backend -->
        <var-decl name='backend' type-id='type-id-141' visibility='default' filepath='../libringbuffer/frontend_types.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <!-- union {shm_ref _ref; commit_counters_cold* _type;} lttng_ust_lib_ring_buffer::commit_cold -->
        <var-decl name='commit_cold' type-id='type-id-142' visibility='default' filepath='../libringbuffer/frontend_types.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <!-- long int lttng_ust_lib_ring_buffer::active_readers -->
        <var-decl name='active_readers' type-id='type-id-46' visibility='default' filepath='../libringbuffer/frontend_types.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::records_lost_full -->
        <var-decl name='records_lost_full' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::records_lost_wrap -->
        <var-decl name='records_lost_wrap' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::records_lost_big -->
        <var-decl name='records_lost_big' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::records_count -->
        <var-decl name='records_count' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <!-- v_atomic lttng_ust_lib_ring_buffer::records_overrun -->
        <var-decl name='records_overrun' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <!-- int lttng_ust_lib_ring_buffer::finalized -->
        <var-decl name='finalized' type-id='type-id-43' visibility='default' filepath='../libringbuffer/frontend_types.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer::get_subbuf_consumed -->
        <var-decl name='get_subbuf_consumed' type-id='type-id-3' visibility='default' filepath='../libringbuffer/frontend_types.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer::prod_snapshot -->
        <var-decl name='prod_snapshot' type-id='type-id-3' visibility='default' filepath='../libringbuffer/frontend_types.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer::cons_snapshot -->
        <var-decl name='cons_snapshot' type-id='type-id-3' visibility='default' filepath='../libringbuffer/frontend_types.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_ust_lib_ring_buffer::get_subbuf -->
        <var-decl name='get_subbuf' type-id='type-id-57' visibility='default' filepath='../libringbuffer/frontend_types.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer* _type;} lttng_ust_lib_ring_buffer::self -->
        <var-decl name='self' type-id='type-id-143' visibility='default' filepath='../libringbuffer/frontend_types.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <!-- char lttng_ust_lib_ring_buffer::padding[60] -->
        <var-decl name='padding' type-id='type-id-36' visibility='default' filepath='../libringbuffer/frontend_types.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_crash_abi -->
    <class-decl name='lttng_crash_abi' size-in-bits='992' is-struct='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='127' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint8_t lttng_crash_abi::magic[16] -->
        <var-decl name='magic' type-id='type-id-53' visibility='default' filepath='../libringbuffer/frontend_types.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint64_t lttng_crash_abi::mmap_length -->
        <var-decl name='mmap_length' type-id='type-id-82' visibility='default' filepath='../libringbuffer/frontend_types.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint16_t lttng_crash_abi::endian -->
        <var-decl name='endian' type-id='type-id-79' visibility='default' filepath='../libringbuffer/frontend_types.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <!-- uint16_t lttng_crash_abi::major -->
        <var-decl name='major' type-id='type-id-79' visibility='default' filepath='../libringbuffer/frontend_types.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint16_t lttng_crash_abi::minor -->
        <var-decl name='minor' type-id='type-id-79' visibility='default' filepath='../libringbuffer/frontend_types.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <!-- uint8_t lttng_crash_abi::word_size -->
        <var-decl name='word_size' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <!-- uint8_t lttng_crash_abi::layout_type -->
        <var-decl name='layout_type' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- struct {uint32_t prod_offset; uint32_t consumed_offset; uint32_t commit_hot_array; uint32_t commit_hot_seq; uint32_t buf_wsb_array; uint32_t buf_wsb_id; uint32_t sb_array; uint32_t sb_array_shmp_offset; uint32_t sb_backend_p_offset; uint32_t content_size; uint32_t packet_size;} lttng_crash_abi::offset -->
        <var-decl name='offset' type-id='type-id-144' visibility='default' filepath='../libringbuffer/frontend_types.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- struct {uint8_t prod_offset; uint8_t consumed_offset; uint8_t commit_hot_seq; uint8_t buf_wsb_id; uint8_t sb_array_shmp_offset; uint8_t sb_backend_p_offset; uint8_t content_size; uint8_t packet_size;} lttng_crash_abi::length -->
        <var-decl name='length' type-id='type-id-145' visibility='default' filepath='../libringbuffer/frontend_types.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- struct {uint32_t commit_hot_array; uint32_t buf_wsb_array; uint32_t sb_array;} lttng_crash_abi::stride -->
        <var-decl name='stride' type-id='type-id-146' visibility='default' filepath='../libringbuffer/frontend_types.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- uint64_t lttng_crash_abi::buf_size -->
        <var-decl name='buf_size' type-id='type-id-82' visibility='default' filepath='../libringbuffer/frontend_types.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- uint64_t lttng_crash_abi::subbuf_size -->
        <var-decl name='subbuf_size' type-id='type-id-82' visibility='default' filepath='../libringbuffer/frontend_types.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- uint64_t lttng_crash_abi::num_subbuf -->
        <var-decl name='num_subbuf' type-id='type-id-82' visibility='default' filepath='../libringbuffer/frontend_types.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- uint32_t lttng_crash_abi::mode -->
        <var-decl name='mode' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t prod_offset; uint32_t consumed_offset; uint32_t commit_hot_array; uint32_t commit_hot_seq; uint32_t buf_wsb_array; uint32_t buf_wsb_id; uint32_t sb_array; uint32_t sb_array_shmp_offset; uint32_t sb_backend_p_offset; uint32_t content_size; uint32_t packet_size;} -->
    <class-decl name='__anonymous_struct__7' size-in-bits='352' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='139' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t prod_offset -->
        <var-decl name='prod_offset' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t consumed_offset -->
        <var-decl name='consumed_offset' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t commit_hot_array -->
        <var-decl name='commit_hot_array' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t commit_hot_seq -->
        <var-decl name='commit_hot_seq' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t buf_wsb_array -->
        <var-decl name='buf_wsb_array' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t buf_wsb_id -->
        <var-decl name='buf_wsb_id' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t sb_array -->
        <var-decl name='sb_array' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t sb_array_shmp_offset -->
        <var-decl name='sb_array_shmp_offset' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t sb_backend_p_offset -->
        <var-decl name='sb_backend_p_offset' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t content_size -->
        <var-decl name='content_size' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t packet_size -->
        <var-decl name='packet_size' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint8_t prod_offset; uint8_t consumed_offset; uint8_t commit_hot_seq; uint8_t buf_wsb_id; uint8_t sb_array_shmp_offset; uint8_t sb_backend_p_offset; uint8_t content_size; uint8_t packet_size;} -->
    <class-decl name='__anonymous_struct__8' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='152' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint8_t prod_offset -->
        <var-decl name='prod_offset' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <!-- uint8_t consumed_offset -->
        <var-decl name='consumed_offset' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- uint8_t commit_hot_seq -->
        <var-decl name='commit_hot_seq' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <!-- uint8_t buf_wsb_id -->
        <var-decl name='buf_wsb_id' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint8_t sb_array_shmp_offset -->
        <var-decl name='sb_array_shmp_offset' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <!-- uint8_t sb_backend_p_offset -->
        <var-decl name='sb_backend_p_offset' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- uint8_t content_size -->
        <var-decl name='content_size' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <!-- uint8_t packet_size -->
        <var-decl name='packet_size' type-id='type-id-52' visibility='default' filepath='../libringbuffer/frontend_types.h' line='160' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t commit_hot_array; uint32_t buf_wsb_array; uint32_t sb_array;} -->
    <class-decl name='__anonymous_struct__9' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='162' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t commit_hot_array -->
        <var-decl name='commit_hot_array' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t buf_wsb_array -->
        <var-decl name='buf_wsb_array' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t sb_array -->
        <var-decl name='sb_array' type-id='type-id-62' visibility='default' filepath='../libringbuffer/frontend_types.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <!-- union v_atomic -->
    <union-decl name='v_atomic' size-in-bits='64' visibility='default' filepath='../libringbuffer/vatomic.h' line='39' column='1' id='type-id-139'>
      <data-member access='private'>
        <!-- long int v_atomic::a -->
        <var-decl name='a' type-id='type-id-46' visibility='default' filepath='../libringbuffer/vatomic.h' line='40' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long int v_atomic::v -->
        <var-decl name='v' type-id='type-id-46' visibility='default' filepath='../libringbuffer/vatomic.h' line='41' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; commit_counters_hot* _type;} -->
    <union-decl name='__anonymous_union__5' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='181' column='1' id='type-id-140'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/frontend_types.h' line='181' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- commit_counters_hot* _type -->
        <var-decl name='_type' type-id='type-id-147' visibility='default' filepath='../libringbuffer/frontend_types.h' line='181' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct commit_counters_hot -->
    <class-decl name='commit_counters_hot' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='83' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- v_atomic commit_counters_hot::cc -->
        <var-decl name='cc' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- v_atomic commit_counters_hot::seq -->
        <var-decl name='seq' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char commit_counters_hot::padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../libringbuffer/frontend_types.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_lib_ring_buffer_backend -->
    <class-decl name='lttng_ust_lib_ring_buffer_backend' size-in-bits='1408' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='66' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_subbuffer* _type;} lttng_ust_lib_ring_buffer_backend::buf_wsb -->
        <var-decl name='buf_wsb' type-id='type-id-149' visibility='default' filepath='../libringbuffer/backend_types.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_lib_ring_buffer_backend_subbuffer lttng_ust_lib_ring_buffer_backend::buf_rsb -->
        <var-decl name='buf_rsb' type-id='type-id-150' visibility='default' filepath='../libringbuffer/backend_types.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_counts* _type;} lttng_ust_lib_ring_buffer_backend::buf_cnt -->
        <var-decl name='buf_cnt' type-id='type-id-151' visibility='default' filepath='../libringbuffer/backend_types.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_pages_shmp* _type;} lttng_ust_lib_ring_buffer_backend::array -->
        <var-decl name='array' type-id='type-id-152' visibility='default' filepath='../libringbuffer/backend_types.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- union {shm_ref _ref; char* _type;} lttng_ust_lib_ring_buffer_backend::memory_map -->
        <var-decl name='memory_map' type-id='type-id-153' visibility='default' filepath='../libringbuffer/backend_types.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- union {shm_ref _ref; channel* _type;} lttng_ust_lib_ring_buffer_backend::chan -->
        <var-decl name='chan' type-id='type-id-154' visibility='default' filepath='../libringbuffer/backend_types.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int lttng_ust_lib_ring_buffer_backend::cpu -->
        <var-decl name='cpu' type-id='type-id-43' visibility='default' filepath='../libringbuffer/backend_types.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- v_atomic lttng_ust_lib_ring_buffer_backend::records_read -->
        <var-decl name='records_read' type-id='type-id-139' visibility='default' filepath='../libringbuffer/backend_types.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_ust_lib_ring_buffer_backend::allocated -->
        <var-decl name='allocated' type-id='type-id-57' visibility='default' filepath='../libringbuffer/backend_types.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <!-- char lttng_ust_lib_ring_buffer_backend::padding[64] -->
        <var-decl name='padding' type-id='type-id-38' visibility='default' filepath='../libringbuffer/backend_types.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_subbuffer* _type;} -->
    <union-decl name='__anonymous_union__6' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='68' column='1' id='type-id-149'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='68' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_lib_ring_buffer_backend_subbuffer* _type -->
        <var-decl name='_type' type-id='type-id-155' visibility='default' filepath='../libringbuffer/backend_types.h' line='68' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_lib_ring_buffer_backend_subbuffer -->
    <class-decl name='lttng_ust_lib_ring_buffer_backend_subbuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='40' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_backend_subbuffer::id -->
        <var-decl name='id' type-id='type-id-3' visibility='default' filepath='../libringbuffer/backend_types.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_counts* _type;} -->
    <union-decl name='__anonymous_union__7' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='72' column='1' id='type-id-151'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='72' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_lib_ring_buffer_backend_counts* _type -->
        <var-decl name='_type' type-id='type-id-156' visibility='default' filepath='../libringbuffer/backend_types.h' line='72' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_lib_ring_buffer_backend_counts -->
    <class-decl name='lttng_ust_lib_ring_buffer_backend_counts' size-in-bits='64' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='45' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_lib_ring_buffer_backend_counts::seq_cnt -->
        <var-decl name='seq_cnt' type-id='type-id-82' visibility='default' filepath='../libringbuffer/backend_types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_pages_shmp* _type;} -->
    <union-decl name='__anonymous_union__8' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='77' column='1' id='type-id-152'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_lib_ring_buffer_backend_pages_shmp* _type -->
        <var-decl name='_type' type-id='type-id-158' visibility='default' filepath='../libringbuffer/backend_types.h' line='77' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_lib_ring_buffer_backend_pages_shmp -->
    <class-decl name='lttng_ust_lib_ring_buffer_backend_pages_shmp' size-in-bits='128' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='61' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_pages* _type;} lttng_ust_lib_ring_buffer_backend_pages_shmp::shmp -->
        <var-decl name='shmp' type-id='type-id-160' visibility='default' filepath='../libringbuffer/backend_types.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer_backend_pages* _type;} -->
    <union-decl name='__anonymous_union__9' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='62' column='1' id='type-id-160'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='62' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_lib_ring_buffer_backend_pages* _type -->
        <var-decl name='_type' type-id='type-id-136' visibility='default' filepath='../libringbuffer/backend_types.h' line='62' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_lib_ring_buffer_backend_pages -->
    <class-decl name='lttng_ust_lib_ring_buffer_backend_pages' size-in-bits='512' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='31' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_backend_pages::mmap_offset -->
        <var-decl name='mmap_offset' type-id='type-id-3' visibility='default' filepath='../libringbuffer/backend_types.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- v_atomic lttng_ust_lib_ring_buffer_backend_pages::records_commit -->
        <var-decl name='records_commit' type-id='type-id-139' visibility='default' filepath='../libringbuffer/backend_types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- v_atomic lttng_ust_lib_ring_buffer_backend_pages::records_unread -->
        <var-decl name='records_unread' type-id='type-id-139' visibility='default' filepath='../libringbuffer/backend_types.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned long int lttng_ust_lib_ring_buffer_backend_pages::data_size -->
        <var-decl name='data_size' type-id='type-id-3' visibility='default' filepath='../libringbuffer/backend_types.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- union {shm_ref _ref; char* _type;} lttng_ust_lib_ring_buffer_backend_pages::p -->
        <var-decl name='p' type-id='type-id-162' visibility='default' filepath='../libringbuffer/backend_types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_lib_ring_buffer_backend_pages::padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../libringbuffer/backend_types.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; char* _type;} -->
    <union-decl name='__anonymous_union__10' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='36' column='1' id='type-id-162'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='36' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char* _type -->
        <var-decl name='_type' type-id='type-id-102' visibility='default' filepath='../libringbuffer/backend_types.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; char* _type;} -->
    <union-decl name='__anonymous_union__11' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='78' column='1' id='type-id-153'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char* _type -->
        <var-decl name='_type' type-id='type-id-102' visibility='default' filepath='../libringbuffer/backend_types.h' line='78' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; channel* _type;} -->
    <union-decl name='__anonymous_union__12' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='80' column='1' id='type-id-154'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='80' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- channel* _type -->
        <var-decl name='_type' type-id='type-id-104' visibility='default' filepath='../libringbuffer/backend_types.h' line='80' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; commit_counters_cold* _type;} -->
    <union-decl name='__anonymous_union__13' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='197' column='1' id='type-id-142'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/frontend_types.h' line='197' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- commit_counters_cold* _type -->
        <var-decl name='_type' type-id='type-id-163' visibility='default' filepath='../libringbuffer/frontend_types.h' line='197' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct commit_counters_cold -->
    <class-decl name='commit_counters_cold' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='91' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- v_atomic commit_counters_cold::cc_sb -->
        <var-decl name='cc_sb' type-id='type-id-139' visibility='default' filepath='../libringbuffer/frontend_types.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char commit_counters_cold::padding[24] -->
        <var-decl name='padding' type-id='type-id-14' visibility='default' filepath='../libringbuffer/frontend_types.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer* _type;} -->
    <union-decl name='__anonymous_union__14' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/frontend_types.h' line='216' column='1' id='type-id-143'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/frontend_types.h' line='216' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_lib_ring_buffer* _type -->
        <var-decl name='_type' type-id='type-id-95' visibility='default' filepath='../libringbuffer/frontend_types.h' line='216' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_lib_ring_buffer_shmp -->
    <class-decl name='lttng_ust_lib_ring_buffer_shmp' size-in-bits='128' is-struct='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='87' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer* _type;} lttng_ust_lib_ring_buffer_shmp::shmp -->
        <var-decl name='shmp' type-id='type-id-165' visibility='default' filepath='../libringbuffer/backend_types.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_lib_ring_buffer* _type;} -->
    <union-decl name='__anonymous_union__15' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../libringbuffer/backend_types.h' line='88' column='1' id='type-id-165'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-103' visibility='default' filepath='../libringbuffer/backend_types.h' line='88' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_lib_ring_buffer* _type -->
        <var-decl name='_type' type-id='type-id-95' visibility='default' filepath='../libringbuffer/backend_types.h' line='88' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct ustctl_consumer_channel -->
    <class-decl name='ustctl_consumer_channel' size-in-bits='576' is-struct='yes' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='48' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_channel* ustctl_consumer_channel::chan -->
        <var-decl name='chan' type-id='type-id-167' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- ustctl_consumer_channel_attr ustctl_consumer_channel::attr -->
        <var-decl name='attr' type-id='type-id-168' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int ustctl_consumer_channel::wait_fd -->
        <var-decl name='wait_fd' type-id='type-id-43' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- int ustctl_consumer_channel::wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-43' visibility='default' filepath='liblttng-ust-ctl/ustctl.c' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_channel -->
    <class-decl name='lttng_channel' size-in-bits='960' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='525' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- channel* lttng_channel::chan -->
        <var-decl name='chan' type-id='type-id-104' visibility='default' filepath='../include/lttng/ust-events.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_channel::enabled -->
        <var-decl name='enabled' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ctx* lttng_channel::ctx -->
        <var-decl name='ctx' type-id='type-id-170' visibility='default' filepath='../include/lttng/ust-events.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_session* lttng_channel::session -->
        <var-decl name='session' type-id='type-id-171' visibility='default' filepath='../include/lttng/ust-events.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_channel::objd -->
        <var-decl name='objd' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- unsigned int lttng_channel::_deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned int lttng_channel::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- cds_list_head lttng_channel::node -->
        <var-decl name='node' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- const lttng_channel_ops* lttng_channel::ops -->
        <var-decl name='ops' type-id='type-id-173' visibility='default' filepath='../include/lttng/ust-events.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int lttng_channel::header_type -->
        <var-decl name='header_type' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- lttng_ust_shm_handle* lttng_channel::handle -->
        <var-decl name='handle' type-id='type-id-94' visibility='default' filepath='../include/lttng/ust-events.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_channel::_deprecated3 -->
        <var-decl name='_deprecated3' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- unsigned int lttng_channel::id -->
        <var-decl name='id' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- lttng_ust_chan_type lttng_channel::type -->
        <var-decl name='type' type-id='type-id-174' visibility='default' filepath='../include/lttng/ust-events.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <!-- unsigned char lttng_channel::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-56' visibility='default' filepath='../include/lttng/ust-events.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_channel::tstate -->
        <var-decl name='tstate' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='550' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ctx -->
    <class-decl name='lttng_ctx' size-in-bits='320' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='304' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ctx_field* lttng_ctx::fields -->
        <var-decl name='fields' type-id='type-id-176' visibility='default' filepath='../include/lttng/ust-events.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int lttng_ctx::nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int lttng_ctx::allocated_fields -->
        <var-decl name='allocated_fields' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int lttng_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- char lttng_ctx::padding[20] -->
        <var-decl name='padding' type-id='type-id-12' visibility='default' filepath='../include/lttng/ust-events.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ctx_field -->
    <class-decl name='lttng_ctx_field' size-in-bits='3200' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='287' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_event_field lttng_ctx_field::event_field -->
        <var-decl name='event_field' type-id='type-id-178' visibility='default' filepath='../include/lttng/ust-events.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <!-- typedef size_t (lttng_ctx_field*, typedef size_t)* lttng_ctx_field::get_size -->
        <var-decl name='get_size' type-id='type-id-179' visibility='default' filepath='../include/lttng/ust-events.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)* lttng_ctx_field::record -->
        <var-decl name='record' type-id='type-id-180' visibility='default' filepath='../include/lttng/ust-events.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <!-- void (lttng_ctx_field*, lttng_ctx_value*)* lttng_ctx_field::get_value -->
        <var-decl name='get_value' type-id='type-id-181' visibility='default' filepath='../include/lttng/ust-events.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <!-- union {lttng_perf_counter_field* perf_counter; char padding[40];} lttng_ctx_field::u -->
        <var-decl name='u' type-id='type-id-182' visibility='default' filepath='../include/lttng/ust-events.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <!-- void (lttng_ctx_field*)* lttng_ctx_field::destroy -->
        <var-decl name='destroy' type-id='type-id-183' visibility='default' filepath='../include/lttng/ust-events.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <!-- char* lttng_ctx_field::field_name -->
        <var-decl name='field_name' type-id='type-id-102' visibility='default' filepath='../include/lttng/ust-events.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_event_field -->
    <class-decl name='lttng_event_field' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='252' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_event_field::name -->
        <var-decl name='name' type-id='type-id-184' visibility='default' filepath='../include/lttng/ust-events.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_type lttng_event_field::type -->
        <var-decl name='type' type-id='type-id-185' visibility='default' filepath='../include/lttng/ust-events.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <!-- unsigned int lttng_event_field::nowrite -->
        <var-decl name='nowrite' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <!-- char lttng_event_field::padding[28] -->
        <var-decl name='padding' type-id='type-id-26' visibility='default' filepath='../include/lttng/ust-events.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_type -->
    <class-decl name='lttng_type' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='215' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_abstract_types lttng_type::atype -->
        <var-decl name='atype' type-id='type-id-186' visibility='default' filepath='../include/lttng/ust-events.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {_lttng_basic_type basic; struct {lttng_basic_type elem_type; unsigned int length;} array; struct {lttng_basic_type length_type; lttng_basic_type elem_type;} sequence; struct {uint32_t nr_fields; lttng_event_field* fields;} _struct; char padding[128];} lttng_type::u -->
        <var-decl name='u' type-id='type-id-187' visibility='default' filepath='../include/lttng/ust-events.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_abstract_types -->
    <enum-decl name='lttng_abstract_types' filepath='../include/lttng/ust-events.h' line='84' column='1' id='type-id-186'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='atype_integer' value='0'/>
      <enumerator name='atype_enum' value='1'/>
      <enumerator name='atype_array' value='2'/>
      <enumerator name='atype_sequence' value='3'/>
      <enumerator name='atype_string' value='4'/>
      <enumerator name='atype_float' value='5'/>
      <enumerator name='atype_dynamic' value='6'/>
      <enumerator name='atype_struct' value='7'/>
      <enumerator name='NR_ABSTRACT_TYPES' value='8'/>
    </enum-decl>
    <!-- union {_lttng_basic_type basic; struct {lttng_basic_type elem_type; unsigned int length;} array; struct {lttng_basic_type length_type; lttng_basic_type elem_type;} sequence; struct {uint32_t nr_fields; lttng_event_field* fields;} _struct; char padding[128];} -->
    <union-decl name='__anonymous_union__16' size-in-bits='2176' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='217' column='1' id='type-id-187'>
      <data-member access='private'>
        <!-- _lttng_basic_type basic -->
        <var-decl name='basic' type-id='type-id-188' visibility='default' filepath='../include/lttng/ust-events.h' line='218' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_basic_type elem_type; unsigned int length;} array -->
        <var-decl name='array' type-id='type-id-189' visibility='default' filepath='../include/lttng/ust-events.h' line='222' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_basic_type length_type; lttng_basic_type elem_type;} sequence -->
        <var-decl name='sequence' type-id='type-id-190' visibility='default' filepath='../include/lttng/ust-events.h' line='226' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_fields; lttng_event_field* fields;} _struct -->
        <var-decl name='_struct' type-id='type-id-191' visibility='default' filepath='../include/lttng/ust-events.h' line='230' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[128] -->
        <var-decl name='padding' type-id='type-id-6' visibility='default' filepath='../include/lttng/ust-events.h' line='231' column='1'/>
      </data-member>
    </union-decl>
    <!-- union _lttng_basic_type -->
    <union-decl name='_lttng_basic_type' size-in-bits='1024' visibility='default' filepath='../include/lttng/ust-events.h' line='194' column='1' id='type-id-188'>
      <data-member access='private'>
        <!-- lttng_integer_type _lttng_basic_type::integer -->
        <var-decl name='integer' type-id='type-id-192' visibility='default' filepath='../include/lttng/ust-events.h' line='195' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {const lttng_enum_desc* desc; lttng_integer_type container_type;} _lttng_basic_type::enumeration -->
        <var-decl name='enumeration' type-id='type-id-193' visibility='default' filepath='../include/lttng/ust-events.h' line='199' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_string_encodings encoding;} _lttng_basic_type::string -->
        <var-decl name='string' type-id='type-id-194' visibility='default' filepath='../include/lttng/ust-events.h' line='202' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_float_type _lttng_basic_type::_float -->
        <var-decl name='_float' type-id='type-id-195' visibility='default' filepath='../include/lttng/ust-events.h' line='203' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char _lttng_basic_type::padding[128] -->
        <var-decl name='padding' type-id='type-id-6' visibility='default' filepath='../include/lttng/ust-events.h' line='204' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_integer_type -->
    <class-decl name='lttng_integer_type' size-in-bits='320' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='146' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int lttng_integer_type::size -->
        <var-decl name='size' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned short int lttng_integer_type::alignment -->
        <var-decl name='alignment' type-id='type-id-58' visibility='default' filepath='../include/lttng/ust-events.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <!-- unsigned int lttng_integer_type::signedness -->
        <var-decl name='signedness' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <!-- unsigned int lttng_integer_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int lttng_integer_type::base -->
        <var-decl name='base' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- lttng_string_encodings lttng_integer_type::encoding -->
        <var-decl name='encoding' type-id='type-id-196' visibility='default' filepath='../include/lttng/ust-events.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_integer_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-14' visibility='default' filepath='../include/lttng/ust-events.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_string_encodings -->
    <enum-decl name='lttng_string_encodings' filepath='../include/lttng/ust-events.h' line='97' column='1' id='type-id-196'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='lttng_encode_none' value='0'/>
      <enumerator name='lttng_encode_UTF8' value='1'/>
      <enumerator name='lttng_encode_ASCII' value='2'/>
      <enumerator name='NR_STRING_ENCODINGS' value='3'/>
    </enum-decl>
    <!-- struct {const lttng_enum_desc* desc; lttng_integer_type container_type;} -->
    <class-decl name='__anonymous_struct__10' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='196' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const lttng_enum_desc* desc -->
        <var-decl name='desc' type-id='type-id-197' visibility='default' filepath='../include/lttng/ust-events.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_integer_type container_type -->
        <var-decl name='container_type' type-id='type-id-192' visibility='default' filepath='../include/lttng/ust-events.h' line='198' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enum_desc -->
    <class-decl name='lttng_enum_desc' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='236' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_enum_desc::name -->
        <var-decl name='name' type-id='type-id-184' visibility='default' filepath='../include/lttng/ust-events.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const lttng_enum_entry* lttng_enum_desc::entries -->
        <var-decl name='entries' type-id='type-id-199' visibility='default' filepath='../include/lttng/ust-events.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int lttng_enum_desc::nr_entries -->
        <var-decl name='nr_entries' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- char lttng_enum_desc::padding[24] -->
        <var-decl name='padding' type-id='type-id-14' visibility='default' filepath='../include/lttng/ust-events.h' line='240' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enum_entry -->
    <class-decl name='lttng_enum_entry' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='114' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_enum_value lttng_enum_entry::start -->
        <var-decl name='start' type-id='type-id-201' visibility='default' filepath='../include/lttng/ust-events.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_enum_value lttng_enum_entry::end -->
        <var-decl name='end' type-id='type-id-201' visibility='default' filepath='../include/lttng/ust-events.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const char* lttng_enum_entry::string -->
        <var-decl name='string' type-id='type-id-184' visibility='default' filepath='../include/lttng/ust-events.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {struct {unsigned int options;} extra; char padding[16];} lttng_enum_entry::u -->
        <var-decl name='u' type-id='type-id-202' visibility='default' filepath='../include/lttng/ust-events.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_enum_value -->
    <class-decl name='lttng_enum_value' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='104' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long long unsigned int lttng_enum_value::value -->
        <var-decl name='value' type-id='type-id-47' visibility='default' filepath='../include/lttng/ust-events.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_enum_value::signedness -->
        <var-decl name='signedness' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {unsigned int options;} extra; char padding[16];} -->
    <union-decl name='__anonymous_union__17' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='117' column='1' id='type-id-202'>
      <data-member access='private'>
        <!-- struct {unsigned int options;} extra -->
        <var-decl name='extra' type-id='type-id-203' visibility='default' filepath='../include/lttng/ust-events.h' line='120' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../include/lttng/ust-events.h' line='121' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {unsigned int options;} -->
    <class-decl name='__anonymous_struct__11' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='118' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int options -->
        <var-decl name='options' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {lttng_string_encodings encoding;} -->
    <class-decl name='__anonymous_struct__12' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='200' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_string_encodings encoding -->
        <var-decl name='encoding' type-id='type-id-196' visibility='default' filepath='../include/lttng/ust-events.h' line='201' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_float_type -->
    <class-decl name='lttng_float_type' size-in-bits='288' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='185' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int lttng_float_type::exp_dig -->
        <var-decl name='exp_dig' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int lttng_float_type::mant_dig -->
        <var-decl name='mant_dig' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned short int lttng_float_type::alignment -->
        <var-decl name='alignment' type-id='type-id-58' visibility='default' filepath='../include/lttng/ust-events.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <!-- unsigned int lttng_float_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <!-- char lttng_float_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-14' visibility='default' filepath='../include/lttng/ust-events.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {lttng_basic_type elem_type; unsigned int length;} -->
    <class-decl name='__anonymous_struct__13' size-in-bits='1152' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='219' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-204' visibility='default' filepath='../include/lttng/ust-events.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- unsigned int length -->
        <var-decl name='length' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='221' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_basic_type -->
    <class-decl name='lttng_basic_type' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='207' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_abstract_types lttng_basic_type::atype -->
        <var-decl name='atype' type-id='type-id-186' visibility='default' filepath='../include/lttng/ust-events.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {_lttng_basic_type basic;} lttng_basic_type::u -->
        <var-decl name='u' type-id='type-id-205' visibility='default' filepath='../include/lttng/ust-events.h' line='211' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {_lttng_basic_type basic;} -->
    <union-decl name='__anonymous_union__18' size-in-bits='1024' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='209' column='1' id='type-id-205'>
      <data-member access='private'>
        <!-- _lttng_basic_type basic -->
        <var-decl name='basic' type-id='type-id-188' visibility='default' filepath='../include/lttng/ust-events.h' line='210' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {lttng_basic_type length_type; lttng_basic_type elem_type;} -->
    <class-decl name='__anonymous_struct__14' size-in-bits='2176' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='223' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_basic_type length_type -->
        <var-decl name='length_type' type-id='type-id-204' visibility='default' filepath='../include/lttng/ust-events.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- lttng_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-204' visibility='default' filepath='../include/lttng/ust-events.h' line='225' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_fields; lttng_event_field* fields;} -->
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='227' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-events.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_event_field* fields -->
        <var-decl name='fields' type-id='type-id-206' visibility='default' filepath='../include/lttng/ust-events.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ctx_value -->
    <class-decl name='lttng_ctx_value' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='275' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_dynamic_type lttng_ctx_value::sel -->
        <var-decl name='sel' type-id='type-id-208' visibility='default' filepath='../include/lttng/ust-events.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {int64_t s64; const char* str; double d;} lttng_ctx_value::u -->
        <var-decl name='u' type-id='type-id-209' visibility='default' filepath='../include/lttng/ust-events.h' line='281' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_dynamic_type -->
    <enum-decl name='lttng_ust_dynamic_type' filepath='../include/lttng/ust-events.h' line='259' column='1' id='type-id-208'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_NONE' value='0'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S8' value='1'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S16' value='2'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S32' value='3'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S64' value='4'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U8' value='5'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U16' value='6'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U32' value='7'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U64' value='8'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_FLOAT' value='9'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_DOUBLE' value='10'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_STRING' value='11'/>
      <enumerator name='_NR_LTTNG_UST_DYNAMIC_TYPES' value='12'/>
    </enum-decl>
    <!-- union {int64_t s64; const char* str; double d;} -->
    <union-decl name='__anonymous_union__19' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='277' column='1' id='type-id-209'>
      <data-member access='private'>
        <!-- int64_t s64 -->
        <var-decl name='s64' type-id='type-id-210' visibility='default' filepath='../include/lttng/ust-events.h' line='278' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- const char* str -->
        <var-decl name='str' type-id='type-id-184' visibility='default' filepath='../include/lttng/ust-events.h' line='279' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- double d -->
        <var-decl name='d' type-id='type-id-42' visibility='default' filepath='../include/lttng/ust-events.h' line='280' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef __int64_t int64_t -->
    <typedef-decl name='int64_t' type-id='type-id-211' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-210'/>
    <!-- typedef long int __int64_t -->
    <typedef-decl name='__int64_t' type-id='type-id-46' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-211'/>
    <!-- union {lttng_perf_counter_field* perf_counter; char padding[40];} -->
    <union-decl name='__anonymous_union__20' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='295' column='1' id='type-id-182'>
      <data-member access='private'>
        <!-- lttng_perf_counter_field* perf_counter -->
        <var-decl name='perf_counter' type-id='type-id-212' visibility='default' filepath='../include/lttng/ust-events.h' line='296' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[40] -->
        <var-decl name='padding' type-id='type-id-32' visibility='default' filepath='../include/lttng/ust-events.h' line='297' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_session -->
    <class-decl name='lttng_session' size-in-bits='525504' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='580' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int lttng_session::active -->
        <var-decl name='active' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int lttng_session::been_active -->
        <var-decl name='been_active' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_session::objd -->
        <var-decl name='objd' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* lttng_session::_deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-112' visibility='default' filepath='../include/lttng/ust-events.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_session::chan_head -->
        <var-decl name='chan_head' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- cds_list_head lttng_session::events_head -->
        <var-decl name='events_head' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- cds_list_head lttng_session::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- cds_list_head lttng_session::node -->
        <var-decl name='node' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int lttng_session::_deprecated3 -->
        <var-decl name='_deprecated3' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_session::_deprecated4 -->
        <var-decl name='_deprecated4' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-events.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- cds_list_head lttng_session::enablers_head -->
        <var-decl name='enablers_head' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- lttng_ust_event_ht lttng_session::events_ht -->
        <var-decl name='events_ht' type-id='type-id-214' visibility='default' filepath='../include/lttng/ust-events.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='263040'>
        <!-- void* lttng_session::owner -->
        <var-decl name='owner' type-id='type-id-112' visibility='default' filepath='../include/lttng/ust-events.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_session::tstate -->
        <var-decl name='tstate' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <!-- int lttng_session::statedump_pending -->
        <var-decl name='statedump_pending' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-events.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='263168'>
        <!-- lttng_ust_enum_ht lttng_session::enums_ht -->
        <var-decl name='enums_ht' type-id='type-id-215' visibility='default' filepath='../include/lttng/ust-events.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525312'>
        <!-- cds_list_head lttng_session::enums_head -->
        <var-decl name='enums_head' type-id='type-id-172' visibility='default' filepath='../include/lttng/ust-events.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525440'>
        <!-- lttng_ctx* lttng_session::ctx -->
        <var-decl name='ctx' type-id='type-id-170' visibility='default' filepath='../include/lttng/ust-events.h' line='605' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_list_head -->
    <class-decl name='cds_list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/urcu/list.h' line='35' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head* cds_list_head::next -->
        <var-decl name='next' type-id='type-id-216' visibility='default' filepath='/usr/include/urcu/list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head* cds_list_head::prev -->
        <var-decl name='prev' type-id='type-id-216' visibility='default' filepath='/usr/include/urcu/list.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_ht -->
    <class-decl name='lttng_ust_event_ht' size-in-bits='262144' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='564' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_head lttng_ust_event_ht::table[4096] -->
        <var-decl name='table' type-id='type-id-2' visibility='default' filepath='../include/lttng/ust-events.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_hlist_head -->
    <class-decl name='cds_hlist_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/urcu/hlist.h' line='21' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_node* cds_hlist_head::next -->
        <var-decl name='next' type-id='type-id-217' visibility='default' filepath='/usr/include/urcu/hlist.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_hlist_node -->
    <class-decl name='cds_hlist_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/urcu/hlist.h' line='25' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_node* cds_hlist_node::next -->
        <var-decl name='next' type-id='type-id-217' visibility='default' filepath='/usr/include/urcu/hlist.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_hlist_node* cds_hlist_node::prev -->
        <var-decl name='prev' type-id='type-id-217' visibility='default' filepath='/usr/include/urcu/hlist.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_enum_ht -->
    <class-decl name='lttng_ust_enum_ht' size-in-bits='262144' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='571' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_head lttng_ust_enum_ht::table[4096] -->
        <var-decl name='table' type-id='type-id-2' visibility='default' filepath='../include/lttng/ust-events.h' line='572' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_channel_ops -->
    <class-decl name='lttng_channel_ops' size-in-bits='768' is-struct='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='484' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_channel* (const char*, void*, typedef size_t, typedef size_t, unsigned int, unsigned int, unsigned char*, typedef uint32_t, const int*, int)* lttng_channel_ops::channel_create -->
        <var-decl name='channel_create' type-id='type-id-220' visibility='default' filepath='../include/lttng/ust-events.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (lttng_channel*)* lttng_channel_ops::channel_destroy -->
        <var-decl name='channel_destroy' type-id='type-id-221' visibility='default' filepath='../include/lttng/ust-events.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- union {void* _deprecated1; unsigned long int has_strcpy;} lttng_channel_ops::u -->
        <var-decl name='u' type-id='type-id-222' visibility='default' filepath='../include/lttng/ust-events.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* lttng_channel_ops::_deprecated2 -->
        <var-decl name='_deprecated2' type-id='type-id-112' visibility='default' filepath='../include/lttng/ust-events.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int (lttng_ust_lib_ring_buffer_ctx*, typedef uint32_t)* lttng_channel_ops::event_reserve -->
        <var-decl name='event_reserve' type-id='type-id-223' visibility='default' filepath='../include/lttng/ust-events.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void (lttng_ust_lib_ring_buffer_ctx*)* lttng_channel_ops::event_commit -->
        <var-decl name='event_commit' type-id='type-id-224' visibility='default' filepath='../include/lttng/ust-events.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (lttng_ust_lib_ring_buffer_ctx*, void*, typedef size_t)* lttng_channel_ops::event_write -->
        <var-decl name='event_write' type-id='type-id-225' visibility='default' filepath='../include/lttng/ust-events.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- typedef size_t (channel*, lttng_ust_shm_handle*)* lttng_channel_ops::packet_avail_size -->
        <var-decl name='packet_avail_size' type-id='type-id-226' visibility='default' filepath='../include/lttng/ust-events.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int (channel*)* lttng_channel_ops::is_finalized -->
        <var-decl name='is_finalized' type-id='type-id-227' visibility='default' filepath='../include/lttng/ust-events.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int (channel*)* lttng_channel_ops::is_disabled -->
        <var-decl name='is_disabled' type-id='type-id-227' visibility='default' filepath='../include/lttng/ust-events.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int (channel*, lttng_ust_shm_handle*)* lttng_channel_ops::flush_buffer -->
        <var-decl name='flush_buffer' type-id='type-id-228' visibility='default' filepath='../include/lttng/ust-events.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void (lttng_ust_lib_ring_buffer_ctx*, const char*, typedef size_t)* lttng_channel_ops::event_strcpy -->
        <var-decl name='event_strcpy' type-id='type-id-229' visibility='default' filepath='../include/lttng/ust-events.h' line='516' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {void* _deprecated1; unsigned long int has_strcpy;} -->
    <union-decl name='__anonymous_union__21' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-events.h' line='494' column='1' id='type-id-222'>
      <data-member access='private'>
        <!-- void* _deprecated1 -->
        <var-decl name='_deprecated1' type-id='type-id-112' visibility='default' filepath='../include/lttng/ust-events.h' line='495' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- unsigned long int has_strcpy -->
        <var-decl name='has_strcpy' type-id='type-id-3' visibility='default' filepath='../include/lttng/ust-events.h' line='496' column='1'/>
      </data-member>
    </union-decl>
    <!-- enum lttng_ust_chan_type -->
    <enum-decl name='lttng_ust_chan_type' filepath='../include/lttng/ust-abi.h' line='64' column='1' id='type-id-174'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_CHAN_PER_CPU' value='0'/>
      <enumerator name='LTTNG_UST_CHAN_METADATA' value='1'/>
    </enum-decl>
    <!-- struct ustctl_consumer_channel_attr -->
    <class-decl name='ustctl_consumer_channel_attr' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='46' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_chan_type ustctl_consumer_channel_attr::type -->
        <var-decl name='type' type-id='type-id-174' visibility='default' filepath='../include/lttng/ust-ctl.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint64_t ustctl_consumer_channel_attr::subbuf_size -->
        <var-decl name='subbuf_size' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-ctl.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint64_t ustctl_consumer_channel_attr::num_subbuf -->
        <var-decl name='num_subbuf' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-ctl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int ustctl_consumer_channel_attr::overwrite -->
        <var-decl name='overwrite' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-ctl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int ustctl_consumer_channel_attr::switch_timer_interval -->
        <var-decl name='switch_timer_interval' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-ctl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- unsigned int ustctl_consumer_channel_attr::read_timer_interval -->
        <var-decl name='read_timer_interval' type-id='type-id-57' visibility='default' filepath='../include/lttng/ust-ctl.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- lttng_ust_output ustctl_consumer_channel_attr::output -->
        <var-decl name='output' type-id='type-id-230' visibility='default' filepath='../include/lttng/ust-ctl.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t ustctl_consumer_channel_attr::chan_id -->
        <var-decl name='chan_id' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-ctl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned char ustctl_consumer_channel_attr::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-56' visibility='default' filepath='../include/lttng/ust-ctl.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_output -->
    <enum-decl name='lttng_ust_output' filepath='../include/lttng/ust-abi.h' line='60' column='1' id='type-id-230'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_MMAP' value='0'/>
    </enum-decl>
    <!-- struct lttng_ust_object_data -->
    <class-decl name='lttng_ust_object_data' size-in-bits='2688' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='201' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_object_type lttng_ust_object_data::type -->
        <var-decl name='type' type-id='type-id-232' visibility='default' filepath='../include/lttng/ust-abi.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int lttng_ust_object_data::handle -->
        <var-decl name='handle' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_object_data::size -->
        <var-decl name='size' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-abi.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_ust_object_data::padding1[32] -->
        <var-decl name='padding1' type-id='type-id-30' visibility='default' filepath='../include/lttng/ust-abi.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {struct {void* data; lttng_ust_chan_type type; int wakeup_fd;} channel; struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} stream; char padding2[288];} lttng_ust_object_data::u -->
        <var-decl name='u' type-id='type-id-233' visibility='default' filepath='../include/lttng/ust-abi.h' line='218' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_object_type -->
    <enum-decl name='lttng_ust_object_type' filepath='../include/lttng/ust-abi.h' line='190' column='1' id='type-id-232'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_OBJECT_TYPE_UNKNOWN' value='-1'/>
      <enumerator name='LTTNG_UST_OBJECT_TYPE_CHANNEL' value='0'/>
      <enumerator name='LTTNG_UST_OBJECT_TYPE_STREAM' value='1'/>
      <enumerator name='LTTNG_UST_OBJECT_TYPE_EVENT' value='2'/>
      <enumerator name='LTTNG_UST_OBJECT_TYPE_CONTEXT' value='3'/>
    </enum-decl>
    <!-- union {struct {void* data; lttng_ust_chan_type type; int wakeup_fd;} channel; struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} stream; char padding2[288];} -->
    <union-decl name='__anonymous_union__22' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='206' column='1' id='type-id-233'>
      <data-member access='private'>
        <!-- struct {void* data; lttng_ust_chan_type type; int wakeup_fd;} channel -->
        <var-decl name='channel' type-id='type-id-234' visibility='default' filepath='../include/lttng/ust-abi.h' line='211' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} stream -->
        <var-decl name='stream' type-id='type-id-235' visibility='default' filepath='../include/lttng/ust-abi.h' line='216' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding2[288] -->
        <var-decl name='padding2' type-id='type-id-24' visibility='default' filepath='../include/lttng/ust-abi.h' line='217' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {void* data; lttng_ust_chan_type type; int wakeup_fd;} -->
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='207' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* data -->
        <var-decl name='data' type-id='type-id-112' visibility='default' filepath='../include/lttng/ust-abi.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_chan_type type -->
        <var-decl name='type' type-id='type-id-174' visibility='default' filepath='../include/lttng/ust-abi.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='210' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} -->
    <class-decl name='__anonymous_struct__17' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='212' column='1' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t stream_nr -->
        <var-decl name='stream_nr' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_calibrate -->
    <class-decl name='lttng_ust_calibrate' size-in-bits='2464' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='227' column='1' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_calibrate_type lttng_ust_calibrate::type -->
        <var-decl name='type' type-id='type-id-237' visibility='default' filepath='../include/lttng/ust-abi.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_calibrate::padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../include/lttng/ust-abi.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- union {char padding[288];} lttng_ust_calibrate::u -->
        <var-decl name='u' type-id='type-id-238' visibility='default' filepath='../include/lttng/ust-abi.h' line='233' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_calibrate_type -->
    <enum-decl name='lttng_ust_calibrate_type' filepath='../include/lttng/ust-abi.h' line='221' column='1' id='type-id-237'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_CALIBRATE_TRACEPOINT' value='0'/>
    </enum-decl>
    <!-- union {char padding[288];} -->
    <union-decl name='__anonymous_union__23' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='231' column='1' id='type-id-238'>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-24' visibility='default' filepath='../include/lttng/ust-abi.h' line='232' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_tracer_version -->
    <class-decl name='lttng_ust_tracer_version' size-in-bits='96' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='69' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_tracer_version::major -->
        <var-decl name='major' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_tracer_version::minor -->
        <var-decl name='minor' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_tracer_version::patchlevel -->
        <var-decl name='patchlevel' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_field_iter -->
    <class-decl name='lttng_ust_field_iter' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='126' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_field_iter::event_name[256] -->
        <var-decl name='event_name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-abi.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- char lttng_ust_field_iter::field_name[256] -->
        <var-decl name='field_name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-abi.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <!-- lttng_ust_field_type lttng_ust_field_iter::type -->
        <var-decl name='type' type-id='type-id-241' visibility='default' filepath='../include/lttng/ust-abi.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <!-- int lttng_ust_field_iter::loglevel -->
        <var-decl name='loglevel' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <!-- int lttng_ust_field_iter::nowrite -->
        <var-decl name='nowrite' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <!-- char lttng_ust_field_iter::padding[284] -->
        <var-decl name='padding' type-id='type-id-22' visibility='default' filepath='../include/lttng/ust-abi.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_field_type -->
    <enum-decl name='lttng_ust_field_type' filepath='../include/lttng/ust-abi.h' line='117' column='1' id='type-id-241'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_FIELD_OTHER' value='0'/>
      <enumerator name='LTTNG_UST_FIELD_INTEGER' value='1'/>
      <enumerator name='LTTNG_UST_FIELD_ENUM' value='2'/>
      <enumerator name='LTTNG_UST_FIELD_FLOAT' value='3'/>
      <enumerator name='LTTNG_UST_FIELD_STRING' value='4'/>
    </enum-decl>
    <!-- struct lttng_ust_tracepoint_iter -->
    <class-decl name='lttng_ust_tracepoint_iter' size-in-bits='2208' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='184' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_tracepoint_iter::name[256] -->
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-abi.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- int lttng_ust_tracepoint_iter::loglevel -->
        <var-decl name='loglevel' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- char lttng_ust_tracepoint_iter::padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../include/lttng/ust-abi.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_exclusion -->
    <class-decl name='lttng_ust_event_exclusion' size-in-bits='288' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='247' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_event_exclusion::count -->
        <var-decl name='count' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_event_exclusion::padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/lttng/ust-abi.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- char lttng_ust_event_exclusion::names[256][] -->
        <var-decl name='names' type-id='type-id-20' visibility='default' filepath='../include/lttng/ust-abi.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_filter_bytecode -->
    <class-decl name='lttng_ust_filter_bytecode' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='238' column='1' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_filter_bytecode::len -->
        <var-decl name='len' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_filter_bytecode::reloc_offset -->
        <var-decl name='reloc_offset' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_filter_bytecode::seqnum -->
        <var-decl name='seqnum' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-abi.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_ust_filter_bytecode::padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/lttng/ust-abi.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_filter_bytecode::data[] -->
        <var-decl name='data' type-id='type-id-40' visibility='default' filepath='../include/lttng/ust-abi.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_context_attr -->
    <class-decl name='lttng_ust_context_attr' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='62' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_context_type lttng_ust_context_attr::ctx -->
        <var-decl name='ctx' type-id='type-id-246' visibility='default' filepath='../include/lttng/ust-ctl.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {lttng_ust_perf_counter_ctx perf_counter; struct {char* provider_name; char* ctx_name;} app_ctx;} lttng_ust_context_attr::u -->
        <var-decl name='u' type-id='type-id-247' visibility='default' filepath='../include/lttng/ust-ctl.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_context_type -->
    <enum-decl name='lttng_ust_context_type' filepath='../include/lttng/ust-abi.h' line='135' column='1' id='type-id-246'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_CONTEXT_VTID' value='0'/>
      <enumerator name='LTTNG_UST_CONTEXT_VPID' value='1'/>
      <enumerator name='LTTNG_UST_CONTEXT_PTHREAD_ID' value='2'/>
      <enumerator name='LTTNG_UST_CONTEXT_PROCNAME' value='3'/>
      <enumerator name='LTTNG_UST_CONTEXT_IP' value='4'/>
      <enumerator name='LTTNG_UST_CONTEXT_PERF_THREAD_COUNTER' value='5'/>
      <enumerator name='LTTNG_UST_CONTEXT_CPU_ID' value='6'/>
      <enumerator name='LTTNG_UST_CONTEXT_APP_CONTEXT' value='7'/>
    </enum-decl>
    <!-- union {lttng_ust_perf_counter_ctx perf_counter; struct {char* provider_name; char* ctx_name;} app_ctx;} -->
    <union-decl name='__anonymous_union__24' size-in-bits='2176' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='64' column='1' id='type-id-247'>
      <data-member access='private'>
        <!-- lttng_ust_perf_counter_ctx perf_counter -->
        <var-decl name='perf_counter' type-id='type-id-248' visibility='default' filepath='../include/lttng/ust-ctl.h' line='65' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char* provider_name; char* ctx_name;} app_ctx -->
        <var-decl name='app_ctx' type-id='type-id-249' visibility='default' filepath='../include/lttng/ust-ctl.h' line='69' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_perf_counter_ctx -->
    <class-decl name='lttng_ust_perf_counter_ctx' size-in-bits='2144' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='146' column='1' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_perf_counter_ctx::type -->
        <var-decl name='type' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint64_t lttng_ust_perf_counter_ctx::config -->
        <var-decl name='config' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-abi.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_perf_counter_ctx::name[256] -->
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-abi.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {char* provider_name; char* ctx_name;} -->
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-ctl.h' line='66' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char* provider_name -->
        <var-decl name='provider_name' type-id='type-id-102' visibility='default' filepath='../include/lttng/ust-ctl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* ctx_name -->
        <var-decl name='ctx_name' type-id='type-id-102' visibility='default' filepath='../include/lttng/ust-ctl.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event -->
    <class-decl name='lttng_ust_event' size-in-bits='4576' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='103' column='1' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_instrumentation lttng_ust_event::instrumentation -->
        <var-decl name='instrumentation' type-id='type-id-251' visibility='default' filepath='../include/lttng/ust-abi.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_event::name[256] -->
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../include/lttng/ust-abi.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- lttng_ust_loglevel_type lttng_ust_event::loglevel_type -->
        <var-decl name='loglevel_type' type-id='type-id-252' visibility='default' filepath='../include/lttng/ust-abi.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <!-- int lttng_ust_event::loglevel -->
        <var-decl name='loglevel' type-id='type-id-43' visibility='default' filepath='../include/lttng/ust-abi.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <!-- char lttng_ust_event::padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../include/lttng/ust-abi.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <!-- union {char padding[288];} lttng_ust_event::u -->
        <var-decl name='u' type-id='type-id-253' visibility='default' filepath='../include/lttng/ust-abi.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_instrumentation -->
    <enum-decl name='lttng_ust_instrumentation' filepath='../include/lttng/ust-abi.h' line='48' column='1' id='type-id-251'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_TRACEPOINT' value='0'/>
      <enumerator name='LTTNG_UST_PROBE' value='1'/>
      <enumerator name='LTTNG_UST_FUNCTION' value='2'/>
    </enum-decl>
    <!-- enum lttng_ust_loglevel_type -->
    <enum-decl name='lttng_ust_loglevel_type' filepath='../include/lttng/ust-abi.h' line='54' column='1' id='type-id-252'>
      <underlying-type type-id='type-id-54'/>
      <enumerator name='LTTNG_UST_LOGLEVEL_ALL' value='0'/>
      <enumerator name='LTTNG_UST_LOGLEVEL_RANGE' value='1'/>
      <enumerator name='LTTNG_UST_LOGLEVEL_SINGLE' value='2'/>
    </enum-decl>
    <!-- union {char padding[288];} -->
    <union-decl name='__anonymous_union__25' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='112' column='1' id='type-id-253'>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-24' visibility='default' filepath='../include/lttng/ust-abi.h' line='113' column='1'/>
      </data-member>
    </union-decl>
    <!-- cds_hlist_node* -->
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-217'/>
    <!-- cds_list_head* -->
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-216'/>
    <!-- channel* -->
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-104'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-102'/>
    <!-- char** -->
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-254'/>
    <!-- commit_counters_cold* -->
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-163'/>
    <!-- commit_counters_hot* -->
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-147'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-255'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-184'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-256'/>
    <!-- const int* -->
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <!-- const lttng_channel_ops -->
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-258'/>
    <!-- const lttng_channel_ops* -->
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-173'/>
    <!-- const lttng_enum_desc -->
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-259'/>
    <!-- const lttng_enum_desc* -->
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-197'/>
    <!-- const lttng_enum_entry -->
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-260'/>
    <!-- const lttng_enum_entry* -->
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-199'/>
    <!-- const lttng_ust_lib_ring_buffer_client_cb -->
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-261'/>
    <!-- const lttng_ust_lib_ring_buffer_client_cb* -->
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-125'/>
    <!-- const lttng_ust_lib_ring_buffer_config -->
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-262'/>
    <!-- const lttng_ust_lib_ring_buffer_config* -->
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <!-- int (channel*)* -->
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-227'/>
    <!-- int (channel*, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-228'/>
    <!-- int (lttng_ust_lib_ring_buffer*, void*, int, const char*, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-131'/>
    <!-- int (lttng_ust_lib_ring_buffer_ctx*, typedef uint32_t)* -->
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-223'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-268'/>
    <!-- lttng_channel* -->
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-167'/>
    <!-- lttng_channel* (const char*, void*, typedef size_t, typedef size_t, unsigned int, unsigned int, unsigned char*, typedef uint32_t, const int*, int)* -->
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-220'/>
    <!-- lttng_ctx* -->
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-170'/>
    <!-- lttng_ctx_field* -->
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-176'/>
    <!-- lttng_ctx_value* -->
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-270'/>
    <!-- lttng_event_field* -->
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-206'/>
    <!-- lttng_perf_counter_field* -->
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-212'/>
    <!-- lttng_session* -->
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-171'/>
    <!-- lttng_ust_calibrate* -->
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-271'/>
    <!-- lttng_ust_context_attr* -->
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-272'/>
    <!-- lttng_ust_event* -->
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-273'/>
    <!-- lttng_ust_event_exclusion* -->
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-274'/>
    <!-- lttng_ust_field_iter* -->
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-275'/>
    <!-- lttng_ust_filter_bytecode* -->
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-276'/>
    <!-- lttng_ust_lib_ring_buffer* -->
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-95'/>
    <!-- lttng_ust_lib_ring_buffer_backend_counts* -->
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-156'/>
    <!-- lttng_ust_lib_ring_buffer_backend_pages* -->
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-136'/>
    <!-- lttng_ust_lib_ring_buffer_backend_pages_shmp* -->
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-158'/>
    <!-- lttng_ust_lib_ring_buffer_backend_subbuffer* -->
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-155'/>
    <!-- lttng_ust_lib_ring_buffer_ctx* -->
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-277'/>
    <!-- lttng_ust_object_data* -->
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-278'/>
    <!-- lttng_ust_object_data** -->
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <!-- lttng_ust_shm_handle* -->
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-94'/>
    <!-- lttng_ust_tracepoint_iter* -->
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-280'/>
    <!-- lttng_ust_tracer_version* -->
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-281'/>
    <!-- shm_object_table* -->
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-98'/>
    <!-- size_t* -->
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-282'/>
    <!-- typedef size_t ()* -->
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-128'/>
    <!-- typedef size_t (channel*, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-226'/>
    <!-- typedef size_t (const lttng_ust_lib_ring_buffer_config*, channel*, typedef size_t, size_t*, lttng_ust_lib_ring_buffer_ctx*)* -->
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-127'/>
    <!-- typedef size_t (lttng_ctx_field*, typedef size_t)* -->
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-179'/>
    <!-- typedef uint64_t (channel*)* -->
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-126'/>
    <!-- uint32_t* -->
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-288'/>
    <!-- uint64_t* -->
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-289'/>
    <!-- unsigned char* -->
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-290'/>
    <!-- unsigned long int* -->
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-291'/>
    <!-- ustctl_consumer_channel* -->
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-96'/>
    <!-- ustctl_consumer_channel_attr* -->
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-292'/>
    <!-- ustctl_consumer_stream* -->
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-293'/>
    <!-- ustctl_enum_entry* -->
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-294'/>
    <!-- ustctl_enum_entry** -->
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <!-- ustctl_field* -->
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-296'/>
    <!-- ustctl_field** -->
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <!-- ustctl_notify_cmd* -->
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-298'/>
    <!-- ustctl_socket_type* -->
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-299'/>
    <!-- void (const lttng_ust_lib_ring_buffer_config*, channel*, lttng_ust_lib_ring_buffer*, typedef size_t, size_t*, size_t*, uint64_t*, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-133'/>
    <!-- void (const lttng_ust_lib_ring_buffer_config*, size_t*, size_t*)* -->
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-134'/>
    <!-- void (lttng_channel*)* -->
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-221'/>
    <!-- void (lttng_ctx_field*)* -->
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-183'/>
    <!-- void (lttng_ctx_field*, lttng_ctx_value*)* -->
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-181'/>
    <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*)* -->
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-180'/>
    <!-- void (lttng_ust_lib_ring_buffer*, typedef uint64_t, unsigned int, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-129'/>
    <!-- void (lttng_ust_lib_ring_buffer*, typedef uint64_t, unsigned int, unsigned long int, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-130'/>
    <!-- void (lttng_ust_lib_ring_buffer*, void*, int, lttng_ust_shm_handle*)* -->
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-132'/>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*)* -->
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-224'/>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, const char*, typedef size_t)* -->
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-229'/>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, void*, typedef size_t)* -->
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-225'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-112'/>
    <!-- void** -->
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-115'/>
    <!-- volatile ssize_t -->
    <qualified-type-def type-id='type-id-107' volatile='yes' id='type-id-105'/>
    <!-- volatile ust_loglevel -->
    <qualified-type-def type-id='type-id-60' volatile='yes' id='type-id-312'/>
    <!-- volatile ust_loglevel ust_loglevel -->
    <var-decl name='ust_loglevel' type-id='type-id-312' mangled-name='ust_loglevel' visibility='default' filepath='../include/usterr-signal-safe.h' line='37' column='1' elf-symbol-id='ust_loglevel'/>
    <!-- int ustctl_regenerate_statedump(int, int) -->
    <function-decl name='ustctl_regenerate_statedump' mangled-name='ustctl_regenerate_statedump' filepath='liblttng-ust-ctl/ustctl.c' line='2189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_regenerate_statedump'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='2189' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='handle' filepath='liblttng-ust-ctl/ustctl.c' line='2189' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_reply_register_channel(int, uint32_t, ustctl_channel_header, int) -->
    <function-decl name='ustctl_reply_register_channel' mangled-name='ustctl_reply_register_channel' filepath='liblttng-ust-ctl/ustctl.c' line='2154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_reply_register_channel'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='2154' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='chan_id' filepath='liblttng-ust-ctl/ustctl.c' line='2155' column='1'/>
      <!-- parameter of type 'enum ustctl_channel_header' -->
      <parameter type-id='type-id-63' name='header_type' filepath='liblttng-ust-ctl/ustctl.c' line='2156' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='ret_code' filepath='liblttng-ust-ctl/ustctl.c' line='2157' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_register_channel(int, int*, int*, size_t*, ustctl_field**) -->
    <function-decl name='ustctl_recv_register_channel' mangled-name='ustctl_recv_register_channel' filepath='liblttng-ust-ctl/ustctl.c' line='2092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_register_channel'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='2092' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='session_objd' filepath='liblttng-ust-ctl/ustctl.c' line='2093' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='channel_objd' filepath='liblttng-ust-ctl/ustctl.c' line='2094' column='1'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282' name='nr_fields' filepath='liblttng-ust-ctl/ustctl.c' line='2095' column='1'/>
      <!-- parameter of type 'ustctl_field**' -->
      <parameter type-id='type-id-297' name='fields' filepath='liblttng-ust-ctl/ustctl.c' line='2096' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_reply_register_enum(int, uint64_t, int) -->
    <function-decl name='ustctl_reply_register_enum' mangled-name='ustctl_reply_register_enum' filepath='liblttng-ust-ctl/ustctl.c' line='2067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_reply_register_enum'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='2067' column='1'/>
      <!-- parameter of type 'typedef uint64_t' -->
      <parameter type-id='type-id-82' name='id' filepath='liblttng-ust-ctl/ustctl.c' line='2068' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='ret_code' filepath='liblttng-ust-ctl/ustctl.c' line='2069' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_register_enum(int, int*, char*, ustctl_enum_entry**, size_t*) -->
    <function-decl name='ustctl_recv_register_enum' mangled-name='ustctl_recv_register_enum' filepath='liblttng-ust-ctl/ustctl.c' line='2008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_register_enum'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='2008' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='session_objd' filepath='liblttng-ust-ctl/ustctl.c' line='2009' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-102' name='enum_name' filepath='liblttng-ust-ctl/ustctl.c' line='2010' column='1'/>
      <!-- parameter of type 'ustctl_enum_entry**' -->
      <parameter type-id='type-id-295' name='entries' filepath='liblttng-ust-ctl/ustctl.c' line='2011' column='1'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282' name='nr_entries' filepath='liblttng-ust-ctl/ustctl.c' line='2012' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_reply_register_event(int, uint32_t, int) -->
    <function-decl name='ustctl_reply_register_event' mangled-name='ustctl_reply_register_event' filepath='liblttng-ust-ctl/ustctl.c' line='1983' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_reply_register_event'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='1983' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='id' filepath='liblttng-ust-ctl/ustctl.c' line='1984' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='ret_code' filepath='liblttng-ust-ctl/ustctl.c' line='1985' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_register_event(int, int*, int*, char*, int*, char**, size_t*, ustctl_field**, char**) -->
    <function-decl name='ustctl_recv_register_event' mangled-name='ustctl_recv_register_event' filepath='liblttng-ust-ctl/ustctl.c' line='1862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_register_event'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='1862' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='session_objd' filepath='liblttng-ust-ctl/ustctl.c' line='1863' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='channel_objd' filepath='liblttng-ust-ctl/ustctl.c' line='1864' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-102' name='event_name' filepath='liblttng-ust-ctl/ustctl.c' line='1865' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='loglevel' filepath='liblttng-ust-ctl/ustctl.c' line='1866' column='1'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-254' name='signature' filepath='liblttng-ust-ctl/ustctl.c' line='1867' column='1'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282' name='nr_fields' filepath='liblttng-ust-ctl/ustctl.c' line='1868' column='1'/>
      <!-- parameter of type 'ustctl_field**' -->
      <parameter type-id='type-id-297' name='fields' filepath='liblttng-ust-ctl/ustctl.c' line='1869' column='1'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-254' name='model_emf_uri' filepath='liblttng-ust-ctl/ustctl.c' line='1870' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_notify(int, ustctl_notify_cmd*) -->
    <function-decl name='ustctl_recv_notify' mangled-name='ustctl_recv_notify' filepath='liblttng-ust-ctl/ustctl.c' line='1831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_notify'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='1831' column='1'/>
      <!-- parameter of type 'ustctl_notify_cmd*' -->
      <parameter type-id='type-id-298' name='notify_cmd' filepath='liblttng-ust-ctl/ustctl.c' line='1831' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_reg_msg(int, ustctl_socket_type*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, uint32_t*, int*, char*) -->
    <function-decl name='ustctl_recv_reg_msg' mangled-name='ustctl_recv_reg_msg' filepath='liblttng-ust-ctl/ustctl.c' line='1766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_reg_msg'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='1766' column='1'/>
      <!-- parameter of type 'ustctl_socket_type*' -->
      <parameter type-id='type-id-299' name='type' filepath='liblttng-ust-ctl/ustctl.c' line='1767' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='major' filepath='liblttng-ust-ctl/ustctl.c' line='1768' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='minor' filepath='liblttng-ust-ctl/ustctl.c' line='1769' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='pid' filepath='liblttng-ust-ctl/ustctl.c' line='1770' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='ppid' filepath='liblttng-ust-ctl/ustctl.c' line='1771' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='uid' filepath='liblttng-ust-ctl/ustctl.c' line='1772' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='gid' filepath='liblttng-ust-ctl/ustctl.c' line='1773' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='bits_per_long' filepath='liblttng-ust-ctl/ustctl.c' line='1774' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='uint8_t_alignment' filepath='liblttng-ust-ctl/ustctl.c' line='1775' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='uint16_t_alignment' filepath='liblttng-ust-ctl/ustctl.c' line='1776' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='uint32_t_alignment' filepath='liblttng-ust-ctl/ustctl.c' line='1777' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='uint64_t_alignment' filepath='liblttng-ust-ctl/ustctl.c' line='1778' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='long_alignment' filepath='liblttng-ust-ctl/ustctl.c' line='1779' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='byte_order' filepath='liblttng-ust-ctl/ustctl.c' line='1780' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-102' name='name' filepath='liblttng-ust-ctl/ustctl.c' line='1781' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_has_perf_counters() -->
    <function-decl name='ustctl_has_perf_counters' mangled-name='ustctl_has_perf_counters' filepath='liblttng-ust-ctl/ustctl.c' line='1749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_has_perf_counters'>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_instance_id(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_instance_id' mangled-name='ustctl_get_instance_id' filepath='liblttng-ust-ctl/ustctl.c' line='1730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_instance_id'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1730' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='id' filepath='liblttng-ust-ctl/ustctl.c' line='1731' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_sequence_number(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_sequence_number' mangled-name='ustctl_get_sequence_number' filepath='liblttng-ust-ctl/ustctl.c' line='1713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_sequence_number'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1713' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='seq' filepath='liblttng-ust-ctl/ustctl.c' line='1714' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_current_timestamp(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_current_timestamp' mangled-name='ustctl_get_current_timestamp' filepath='liblttng-ust-ctl/ustctl.c' line='1696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_current_timestamp'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1696' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='ts' filepath='liblttng-ust-ctl/ustctl.c' line='1697' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_stream_id(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_stream_id' mangled-name='ustctl_get_stream_id' filepath='liblttng-ust-ctl/ustctl.c' line='1679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_stream_id'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1679' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='stream_id' filepath='liblttng-ust-ctl/ustctl.c' line='1680' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_packet_size(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_packet_size' mangled-name='ustctl_get_packet_size' filepath='liblttng-ust-ctl/ustctl.c' line='1662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_packet_size'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1662' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='packet_size' filepath='liblttng-ust-ctl/ustctl.c' line='1663' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_content_size(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_content_size' mangled-name='ustctl_get_content_size' filepath='liblttng-ust-ctl/ustctl.c' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_content_size'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1645' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='content_size' filepath='liblttng-ust-ctl/ustctl.c' line='1646' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_events_discarded(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_events_discarded' mangled-name='ustctl_get_events_discarded' filepath='liblttng-ust-ctl/ustctl.c' line='1628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_events_discarded'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1628' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='events_discarded' filepath='liblttng-ust-ctl/ustctl.c' line='1629' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_timestamp_end(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_timestamp_end' mangled-name='ustctl_get_timestamp_end' filepath='liblttng-ust-ctl/ustctl.c' line='1611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_timestamp_end'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1611' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='timestamp_end' filepath='liblttng-ust-ctl/ustctl.c' line='1612' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_timestamp_begin(ustctl_consumer_stream*, uint64_t*) -->
    <function-decl name='ustctl_get_timestamp_begin' mangled-name='ustctl_get_timestamp_begin' filepath='liblttng-ust-ctl/ustctl.c' line='1594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_timestamp_begin'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1594' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='timestamp_begin' filepath='liblttng-ust-ctl/ustctl.c' line='1595' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- void ustctl_flush_buffer(ustctl_consumer_stream*, int) -->
    <function-decl name='ustctl_flush_buffer' mangled-name='ustctl_flush_buffer' filepath='liblttng-ust-ctl/ustctl.c' line='1559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_flush_buffer'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1559' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='producer_active' filepath='liblttng-ust-ctl/ustctl.c' line='1560' column='1'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-decl>
    <!-- int ustctl_put_subbuf(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_put_subbuf' mangled-name='ustctl_put_subbuf' filepath='liblttng-ust-ctl/ustctl.c' line='1546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_put_subbuf'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1546' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_subbuf(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_get_subbuf' mangled-name='ustctl_get_subbuf' filepath='liblttng-ust-ctl/ustctl.c' line='1531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_subbuf'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1531' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='pos' filepath='liblttng-ust-ctl/ustctl.c' line='1532' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_snapshot_get_produced(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_snapshot_get_produced' mangled-name='ustctl_snapshot_get_produced' filepath='liblttng-ust-ctl/ustctl.c' line='1518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_snapshot_get_produced'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1518' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='pos' filepath='liblttng-ust-ctl/ustctl.c' line='1519' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_snapshot_get_consumed(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_snapshot_get_consumed' mangled-name='ustctl_snapshot_get_consumed' filepath='liblttng-ust-ctl/ustctl.c' line='1505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_snapshot_get_consumed'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1505' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='pos' filepath='liblttng-ust-ctl/ustctl.c' line='1506' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_snapshot(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_snapshot' mangled-name='ustctl_snapshot' filepath='liblttng-ust-ctl/ustctl.c' line='1491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_snapshot'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1491' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_put_next_subbuf(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_put_next_subbuf' mangled-name='ustctl_put_next_subbuf' filepath='liblttng-ust-ctl/ustctl.c' line='1475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_put_next_subbuf'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1475' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_next_subbuf(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_get_next_subbuf' mangled-name='ustctl_get_next_subbuf' filepath='liblttng-ust-ctl/ustctl.c' line='1460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_next_subbuf'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1460' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_padded_subbuf_size(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_get_padded_subbuf_size' mangled-name='ustctl_get_padded_subbuf_size' filepath='liblttng-ust-ctl/ustctl.c' line='1441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_padded_subbuf_size'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1441' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='len' filepath='liblttng-ust-ctl/ustctl.c' line='1442' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_subbuf_size(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_get_subbuf_size' mangled-name='ustctl_get_subbuf_size' filepath='liblttng-ust-ctl/ustctl.c' line='1422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_subbuf_size'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1422' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='len' filepath='liblttng-ust-ctl/ustctl.c' line='1423' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_mmap_read_offset(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_get_mmap_read_offset' mangled-name='ustctl_get_mmap_read_offset' filepath='liblttng-ust-ctl/ustctl.c' line='1391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_mmap_read_offset'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1391' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='off' filepath='liblttng-ust-ctl/ustctl.c' line='1392' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_max_subbuf_size(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_get_max_subbuf_size' mangled-name='ustctl_get_max_subbuf_size' filepath='liblttng-ust-ctl/ustctl.c' line='1371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_max_subbuf_size'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1371' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='len' filepath='liblttng-ust-ctl/ustctl.c' line='1372' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_get_mmap_len(ustctl_consumer_stream*, unsigned long int*) -->
    <function-decl name='ustctl_get_mmap_len' mangled-name='ustctl_get_mmap_len' filepath='liblttng-ust-ctl/ustctl.c' line='1348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_mmap_len'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1348' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-291' name='len' filepath='liblttng-ust-ctl/ustctl.c' line='1349' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- void* ustctl_get_mmap_base(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_get_mmap_base' mangled-name='ustctl_get_mmap_base' filepath='liblttng-ust-ctl/ustctl.c' line='1335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_mmap_base'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1335' column='1'/>
      <!-- void* -->
      <return type-id='type-id-112'/>
    </function-decl>
    <!-- int ustctl_stream_get_wakeup_fd(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_stream_get_wakeup_fd' mangled-name='ustctl_stream_get_wakeup_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_stream_get_wakeup_fd'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1321' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_stream_get_wait_fd(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_stream_get_wait_fd' mangled-name='ustctl_stream_get_wait_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_stream_get_wait_fd'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1309' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_channel_get_wakeup_fd(ustctl_consumer_channel*) -->
    <function-decl name='ustctl_channel_get_wakeup_fd' mangled-name='ustctl_channel_get_wakeup_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_channel_get_wakeup_fd'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='chan' filepath='liblttng-ust-ctl/ustctl.c' line='1301' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_channel_get_wait_fd(ustctl_consumer_channel*) -->
    <function-decl name='ustctl_channel_get_wait_fd' mangled-name='ustctl_channel_get_wait_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_channel_get_wait_fd'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='chan' filepath='liblttng-ust-ctl/ustctl.c' line='1293' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- void ustctl_destroy_stream(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_destroy_stream' mangled-name='ustctl_destroy_stream' filepath='liblttng-ust-ctl/ustctl.c' line='1279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_destroy_stream'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1279' column='1'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-decl>
    <!-- ustctl_consumer_stream* ustctl_create_stream(ustctl_consumer_channel*, int) -->
    <function-decl name='ustctl_create_stream' mangled-name='ustctl_create_stream' filepath='liblttng-ust-ctl/ustctl.c' line='1235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_create_stream'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='channel' filepath='liblttng-ust-ctl/ustctl.c' line='1235' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='cpu' filepath='liblttng-ust-ctl/ustctl.c' line='1236' column='1'/>
      <!-- ustctl_consumer_stream* -->
      <return type-id='type-id-293'/>
    </function-decl>
    <!-- int ustctl_stream_close_wakeup_fd(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_stream_close_wakeup_fd' mangled-name='ustctl_stream_close_wakeup_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_stream_close_wakeup_fd'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1225' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_stream_close_wait_fd(ustctl_consumer_stream*) -->
    <function-decl name='ustctl_stream_close_wait_fd' mangled-name='ustctl_stream_close_wait_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_stream_close_wait_fd'>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1216' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_channel_close_wakeup_fd(ustctl_consumer_channel*) -->
    <function-decl name='ustctl_channel_close_wakeup_fd' mangled-name='ustctl_channel_close_wakeup_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_channel_close_wakeup_fd'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='consumer_chan' filepath='liblttng-ust-ctl/ustctl.c' line='1203' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_channel_close_wait_fd(ustctl_consumer_channel*) -->
    <function-decl name='ustctl_channel_close_wait_fd' mangled-name='ustctl_channel_close_wait_fd' filepath='liblttng-ust-ctl/ustctl.c' line='1190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_channel_close_wait_fd'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='consumer_chan' filepath='liblttng-ust-ctl/ustctl.c' line='1190' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- ssize_t ustctl_write_one_packet_to_channel(ustctl_consumer_channel*, const char*, size_t) -->
    <function-decl name='ustctl_write_one_packet_to_channel' mangled-name='ustctl_write_one_packet_to_channel' filepath='liblttng-ust-ctl/ustctl.c' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_write_one_packet_to_channel'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='channel' filepath='liblttng-ust-ctl/ustctl.c' line='1161' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='metadata_str' filepath='liblttng-ust-ctl/ustctl.c' line='1162' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='len' filepath='liblttng-ust-ctl/ustctl.c' line='1163' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-107'/>
    </function-decl>
    <!-- int ustctl_write_metadata_to_channel(ustctl_consumer_channel*, const char*, size_t) -->
    <function-decl name='ustctl_write_metadata_to_channel' mangled-name='ustctl_write_metadata_to_channel' filepath='liblttng-ust-ctl/ustctl.c' line='1112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_write_metadata_to_channel'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='channel' filepath='liblttng-ust-ctl/ustctl.c' line='1113' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='metadata_str' filepath='liblttng-ust-ctl/ustctl.c' line='1114' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='len' filepath='liblttng-ust-ctl/ustctl.c' line='1115' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_send_stream_to_sessiond(int, ustctl_consumer_stream*) -->
    <function-decl name='ustctl_send_stream_to_sessiond' mangled-name='ustctl_send_stream_to_sessiond' filepath='liblttng-ust-ctl/ustctl.c' line='1099' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_send_stream_to_sessiond'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='1099' column='1'/>
      <!-- parameter of type 'ustctl_consumer_stream*' -->
      <parameter type-id='type-id-293' name='stream' filepath='liblttng-ust-ctl/ustctl.c' line='1100' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_send_channel_to_sessiond(int, ustctl_consumer_channel*) -->
    <function-decl name='ustctl_send_channel_to_sessiond' mangled-name='ustctl_send_channel_to_sessiond' filepath='liblttng-ust-ctl/ustctl.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_send_channel_to_sessiond'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='1083' column='1'/>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='channel' filepath='liblttng-ust-ctl/ustctl.c' line='1084' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- void ustctl_destroy_channel(ustctl_consumer_channel*) -->
    <function-decl name='ustctl_destroy_channel' mangled-name='ustctl_destroy_channel' filepath='liblttng-ust-ctl/ustctl.c' line='1075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_destroy_channel'>
      <!-- parameter of type 'ustctl_consumer_channel*' -->
      <parameter type-id='type-id-96' name='chan' filepath='liblttng-ust-ctl/ustctl.c' line='1075' column='1'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-decl>
    <!-- ustctl_consumer_channel* ustctl_create_channel(ustctl_consumer_channel_attr*, const int*, int) -->
    <function-decl name='ustctl_create_channel' mangled-name='ustctl_create_channel' filepath='liblttng-ust-ctl/ustctl.c' line='1006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_create_channel'>
      <!-- parameter of type 'ustctl_consumer_channel_attr*' -->
      <parameter type-id='type-id-292' name='attr' filepath='liblttng-ust-ctl/ustctl.c' line='1006' column='1'/>
      <!-- parameter of type 'const int*' -->
      <parameter type-id='type-id-257' name='stream_fds' filepath='liblttng-ust-ctl/ustctl.c' line='1007' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='nr_stream_fds' filepath='liblttng-ust-ctl/ustctl.c' line='1007' column='1'/>
      <!-- ustctl_consumer_channel* -->
      <return type-id='type-id-96'/>
    </function-decl>
    <!-- int ustctl_get_nr_stream_per_channel() -->
    <function-decl name='ustctl_get_nr_stream_per_channel' mangled-name='ustctl_get_nr_stream_per_channel' filepath='liblttng-ust-ctl/ustctl.c' line='1000' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_get_nr_stream_per_channel'>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_duplicate_ust_object_data(lttng_ust_object_data**, lttng_ust_object_data*) -->
    <function-decl name='ustctl_duplicate_ust_object_data' mangled-name='ustctl_duplicate_ust_object_data' filepath='liblttng-ust-ctl/ustctl.c' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_duplicate_ust_object_data'>
      <!-- parameter of type 'lttng_ust_object_data**' -->
      <parameter type-id='type-id-279' name='dest' filepath='liblttng-ust-ctl/ustctl.c' line='884' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='src' filepath='liblttng-ust-ctl/ustctl.c' line='885' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_send_stream_to_ust(int, lttng_ust_object_data*, lttng_ust_object_data*) -->
    <function-decl name='ustctl_send_stream_to_ust' mangled-name='ustctl_send_stream_to_ust' filepath='liblttng-ust-ctl/ustctl.c' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_send_stream_to_ust'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='854' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='channel_data' filepath='liblttng-ust-ctl/ustctl.c' line='855' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='stream_data' filepath='liblttng-ust-ctl/ustctl.c' line='856' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_send_channel_to_ust(int, int, lttng_ust_object_data*) -->
    <function-decl name='ustctl_send_channel_to_ust' mangled-name='ustctl_send_channel_to_ust' filepath='liblttng-ust-ctl/ustctl.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_send_channel_to_ust'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='820' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='session_handle' filepath='liblttng-ust-ctl/ustctl.c' line='820' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='channel_data' filepath='liblttng-ust-ctl/ustctl.c' line='821' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_stream_from_consumer(int, lttng_ust_object_data**) -->
    <function-decl name='ustctl_recv_stream_from_consumer' mangled-name='ustctl_recv_stream_from_consumer' filepath='liblttng-ust-ctl/ustctl.c' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_stream_from_consumer'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='755' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data**' -->
      <parameter type-id='type-id-279' name='_stream_data' filepath='liblttng-ust-ctl/ustctl.c' line='756' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_recv_channel_from_consumer(int, lttng_ust_object_data**) -->
    <function-decl name='ustctl_recv_channel_from_consumer' mangled-name='ustctl_recv_channel_from_consumer' filepath='liblttng-ust-ctl/ustctl.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_recv_channel_from_consumer'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='679' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data**' -->
      <parameter type-id='type-id-279' name='_channel_data' filepath='liblttng-ust-ctl/ustctl.c' line='680' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_sock_flush_buffer(int, lttng_ust_object_data*) -->
    <function-decl name='ustctl_sock_flush_buffer' mangled-name='ustctl_sock_flush_buffer' filepath='liblttng-ust-ctl/ustctl.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_sock_flush_buffer'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='551' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='object' filepath='liblttng-ust-ctl/ustctl.c' line='551' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_calibrate(int, lttng_ust_calibrate*) -->
    <function-decl name='ustctl_calibrate' mangled-name='ustctl_calibrate' filepath='liblttng-ust-ctl/ustctl.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_calibrate'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='543' column='1'/>
      <!-- parameter of type 'lttng_ust_calibrate*' -->
      <parameter type-id='type-id-271' name='calibrate' filepath='liblttng-ust-ctl/ustctl.c' line='543' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_wait_quiescent(int) -->
    <function-decl name='ustctl_wait_quiescent' mangled-name='ustctl_wait_quiescent' filepath='liblttng-ust-ctl/ustctl.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_wait_quiescent'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='527' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_tracer_version(int, lttng_ust_tracer_version*) -->
    <function-decl name='ustctl_tracer_version' mangled-name='ustctl_tracer_version' filepath='liblttng-ust-ctl/ustctl.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_tracer_version'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='507' column='1'/>
      <!-- parameter of type 'lttng_ust_tracer_version*' -->
      <parameter type-id='type-id-281' name='v' filepath='liblttng-ust-ctl/ustctl.c' line='507' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_tracepoint_field_list_get(int, int, lttng_ust_field_iter*) -->
    <function-decl name='ustctl_tracepoint_field_list_get' mangled-name='ustctl_tracepoint_field_list_get' filepath='liblttng-ust-ctl/ustctl.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_tracepoint_field_list_get'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='478' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='tp_field_list_handle' filepath='liblttng-ust-ctl/ustctl.c' line='478' column='1'/>
      <!-- parameter of type 'lttng_ust_field_iter*' -->
      <parameter type-id='type-id-275' name='iter' filepath='liblttng-ust-ctl/ustctl.c' line='479' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_tracepoint_field_list(int) -->
    <function-decl name='ustctl_tracepoint_field_list' mangled-name='ustctl_tracepoint_field_list' filepath='liblttng-ust-ctl/ustctl.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_tracepoint_field_list'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='461' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_tracepoint_list_get(int, int, lttng_ust_tracepoint_iter*) -->
    <function-decl name='ustctl_tracepoint_list_get' mangled-name='ustctl_tracepoint_list_get' filepath='liblttng-ust-ctl/ustctl.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_tracepoint_list_get'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='438' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='tp_list_handle' filepath='liblttng-ust-ctl/ustctl.c' line='438' column='1'/>
      <!-- parameter of type 'lttng_ust_tracepoint_iter*' -->
      <parameter type-id='type-id-280' name='iter' filepath='liblttng-ust-ctl/ustctl.c' line='439' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_tracepoint_list(int) -->
    <function-decl name='ustctl_tracepoint_list' mangled-name='ustctl_tracepoint_list' filepath='liblttng-ust-ctl/ustctl.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_tracepoint_list'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='421' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_stop_session(int, int) -->
    <function-decl name='ustctl_stop_session' mangled-name='ustctl_stop_session' filepath='liblttng-ust-ctl/ustctl.c' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_stop_session'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='413' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='handle' filepath='liblttng-ust-ctl/ustctl.c' line='413' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_start_session(int, int) -->
    <function-decl name='ustctl_start_session' mangled-name='ustctl_start_session' filepath='liblttng-ust-ctl/ustctl.c' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_start_session'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='405' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='handle' filepath='liblttng-ust-ctl/ustctl.c' line='405' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_disable(int, lttng_ust_object_data*) -->
    <function-decl name='ustctl_disable' mangled-name='ustctl_disable' filepath='liblttng-ust-ctl/ustctl.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_disable'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='386' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='object' filepath='liblttng-ust-ctl/ustctl.c' line='386' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_enable(int, lttng_ust_object_data*) -->
    <function-decl name='ustctl_enable' mangled-name='ustctl_enable' filepath='liblttng-ust-ctl/ustctl.c' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_enable'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='366' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='object' filepath='liblttng-ust-ctl/ustctl.c' line='366' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_set_exclusion(int, lttng_ust_event_exclusion*, lttng_ust_object_data*) -->
    <function-decl name='ustctl_set_exclusion' mangled-name='ustctl_set_exclusion' filepath='liblttng-ust-ctl/ustctl.c' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_set_exclusion'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='331' column='1'/>
      <!-- parameter of type 'lttng_ust_event_exclusion*' -->
      <parameter type-id='type-id-274' name='exclusion' filepath='liblttng-ust-ctl/ustctl.c' line='331' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='obj_data' filepath='liblttng-ust-ctl/ustctl.c' line='332' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_set_filter(int, lttng_ust_filter_bytecode*, lttng_ust_object_data*) -->
    <function-decl name='ustctl_set_filter' mangled-name='ustctl_set_filter' filepath='liblttng-ust-ctl/ustctl.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_set_filter'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='300' column='1'/>
      <!-- parameter of type 'lttng_ust_filter_bytecode*' -->
      <parameter type-id='type-id-276' name='bytecode' filepath='liblttng-ust-ctl/ustctl.c' line='300' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='obj_data' filepath='liblttng-ust-ctl/ustctl.c' line='301' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_add_context(int, lttng_ust_context_attr*, lttng_ust_object_data*, lttng_ust_object_data**) -->
    <function-decl name='ustctl_add_context' mangled-name='ustctl_add_context' filepath='liblttng-ust-ctl/ustctl.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_add_context'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='217' column='1'/>
      <!-- parameter of type 'lttng_ust_context_attr*' -->
      <parameter type-id='type-id-272' name='ctx' filepath='liblttng-ust-ctl/ustctl.c' line='217' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='obj_data' filepath='liblttng-ust-ctl/ustctl.c' line='218' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data**' -->
      <parameter type-id='type-id-279' name='_context_data' filepath='liblttng-ust-ctl/ustctl.c' line='219' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_create_event(int, lttng_ust_event*, lttng_ust_object_data*, lttng_ust_object_data**) -->
    <function-decl name='ustctl_create_event' mangled-name='ustctl_create_event' filepath='liblttng-ust-ctl/ustctl.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_create_event'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='182' column='1'/>
      <!-- parameter of type 'lttng_ust_event*' -->
      <parameter type-id='type-id-273' name='ev' filepath='liblttng-ust-ctl/ustctl.c' line='182' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='channel_data' filepath='liblttng-ust-ctl/ustctl.c' line='183' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data**' -->
      <parameter type-id='type-id-279' name='_event_data' filepath='liblttng-ust-ctl/ustctl.c' line='184' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_create_session(int) -->
    <function-decl name='ustctl_create_session' mangled-name='ustctl_create_session' filepath='liblttng-ust-ctl/ustctl.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_create_session'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='164' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_register_done(int) -->
    <function-decl name='ustctl_register_done' mangled-name='ustctl_register_done' filepath='liblttng-ust-ctl/ustctl.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_register_done'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='145' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_release_object(int, lttng_ust_object_data*) -->
    <function-decl name='ustctl_release_object' mangled-name='ustctl_release_object' filepath='liblttng-ust-ctl/ustctl.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_release_object'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='99' column='1'/>
      <!-- parameter of type 'lttng_ust_object_data*' -->
      <parameter type-id='type-id-278' name='data' filepath='liblttng-ust-ctl/ustctl.c' line='99' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustctl_release_handle(int, int) -->
    <function-decl name='ustctl_release_handle' mangled-name='ustctl_release_handle' filepath='liblttng-ust-ctl/ustctl.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustctl_release_handle'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-ctl/ustctl.c' line='82' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='handle' filepath='liblttng-ust-ctl/ustctl.c' line='82' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int (channel*) -->
    <function-type size-in-bits='64' id='type-id-264'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-104'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-type>
    <!-- int (channel*, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-265'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-104'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-type>
    <!-- int (lttng_ust_lib_ring_buffer*, void*, int, const char*, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-266'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-112'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-type>
    <!-- int (lttng_ust_lib_ring_buffer_ctx*, uint32_t) -->
    <function-type size-in-bits='64' id='type-id-267'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-277'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-type>
    <!-- lttng_channel* (const char*, void*, size_t, size_t, unsigned int, unsigned int, unsigned char*, uint32_t, const int*, int) -->
    <function-type size-in-bits='64' id='type-id-269'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-112'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-57'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-57'/>
      <!-- parameter of type 'unsigned char*' -->
      <parameter type-id='type-id-290'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62'/>
      <!-- parameter of type 'const int*' -->
      <parameter type-id='type-id-257'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43'/>
      <!-- lttng_channel* -->
      <return type-id='type-id-167'/>
    </function-type>
    <!-- size_t () -->
    <function-type size-in-bits='64' id='type-id-283'>
      <!-- typedef size_t -->
      <return type-id='type-id-64'/>
    </function-type>
    <!-- size_t (channel*, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-284'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-104'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- typedef size_t -->
      <return type-id='type-id-64'/>
    </function-type>
    <!-- size_t (const lttng_ust_lib_ring_buffer_config*, channel*, size_t, size_t*, lttng_ust_lib_ring_buffer_ctx*) -->
    <function-type size-in-bits='64' id='type-id-285'>
      <!-- parameter of type 'const lttng_ust_lib_ring_buffer_config*' -->
      <parameter type-id='type-id-263'/>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-104'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282'/>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-277'/>
      <!-- typedef size_t -->
      <return type-id='type-id-64'/>
    </function-type>
    <!-- size_t (lttng_ctx_field*, size_t) -->
    <function-type size-in-bits='64' id='type-id-286'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-176'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- typedef size_t -->
      <return type-id='type-id-64'/>
    </function-type>
    <!-- uint64_t (channel*) -->
    <function-type size-in-bits='64' id='type-id-287'>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-104'/>
      <!-- typedef uint64_t -->
      <return type-id='type-id-82'/>
    </function-type>
    <!-- void (const lttng_ust_lib_ring_buffer_config*, channel*, lttng_ust_lib_ring_buffer*, size_t, size_t*, size_t*, uint64_t*, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-300'>
      <!-- parameter of type 'const lttng_ust_lib_ring_buffer_config*' -->
      <parameter type-id='type-id-263'/>
      <!-- parameter of type 'channel*' -->
      <parameter type-id='type-id-104'/>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (const lttng_ust_lib_ring_buffer_config*, size_t*, size_t*) -->
    <function-type size-in-bits='64' id='type-id-301'>
      <!-- parameter of type 'const lttng_ust_lib_ring_buffer_config*' -->
      <parameter type-id='type-id-263'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-282'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_channel*) -->
    <function-type size-in-bits='64' id='type-id-302'>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-167'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ctx_field*) -->
    <function-type size-in-bits='64' id='type-id-303'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-176'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ctx_field*, lttng_ctx_value*) -->
    <function-type size-in-bits='64' id='type-id-304'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-176'/>
      <!-- parameter of type 'lttng_ctx_value*' -->
      <parameter type-id='type-id-270'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ctx_field*, lttng_ust_lib_ring_buffer_ctx*, lttng_channel*) -->
    <function-type size-in-bits='64' id='type-id-305'>
      <!-- parameter of type 'lttng_ctx_field*' -->
      <parameter type-id='type-id-176'/>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-277'/>
      <!-- parameter of type 'lttng_channel*' -->
      <parameter type-id='type-id-167'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer*, uint64_t, unsigned int, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-306'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'typedef uint64_t' -->
      <parameter type-id='type-id-82'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-57'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer*, uint64_t, unsigned int, unsigned long int, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-307'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'typedef uint64_t' -->
      <parameter type-id='type-id-82'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-57'/>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer*, void*, int, lttng_ust_shm_handle*) -->
    <function-type size-in-bits='64' id='type-id-308'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer*' -->
      <parameter type-id='type-id-95'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-112'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43'/>
      <!-- parameter of type 'lttng_ust_shm_handle*' -->
      <parameter type-id='type-id-94'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*) -->
    <function-type size-in-bits='64' id='type-id-309'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-277'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, const char*, size_t) -->
    <function-type size-in-bits='64' id='type-id-310'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-277'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- void (lttng_ust_lib_ring_buffer_ctx*, void*, size_t) -->
    <function-type size-in-bits='64' id='type-id-311'>
      <!-- parameter of type 'lttng_ust_lib_ring_buffer_ctx*' -->
      <parameter type-id='type-id-277'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-112'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64'/>
      <!-- void -->
      <return type-id='type-id-59'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-comm.c' comp-dir-path='liblttng-ust-comm' language='LANG_C99'>
    <!-- struct ustcomm_ust_msg -->
    <class-decl name='ustcomm_ust_msg' size-in-bits='4896' is-struct='yes' visibility='default' filepath='../include/ust-comm.h' line='82' column='1' id='type-id-313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t ustcomm_ust_msg::handle -->
        <var-decl name='handle' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ustcomm_ust_msg::cmd -->
        <var-decl name='cmd' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char ustcomm_ust_msg::padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/ust-comm.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {lttng_ust_channel channel; lttng_ust_stream stream; lttng_ust_event event; lttng_ust_context context; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} filter; struct {uint32_t count;} exclusion; char padding[32];} ustcomm_ust_msg::u -->
        <var-decl name='u' type-id='type-id-314' visibility='default' filepath='../include/ust-comm.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {lttng_ust_channel channel; lttng_ust_stream stream; lttng_ust_event event; lttng_ust_context context; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} filter; struct {uint32_t count;} exclusion; char padding[32];} -->
    <union-decl name='__anonymous_union__' size-in-bits='4576' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='86' column='1' id='type-id-314'>
      <data-member access='private'>
        <!-- lttng_ust_channel channel -->
        <var-decl name='channel' type-id='type-id-315' visibility='default' filepath='../include/ust-comm.h' line='87' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_stream stream -->
        <var-decl name='stream' type-id='type-id-316' visibility='default' filepath='../include/ust-comm.h' line='88' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_event event -->
        <var-decl name='event' type-id='type-id-250' visibility='default' filepath='../include/ust-comm.h' line='89' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_context context -->
        <var-decl name='context' type-id='type-id-317' visibility='default' filepath='../include/ust-comm.h' line='90' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracer_version version -->
        <var-decl name='version' type-id='type-id-239' visibility='default' filepath='../include/ust-comm.h' line='91' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracepoint_iter tracepoint -->
        <var-decl name='tracepoint' type-id='type-id-242' visibility='default' filepath='../include/ust-comm.h' line='92' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} filter -->
        <var-decl name='filter' type-id='type-id-318' visibility='default' filepath='../include/ust-comm.h' line='97' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t count;} exclusion -->
        <var-decl name='exclusion' type-id='type-id-319' visibility='default' filepath='../include/ust-comm.h' line='100' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/ust-comm.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_channel -->
    <class-decl name='lttng_ust_channel' size-in-bits='2400' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='83' column='1' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_channel::len -->
        <var-decl name='len' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-abi.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_chan_type lttng_ust_channel::type -->
        <var-decl name='type' type-id='type-id-174' visibility='default' filepath='../include/lttng/ust-abi.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_channel::padding[288] -->
        <var-decl name='padding' type-id='type-id-24' visibility='default' filepath='../include/lttng/ust-abi.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <!-- char lttng_ust_channel::data[] -->
        <var-decl name='data' type-id='type-id-40' visibility='default' filepath='../include/lttng/ust-abi.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_stream -->
    <class-decl name='lttng_ust_stream' size-in-bits='2400' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='91' column='1' id='type-id-316'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_stream::len -->
        <var-decl name='len' type-id='type-id-82' visibility='default' filepath='../include/lttng/ust-abi.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_stream::stream_nr -->
        <var-decl name='stream_nr' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_stream::padding[288] -->
        <var-decl name='padding' type-id='type-id-24' visibility='default' filepath='../include/lttng/ust-abi.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_context -->
    <class-decl name='lttng_ust_context' size-in-bits='2464' is-struct='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='154' column='1' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_context_type lttng_ust_context::ctx -->
        <var-decl name='ctx' type-id='type-id-246' visibility='default' filepath='../include/lttng/ust-abi.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_context::padding[16] -->
        <var-decl name='padding' type-id='type-id-10' visibility='default' filepath='../include/lttng/ust-abi.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- union {lttng_ust_perf_counter_ctx perf_counter; struct {uint32_t provider_name_len; uint32_t ctx_name_len;} app_ctx; char padding[288];} lttng_ust_context::u -->
        <var-decl name='u' type-id='type-id-320' visibility='default' filepath='../include/lttng/ust-abi.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {lttng_ust_perf_counter_ctx perf_counter; struct {uint32_t provider_name_len; uint32_t ctx_name_len;} app_ctx; char padding[288];} -->
    <union-decl name='__anonymous_union__1' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='158' column='1' id='type-id-320'>
      <data-member access='private'>
        <!-- lttng_ust_perf_counter_ctx perf_counter -->
        <var-decl name='perf_counter' type-id='type-id-248' visibility='default' filepath='../include/lttng/ust-abi.h' line='159' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t provider_name_len; uint32_t ctx_name_len;} app_ctx -->
        <var-decl name='app_ctx' type-id='type-id-321' visibility='default' filepath='../include/lttng/ust-abi.h' line='164' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-24' visibility='default' filepath='../include/lttng/ust-abi.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {uint32_t provider_name_len; uint32_t ctx_name_len;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/lttng/ust-abi.h' line='160' column='1' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t provider_name_len -->
        <var-decl name='provider_name_len' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ctx_name_len -->
        <var-decl name='ctx_name_len' type-id='type-id-62' visibility='default' filepath='../include/lttng/ust-abi.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t data_size; uint32_t reloc_offset; uint64_t seqnum;} -->
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='93' column='1' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t data_size -->
        <var-decl name='data_size' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t reloc_offset -->
        <var-decl name='reloc_offset' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t seqnum -->
        <var-decl name='seqnum' type-id='type-id-82' visibility='default' filepath='../include/ust-comm.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t count;} -->
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='98' column='1' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t count -->
        <var-decl name='count' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ustcomm_ust_reply -->
    <class-decl name='ustcomm_ust_reply' size-in-bits='2592' is-struct='yes' visibility='default' filepath='../include/ust-comm.h' line='111' column='1' id='type-id-322'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t ustcomm_ust_reply::handle -->
        <var-decl name='handle' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t ustcomm_ust_reply::cmd -->
        <var-decl name='cmd' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int32_t ustcomm_ust_reply::ret_code -->
        <var-decl name='ret_code' type-id='type-id-78' visibility='default' filepath='../include/ust-comm.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t ustcomm_ust_reply::ret_val -->
        <var-decl name='ret_val' type-id='type-id-62' visibility='default' filepath='../include/ust-comm.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char ustcomm_ust_reply::padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/ust-comm.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {struct {uint64_t memory_map_size;} channel; struct {uint64_t memory_map_size;} stream; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; char padding[32];} ustcomm_ust_reply::u -->
        <var-decl name='u' type-id='type-id-323' visibility='default' filepath='../include/ust-comm.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {uint64_t memory_map_size;} channel; struct {uint64_t memory_map_size;} stream; lttng_ust_tracer_version version; lttng_ust_tracepoint_iter tracepoint; char padding[32];} -->
    <union-decl name='__anonymous_union__2' size-in-bits='2208' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='117' column='1' id='type-id-323'>
      <data-member access='private'>
        <!-- struct {uint64_t memory_map_size;} channel -->
        <var-decl name='channel' type-id='type-id-324' visibility='default' filepath='../include/ust-comm.h' line='120' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint64_t memory_map_size;} stream -->
        <var-decl name='stream' type-id='type-id-325' visibility='default' filepath='../include/ust-comm.h' line='123' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracer_version version -->
        <var-decl name='version' type-id='type-id-239' visibility='default' filepath='../include/ust-comm.h' line='124' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_tracepoint_iter tracepoint -->
        <var-decl name='tracepoint' type-id='type-id-242' visibility='default' filepath='../include/ust-comm.h' line='125' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-30' visibility='default' filepath='../include/ust-comm.h' line='126' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {uint64_t memory_map_size;} -->
    <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='118' column='1' id='type-id-324'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-82' visibility='default' filepath='../include/ust-comm.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint64_t memory_map_size;} -->
    <class-decl name='__anonymous_struct__4' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../include/ust-comm.h' line='121' column='1' id='type-id-325'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-82' visibility='default' filepath='../include/ust-comm.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <!-- const lttng_ctx_field -->
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-326'/>
    <!-- const lttng_ctx_field* -->
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
    <!-- const lttng_event_field -->
    <qualified-type-def type-id='type-id-178' const='yes' id='type-id-328'/>
    <!-- const lttng_event_field* -->
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <!-- ustcomm_ust_msg* -->
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-330'/>
    <!-- ustcomm_ust_reply* -->
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-331'/>
    <!-- int ustcomm_setsockopt_snd_timeout(int, unsigned int) -->
    <function-decl name='ustcomm_setsockopt_snd_timeout' mangled-name='ustcomm_setsockopt_snd_timeout' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_setsockopt_snd_timeout'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1598' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-57' name='msec' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1598' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_setsockopt_rcv_timeout(int, unsigned int) -->
    <function-decl name='ustcomm_setsockopt_rcv_timeout' mangled-name='ustcomm_setsockopt_rcv_timeout' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_setsockopt_rcv_timeout'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1578' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-57' name='msec' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1578' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_register_channel(int, lttng_session*, int, int, size_t, const lttng_ctx_field*, uint32_t*, int*) -->
    <function-decl name='ustcomm_register_channel' mangled-name='ustcomm_register_channel' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_register_channel'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1471' column='1'/>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-171' name='session' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1472' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='session_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1473' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='channel_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1474' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='nr_ctx_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1475' column='1'/>
      <!-- parameter of type 'const lttng_ctx_field*' -->
      <parameter type-id='type-id-327' name='ctx_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1476' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='chan_id' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1477' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='header_type' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1478' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_register_enum(int, int, const char*, size_t, const lttng_enum_entry*, uint64_t*) -->
    <function-decl name='ustcomm_register_enum' mangled-name='ustcomm_register_enum' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_register_enum'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1367' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='session_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1368' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='enum_name' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1369' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='nr_entries' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1370' column='1'/>
      <!-- parameter of type 'const lttng_enum_entry*' -->
      <parameter type-id='type-id-199' name='lttng_entries' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1371' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='id' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1372' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_register_event(int, lttng_session*, int, int, const char*, int, const char*, size_t, const lttng_event_field*, const char*, uint32_t*) -->
    <function-decl name='ustcomm_register_event' mangled-name='ustcomm_register_event' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_register_event'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1224' column='1'/>
      <!-- parameter of type 'lttng_session*' -->
      <parameter type-id='type-id-171' name='session' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1225' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='session_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1226' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='channel_objd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1227' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='event_name' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1228' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='loglevel' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1229' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='signature' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1230' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='nr_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1231' column='1'/>
      <!-- parameter of type 'const lttng_event_field*' -->
      <parameter type-id='type-id-329' name='lttng_fields' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1232' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='model_emf_uri' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1233' column='1'/>
      <!-- parameter of type 'uint32_t*' -->
      <parameter type-id='type-id-288' name='id' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='1234' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_send_reg_msg(int, ustctl_socket_type, uint32_t, uint32_t, uint32_t, uint32_t, uint32_t, uint32_t) -->
    <function-decl name='ustcomm_send_reg_msg' mangled-name='ustcomm_send_reg_msg' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_reg_msg'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='715' column='1'/>
      <!-- parameter of type 'enum ustctl_socket_type' -->
      <parameter type-id='type-id-92' name='type' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='716' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='bits_per_long' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='717' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='uint8_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='718' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='uint16_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='719' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='uint32_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='720' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='uint64_t_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='721' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='long_alignment' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='722' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_recv_stream_from_sessiond(int, uint64_t*, int*, int*) -->
    <function-decl name='ustcomm_recv_stream_from_sessiond' mangled-name='ustcomm_recv_stream_from_sessiond' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_stream_from_sessiond'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='655' column='1'/>
      <!-- parameter of type 'uint64_t*' -->
      <parameter type-id='type-id-289' name='memory_map_size' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='656' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='shm_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='657' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='wakeup_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='657' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- ssize_t ustcomm_recv_channel_from_sessiond(int, void**, uint64_t, int*) -->
    <function-decl name='ustcomm_recv_channel_from_sessiond' mangled-name='ustcomm_recv_channel_from_sessiond' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_channel_from_sessiond'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='595' column='1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-115' name='_chan_data' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='596' column='1'/>
      <!-- parameter of type 'typedef uint64_t' -->
      <parameter type-id='type-id-82' name='var_len' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='596' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='_wakeup_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='597' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-107'/>
    </function-decl>
    <!-- int ustcomm_send_app_cmd(int, ustcomm_ust_msg*, ustcomm_ust_reply*) -->
    <function-decl name='ustcomm_send_app_cmd' mangled-name='ustcomm_send_app_cmd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_app_cmd'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='576' column='1'/>
      <!-- parameter of type 'ustcomm_ust_msg*' -->
      <parameter type-id='type-id-330' name='lum' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='577' column='1'/>
      <!-- parameter of type 'ustcomm_ust_reply*' -->
      <parameter type-id='type-id-331' name='lur' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='578' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_recv_app_reply(int, ustcomm_ust_reply*, uint32_t, uint32_t) -->
    <function-decl name='ustcomm_recv_app_reply' mangled-name='ustcomm_recv_app_reply' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_app_reply'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='536' column='1'/>
      <!-- parameter of type 'ustcomm_ust_reply*' -->
      <parameter type-id='type-id-331' name='lur' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='536' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='expected_handle' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='537' column='1'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='type-id-62' name='expected_cmd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='537' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_send_app_msg(int, ustcomm_ust_msg*) -->
    <function-decl name='ustcomm_send_app_msg' mangled-name='ustcomm_send_app_msg' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_app_msg'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='517' column='1'/>
      <!-- parameter of type 'ustcomm_ust_msg*' -->
      <parameter type-id='type-id-330' name='lum' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='517' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- ssize_t ustcomm_recv_fds_unix_sock(int, int*, size_t) -->
    <function-decl name='ustcomm_recv_fds_unix_sock' mangled-name='ustcomm_recv_fds_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_fds_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='fds' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='nb_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='447' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-107'/>
    </function-decl>
    <!-- ssize_t ustcomm_send_fds_unix_sock(int, int*, size_t) -->
    <function-decl name='ustcomm_send_fds_unix_sock' mangled-name='ustcomm_send_fds_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_fds_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-268' name='fds' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='nb_fd' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='387' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-107'/>
    </function-decl>
    <!-- ssize_t ustcomm_send_unix_sock(int, void*, size_t) -->
    <function-decl name='ustcomm_send_unix_sock' mangled-name='ustcomm_send_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_send_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-112' name='buf' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='len' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='341' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-107'/>
    </function-decl>
    <!-- ssize_t ustcomm_recv_unix_sock(int, void*, size_t) -->
    <function-decl name='ustcomm_recv_unix_sock' mangled-name='ustcomm_recv_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_recv_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-112' name='buf' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-64' name='len' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='291' column='1'/>
      <!-- typedef ssize_t -->
      <return type-id='type-id-107'/>
    </function-decl>
    <!-- int ustcomm_close_unix_sock(int) -->
    <function-decl name='ustcomm_close_unix_sock' mangled-name='ustcomm_close_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_close_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='266' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_listen_unix_sock(int) -->
    <function-decl name='ustcomm_listen_unix_sock' mangled-name='ustcomm_listen_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_listen_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='246' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_create_unix_sock(const char*) -->
    <function-decl name='ustcomm_create_unix_sock' mangled-name='ustcomm_create_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_create_unix_sock'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='pathname' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='200' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_accept_unix_sock(int) -->
    <function-decl name='ustcomm_accept_unix_sock' mangled-name='ustcomm_accept_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_accept_unix_sock'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-43' name='sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='176' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- int ustcomm_connect_unix_sock(const char*, long int) -->
    <function-decl name='ustcomm_connect_unix_sock' mangled-name='ustcomm_connect_unix_sock' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ustcomm_connect_unix_sock'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-184' name='pathname' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='101' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-46' name='timeout' filepath='liblttng-ust-comm/lttng-ust-comm.c' line='101' column='1'/>
      <!-- int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- const char* lttng_ust_strerror(int) -->
