<abi-corpus architecture='elf-amd-x86_64' soname='liblttng-ust-dl.so.1'>
  <elf-needed>
    <dependency name='liblttng-ust.so.1'/>
    <dependency name='liblttng-ust-tracepoint.so.1'/>
    <dependency name='liblttng-ust-common.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- dlclose -->
    <elf-symbol name='dlclose' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dlmopen -->
    <elf-symbol name='dlmopen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dlopen -->
    <elf-symbol name='dlopen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-dl.c' comp-dir-path='src/lib/lttng-ust-dl' language='LANG_C99'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-3'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-4'/>
    <!-- void -->
    <type-decl name='void' id='type-id-5'/>
    <!-- struct lttng_ust_tracepoint_dlopen -->
    <class-decl name='lttng_ust_tracepoint_dlopen' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='263' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_tracepoint_dlopen::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_tracepoint_dlopen::liblttngust_handle -->
        <var-decl name='liblttngust_handle' type-id='type-id-8' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int (lttng_ust_tracepoint* const*, int)* lttng_ust_tracepoint_dlopen::lttng_ust_tracepoint_module_register -->
        <var-decl name='lttng_ust_tracepoint_module_register' type-id='type-id-9' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int (lttng_ust_tracepoint* const*)* lttng_ust_tracepoint_dlopen::lttng_ust_tracepoint_module_unregister -->
        <var-decl name='lttng_ust_tracepoint_module_unregister' type-id='type-id-10' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_lock_sym -->
        <var-decl name='rcu_read_lock_sym' type-id='type-id-11' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_unlock_sym -->
        <var-decl name='rcu_read_unlock_sym' type-id='type-id-11' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void* (void*)* lttng_ust_tracepoint_dlopen::rcu_dereference_sym -->
        <var-decl name='rcu_dereference_sym' type-id='type-id-12' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint32_t uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-13' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-7'/>
    <!-- typedef unsigned int __uint32_t -->
    <typedef-decl name='__uint32_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-13'/>
    <!-- struct lttng_ust_tracepoint -->
    <class-decl name='lttng_ust_tracepoint' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='38' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_tracepoint::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* lttng_ust_tracepoint::provider_name -->
        <var-decl name='provider_name' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const char* lttng_ust_tracepoint::event_name -->
        <var-decl name='event_name' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int lttng_ust_tracepoint::state -->
        <var-decl name='state' type-id='type-id-2' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- lttng_ust_tracepoint_probe* lttng_ust_tracepoint::probes -->
        <var-decl name='probes' type-id='type-id-16' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int* lttng_ust_tracepoint::tracepoint_provider_ref -->
        <var-decl name='tracepoint_provider_ref' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- const char* lttng_ust_tracepoint::signature -->
        <var-decl name='signature' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_probe -->
    <class-decl name='lttng_ust_tracepoint_probe' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='21' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* lttng_ust_tracepoint_probe::func -->
        <var-decl name='func' type-id='type-id-11' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_tracepoint_probe::data -->
        <var-decl name='data' type-id='type-id-8' visibility='default' filepath='../../../include/lttng/tracepoint-types.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_destructors_syms -->
    <class-decl name='lttng_ust_tracepoint_destructors_syms' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='320' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_tracepoint_destructors_syms::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void ()* lttng_ust_tracepoint_destructors_syms::tracepoint_disable_destructors -->
        <var-decl name='tracepoint_disable_destructors' type-id='type-id-11' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int ()* lttng_ust_tracepoint_destructors_syms::tracepoint_get_destructors_state -->
        <var-decl name='tracepoint_get_destructors_state' type-id='type-id-20' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='324' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int Lmid_t -->
    <typedef-decl name='Lmid_t' type-id='type-id-3' filepath='/usr/include/dlfcn.h' line='44' column='1' id='type-id-21'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-22'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-15'/>
    <!-- int ()* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-20'/>
    <!-- int (lttng_ust_tracepoint* const*)* -->
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-10'/>
    <!-- int (lttng_ust_tracepoint* const*, int)* -->
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-9'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-17'/>
    <!-- lttng_ust_tracepoint* -->
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <!-- lttng_ust_tracepoint* const -->
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-27'/>
    <!-- lttng_ust_tracepoint* const* -->
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <!-- lttng_ust_tracepoint_destructors_syms* -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-29'/>
    <!-- lttng_ust_tracepoint_dlopen* -->
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-30'/>
    <!-- lttng_ust_tracepoint_probe* -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-16'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-11'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-8'/>
    <!-- void* (void*)* -->
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-12'/>
    <!-- lttng_ust_tracepoint_dlopen lttng_ust_tracepoint_dlopen -->
    <var-decl name='lttng_ust_tracepoint_dlopen' type-id='type-id-6' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='278' column='1'/>
    <!-- lttng_ust_tracepoint_dlopen* lttng_ust_tracepoint_dlopen_ptr -->
    <var-decl name='lttng_ust_tracepoint_dlopen_ptr' type-id='type-id-30' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='279' column='1'/>
    <!-- lttng_ust_tracepoint_destructors_syms lttng_ust_tracepoint_destructors_syms -->
    <var-decl name='lttng_ust_tracepoint_destructors_syms' type-id='type-id-19' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='329' column='1'/>
    <!-- lttng_ust_tracepoint_destructors_syms* lttng_ust_tracepoint_destructors_syms_ptr -->
    <var-decl name='lttng_ust_tracepoint_destructors_syms_ptr' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/tracepoint.h' line='330' column='1'/>
    <!-- lttng_ust_tracepoint lttng_ust_tracepoint_lttng_ust_dl___dlopen -->
    <var-decl name='lttng_ust_tracepoint_lttng_ust_dl___dlopen' type-id='type-id-14' visibility='default' filepath='src/lib/lttng-ust-dl/ust_dl.h' line='25' column='1'/>
    <!-- lttng_ust_tracepoint lttng_ust_tracepoint_lttng_ust_dl___dlmopen -->
    <var-decl name='lttng_ust_tracepoint_lttng_ust_dl___dlmopen' type-id='type-id-14' visibility='default' filepath='src/lib/lttng-ust-dl/ust_dl.h' line='41' column='1'/>
    <!-- lttng_ust_tracepoint lttng_ust_tracepoint_lttng_ust_dl___build_id -->
    <var-decl name='lttng_ust_tracepoint_lttng_ust_dl___build_id' type-id='type-id-14' visibility='default' filepath='src/lib/lttng-ust-dl/ust_dl.h' line='59' column='1'/>
    <!-- lttng_ust_tracepoint lttng_ust_tracepoint_lttng_ust_dl___debug_link -->
    <var-decl name='lttng_ust_tracepoint_lttng_ust_dl___debug_link' type-id='type-id-14' visibility='default' filepath='src/lib/lttng-ust-dl/ust_dl.h' line='74' column='1'/>
    <!-- lttng_ust_tracepoint lttng_ust_tracepoint_lttng_ust_dl___dlclose -->
    <var-decl name='lttng_ust_tracepoint_lttng_ust_dl___dlclose' type-id='type-id-14' visibility='default' filepath='src/lib/lttng-ust-dl/ust_dl.h' line='89' column='1'/>
    <!-- int dlclose(void*) -->
    <function-decl name='dlclose' mangled-name='dlclose' filepath='/usr/include/dlfcn.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlclose'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8' name='handle' filepath='src/lib/lttng-ust-dl/lttng-ust-dl.c' line='248' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- void* dlmopen(Lmid_t, const char*, int) -->
    <function-decl name='dlmopen' mangled-name='dlmopen' filepath='/usr/include/dlfcn.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlmopen'>
      <!-- parameter of type 'typedef Lmid_t' -->
      <parameter type-id='type-id-21' name='nsid' filepath='src/lib/lttng-ust-dl/lttng-ust-dl.c' line='226' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='filename' filepath='src/lib/lttng-ust-dl/lttng-ust-dl.c' line='226' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='flags' filepath='src/lib/lttng-ust-dl/lttng-ust-dl.c' line='226' column='1'/>
      <!-- void* -->
      <return type-id='type-id-8'/>
    </function-decl>
    <!-- void* dlopen(const char*, int) -->
    <function-decl name='dlopen' mangled-name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='filename' filepath='src/lib/lttng-ust-dl/lttng-ust-dl.c' line='206' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='flags' filepath='src/lib/lttng-ust-dl/lttng-ust-dl.c' line='206' column='1'/>
      <!-- void* -->
      <return type-id='type-id-8'/>
    </function-decl>
    <!-- int () -->
    <function-type size-in-bits='64' id='type-id-23'>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-type>
    <!-- int (lttng_ust_tracepoint* const*) -->
    <function-type size-in-bits='64' id='type-id-24'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-28'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-type>
    <!-- int (lttng_ust_tracepoint* const*, int) -->
    <function-type size-in-bits='64' id='type-id-25'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-31'>
      <!-- void -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- void* (void*) -->
    <function-type size-in-bits='64' id='type-id-32'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8'/>
      <!-- void* -->
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='ust_dl.c' comp-dir-path='src/lib/lttng-ust-dl' language='LANG_C99'>
    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-33'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-34'/>
    <!-- struct lttng_ust_probe_desc -->
    <class-decl name='lttng_ust_probe_desc' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='315' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_probe_desc::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-events.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* lttng_ust_probe_desc::provider_name -->
        <var-decl name='provider_name' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/ust-events.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const lttng_ust_event_desc* const* lttng_ust_probe_desc::event_desc -->
        <var-decl name='event_desc' type-id='type-id-36' visibility='default' filepath='../../../include/lttng/ust-events.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int lttng_ust_probe_desc::nr_events -->
        <var-decl name='nr_events' type-id='type-id-4' visibility='default' filepath='../../../include/lttng/ust-events.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t lttng_ust_probe_desc::major -->
        <var-decl name='major' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-events.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t lttng_ust_probe_desc::minor -->
        <var-decl name='minor' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-events.h' line='322' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_desc -->
    <class-decl name='lttng_ust_event_desc' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='294' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_event_desc::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-events.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* lttng_ust_event_desc::event_name -->
        <var-decl name='event_name' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/ust-events.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const lttng_ust_probe_desc* lttng_ust_event_desc::probe_desc -->
        <var-decl name='probe_desc' type-id='type-id-38' visibility='default' filepath='../../../include/lttng/ust-events.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- const lttng_ust_tracepoint_class* lttng_ust_event_desc::tp_class -->
        <var-decl name='tp_class' type-id='type-id-39' visibility='default' filepath='../../../include/lttng/ust-events.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const int** lttng_ust_event_desc::loglevel -->
        <var-decl name='loglevel' type-id='type-id-40' visibility='default' filepath='../../../include/lttng/ust-events.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- const char** lttng_ust_event_desc::model_emf_uri -->
        <var-decl name='model_emf_uri' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-events.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_class -->
    <class-decl name='lttng_ust_tracepoint_class' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='273' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_tracepoint_class::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-events.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const lttng_ust_event_field* const* lttng_ust_tracepoint_class::fields -->
        <var-decl name='fields' type-id='type-id-43' visibility='default' filepath='../../../include/lttng/ust-events.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t lttng_ust_tracepoint_class::nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-44' visibility='default' filepath='../../../include/lttng/ust-events.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* lttng_ust_tracepoint_class::probe_callback -->
        <var-decl name='probe_callback' type-id='type-id-11' visibility='default' filepath='../../../include/lttng/ust-events.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const char* lttng_ust_tracepoint_class::signature -->
        <var-decl name='signature' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/ust-events.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- const lttng_ust_probe_desc* lttng_ust_tracepoint_class::probe_desc -->
        <var-decl name='probe_desc' type-id='type-id-38' visibility='default' filepath='../../../include/lttng/ust-events.h' line='280' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_field -->
    <class-decl name='lttng_ust_event_field' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='250' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_event_field::struct_size -->
        <var-decl name='struct_size' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-events.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* lttng_ust_event_field::name -->
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='../../../include/lttng/ust-events.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const lttng_ust_type_common* lttng_ust_event_field::type -->
        <var-decl name='type' type-id='type-id-46' visibility='default' filepath='../../../include/lttng/ust-events.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_ust_event_field::nowrite -->
        <var-decl name='nowrite' type-id='type-id-4' visibility='default' filepath='../../../include/lttng/ust-events.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <!-- unsigned int lttng_ust_event_field::nofilter -->
        <var-decl name='nofilter' type-id='type-id-4' visibility='default' filepath='../../../include/lttng/ust-events.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_type_common -->
    <class-decl name='lttng_ust_type_common' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='110' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_type lttng_ust_type_common::type -->
        <var-decl name='type' type-id='type-id-48' visibility='default' filepath='../../../include/lttng/ust-events.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_type -->
    <enum-decl name='lttng_ust_type' filepath='../../../include/lttng/ust-events.h' line='56' column='1' id='type-id-48'>
      <underlying-type type-id='type-id-33'/>
      <enumerator name='lttng_ust_type_integer' value='0'/>
      <enumerator name='lttng_ust_type_string' value='1'/>
      <enumerator name='lttng_ust_type_float' value='2'/>
      <enumerator name='lttng_ust_type_dynamic' value='3'/>
      <enumerator name='lttng_ust_type_enum' value='4'/>
      <enumerator name='lttng_ust_type_array' value='5'/>
      <enumerator name='lttng_ust_type_sequence' value='6'/>
      <enumerator name='lttng_ust_type_struct' value='7'/>
      <enumerator name='NR_LTTNG_UST_TYPE' value='8'/>
    </enum-decl>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-34' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/10.2.0/include/stddef.h' line='209' column='1' id='type-id-44'/>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-41'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-49'/>
    <!-- const int* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <!-- const int** -->
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-40'/>
    <!-- const lttng_ust_event_desc -->
    <qualified-type-def type-id='type-id-37' const='yes' id='type-id-51'/>
    <!-- const lttng_ust_event_desc* -->
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <!-- const lttng_ust_event_desc* const -->
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-53'/>
    <!-- const lttng_ust_event_desc* const* -->
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-36'/>
    <!-- const lttng_ust_event_field -->
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-54'/>
    <!-- const lttng_ust_event_field* -->
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <!-- const lttng_ust_event_field* const -->
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-56'/>
    <!-- const lttng_ust_event_field* const* -->
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-43'/>
    <!-- const lttng_ust_probe_desc -->
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-57'/>
    <!-- const lttng_ust_probe_desc* -->
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-38'/>
    <!-- const lttng_ust_tracepoint_class -->
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-58'/>
    <!-- const lttng_ust_tracepoint_class* -->
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-39'/>
    <!-- const lttng_ust_type_common -->
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-59'/>
    <!-- const lttng_ust_type_common* -->
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-46'/>
    <!-- const lttng_ust_probe_desc lttng_ust__probe_desc___lttng_ust_dl -->
    <var-decl name='lttng_ust__probe_desc___lttng_ust_dl' type-id='type-id-57' visibility='default' filepath='../../../include/lttng/ust-tracepoint-event.h' line='342' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='logging.c' comp-dir-path='src/common' language='LANG_C99'>
    <!-- int lttng_ust_log_level -->
    <var-decl name='lttng_ust_log_level' type-id='type-id-2' visibility='default' filepath='../../src/common/logging.h' line='38' column='1'/>
    <!-- int lttng_ust_log_critical_action -->
    <var-decl name='lttng_ust_log_critical_action' type-id='type-id-2' visibility='default' filepath='../../src/common/logging.h' line='41' column='1'/>
  </abi-instr>
</abi-corpus>
