<abi-corpus architecture='elf-amd-x86_64' soname='liblttng-ust-ctl.so.5'>
  <elf-needed>
    <dependency name='liblttng-ust-common.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- lttng_ust_ctl_add_context -->
    <elf-symbol name='lttng_ust_ctl_add_context' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_calibrate -->
    <elf-symbol name='lttng_ust_ctl_calibrate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_channel_close_wait_fd -->
    <elf-symbol name='lttng_ust_ctl_channel_close_wait_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_channel_close_wakeup_fd -->
    <elf-symbol name='lttng_ust_ctl_channel_close_wakeup_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_channel_get_wait_fd -->
    <elf-symbol name='lttng_ust_ctl_channel_get_wait_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_channel_get_wakeup_fd -->

    <elf-symbol name='lttng_ust_ctl_snapshot_sample_positions' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_sock_flush_buffer -->
    <elf-symbol name='lttng_ust_ctl_sock_flush_buffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_start_session -->
    <elf-symbol name='lttng_ust_ctl_start_session' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_stop_session -->
    <elf-symbol name='lttng_ust_ctl_stop_session' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_stream_close_wait_fd -->
    <elf-symbol name='lttng_ust_ctl_stream_close_wait_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_stream_close_wakeup_fd -->
    <elf-symbol name='lttng_ust_ctl_stream_close_wakeup_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_stream_get_wait_fd -->
    <elf-symbol name='lttng_ust_ctl_stream_get_wait_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_stream_get_wakeup_fd -->
    <elf-symbol name='lttng_ust_ctl_stream_get_wakeup_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_tracepoint_field_list -->
    <elf-symbol name='lttng_ust_ctl_tracepoint_field_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_tracepoint_field_list_get -->
    <elf-symbol name='lttng_ust_ctl_tracepoint_field_list_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_tracepoint_list -->
    <elf-symbol name='lttng_ust_ctl_tracepoint_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_tracepoint_list_get -->
    <elf-symbol name='lttng_ust_ctl_tracepoint_list_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_tracer_version -->
    <elf-symbol name='lttng_ust_ctl_tracer_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_wait_quiescent -->
    <elf-symbol name='lttng_ust_ctl_wait_quiescent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_write_metadata_to_channel -->
    <elf-symbol name='lttng_ust_ctl_write_metadata_to_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- lttng_ust_ctl_write_one_packet_to_channel -->
    <elf-symbol name='lttng_ust_ctl_write_one_packet_to_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='ustctl.c' comp-dir-path='src/lib/lttng-ust-ctl' language='LANG_C99'>


















    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <!-- cds_hlist_head[4096] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='262144' id='type-id-3'>
      <!-- <anonymous range>[4096] -->
      <subrange length='4096' type-id='type-id-4' id='type-id-5'/>

    </array-type-def>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <!-- char[15] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='120' id='type-id-7'>
      <!-- <anonymous range>[15] -->
      <subrange length='15' type-id='type-id-4' id='type-id-8'/>

    </array-type-def>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-9'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-4' id='type-id-10'/>

    </array-type-def>
    <!-- char[20] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-11'>
      <!-- <anonymous range>[20] -->
      <subrange length='20' type-id='type-id-4' id='type-id-12'/>

    </array-type-def>
    <!-- char[24] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='192' id='type-id-13'>
      <!-- <anonymous range>[24] -->
      <subrange length='24' type-id='type-id-4' id='type-id-14'/>

    </array-type-def>
    <!-- char[255] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2040' id='type-id-15'>
      <!-- <anonymous range>[255] -->
      <subrange length='255' type-id='type-id-4' id='type-id-16'/>

    </array-type-def>
    <!-- char[256] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-17'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='type-id-4' id='type-id-18'/>

    </array-type-def>
    <!-- char[256][] -->
    <array-type-def dimensions='2' type-id='type-id-6' size-in-bits='infinite' id='type-id-19'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='type-id-4' id='type-id-18'/>

      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-4' id='type-id-20'/>

    </array-type-def>
    <!-- char[284] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2272' id='type-id-21'>
      <!-- <anonymous range>[284] -->
      <subrange length='284' type-id='type-id-4' id='type-id-22'/>

    </array-type-def>
    <!-- char[288] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2304' id='type-id-23'>
      <!-- <anonymous range>[288] -->
      <subrange length='288' type-id='type-id-4' id='type-id-24'/>

    </array-type-def>
    <!-- char[28] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='224' id='type-id-25'>
      <!-- <anonymous range>[28] -->
      <subrange length='28' type-id='type-id-4' id='type-id-26'/>

    </array-type-def>
    <!-- char[296] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2368' id='type-id-27'>
      <!-- <anonymous range>[296] -->
      <subrange length='296' type-id='type-id-4' id='type-id-28'/>

    </array-type-def>
    <!-- char[32] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='256' id='type-id-29'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='type-id-4' id='type-id-30'/>

    </array-type-def>
    <!-- char[592] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='4736' id='type-id-31'>
      <!-- <anonymous range>[592] -->
      <subrange length='592' type-id='type-id-4' id='type-id-32'/>

    </array-type-def>
    <!-- char[60] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='480' id='type-id-33'>
      <!-- <anonymous range>[60] -->
      <subrange length='60' type-id='type-id-4' id='type-id-34'/>

    </array-type-def>
    <!-- char[64] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='512' id='type-id-35'>
      <!-- <anonymous range>[64] -->
      <subrange length='64' type-id='type-id-4' id='type-id-36'/>

    </array-type-def>
    <!-- char[8] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='64' id='type-id-37'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='type-id-4' id='type-id-38'/>

    </array-type-def>
    <!-- char[] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-39'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-4' id='type-id-20'/>

    </array-type-def>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' id='type-id-40'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-41'/>
    <!-- int[2] -->
    <array-type-def dimensions='1' type-id='type-id-41' size-in-bits='64' id='type-id-42'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-43'/>

    </array-type-def>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-44'/>
    <!-- lttng_counter_shm_object[] -->
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='infinite' id='type-id-46'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-4' id='type-id-20'/>

    </array-type-def>
    <!-- lttng_ust_ctl_counter_dimension[8] -->
    <array-type-def dimensions='1' type-id='type-id-47' size-in-bits='2048' id='type-id-48'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='type-id-4' id='type-id-38'/>

    </array-type-def>
    <!-- lttng_ust_ring_buffer_shmp[] -->
    <array-type-def dimensions='1' type-id='type-id-49' size-in-bits='infinite' id='type-id-50'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-4' id='type-id-20'/>

    </array-type-def>
    <!-- shm_object[] -->
    <array-type-def dimensions='1' type-id='type-id-51' size-in-bits='infinite' id='type-id-52'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' type-id='type-id-4' id='type-id-20'/>

    </array-type-def>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='type-id-53'/>
    <!-- signed char -->
    <type-decl name='signed char' size-in-bits='8' id='type-id-54'/>
    <!-- uint8_t[16] -->
    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='128' id='type-id-56'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-4' id='type-id-10'/>

    </array-type-def>
    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-57'/>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-58'/>
    <!-- unsigned char[16] -->
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='128' id='type-id-59'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-4' id='type-id-10'/>

    </array-type-def>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-60'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-61'/>
    <!-- void -->
    <type-decl name='void' id='type-id-62'/>
    <!-- struct lttng_ust_ctl_daemon_counter -->
    <class-decl name='lttng_ust_ctl_daemon_counter' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='83' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lib_counter* lttng_ust_ctl_daemon_counter::counter -->
        <var-decl name='counter' type-id='type-id-64' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const lttng_counter_ops* lttng_ust_ctl_daemon_counter::ops -->
        <var-decl name='ops' type-id='type-id-65' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_ctl_counter_attr* lttng_ust_ctl_daemon_counter::attr -->
        <var-decl name='attr' type-id='type-id-66' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lib_counter -->
    <class-decl name='lib_counter' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='47' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- size_t lib_counter::nr_dimensions -->
        <var-decl name='nr_dimensions' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int64_t lib_counter::allocated_elem -->
        <var-decl name='allocated_elem' type-id='type-id-69' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lib_counter_dimension* lib_counter::dimensions -->
        <var-decl name='dimensions' type-id='type-id-70' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lib_counter_arithmetic lib_counter::arithmetic -->
        <var-decl name='arithmetic' type-id='type-id-71' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- union {struct {int32_t max; int32_t min;} limits_32_bit; struct {int64_t max; int64_t min;} limits_64_bit;} lib_counter::saturation -->
        <var-decl name='saturation' type-id='type-id-72' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {int8_t s8; int16_t s16; int32_t s32; int64_t s64;} lib_counter::global_sum_step -->
        <var-decl name='global_sum_step' type-id='type-id-73' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- lib_counter_config lib_counter::config -->
        <var-decl name='config' type-id='type-id-74' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- lib_counter_layout lib_counter::global_counters -->
        <var-decl name='global_counters' type-id='type-id-75' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- lib_counter_layout* lib_counter::percpu_counters -->
        <var-decl name='percpu_counters' type-id='type-id-76' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- bool lib_counter::is_daemon -->
        <var-decl name='is_daemon' type-id='type-id-1' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- lttng_counter_shm_object_table* lib_counter::object_table -->
        <var-decl name='object_table' type-id='type-id-77' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/10.2.0/include/stddef.h' line='209' column='1' id='type-id-68'/>
    <!-- typedef __int64_t int64_t -->
    <typedef-decl name='int64_t' type-id='type-id-78' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-69'/>
    <!-- typedef long int __int64_t -->
    <typedef-decl name='__int64_t' type-id='type-id-44' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-78'/>
    <!-- struct lib_counter_dimension -->
    <class-decl name='lib_counter_dimension' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='20' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- size_t lib_counter_dimension::max_nr_elem -->
        <var-decl name='max_nr_elem' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t lib_counter_dimension::stride -->
        <var-decl name='stride' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lib_counter_arithmetic -->
    <enum-decl name='lib_counter_arithmetic' filepath='../../../src/common/counter/counter-types.h' line='42' column='1' id='type-id-71'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LIB_COUNTER_ARITHMETIC_MODULAR' value='0'/>
      <enumerator name='LIB_COUNTER_ARITHMETIC_SATURATE' value='1'/>
    </enum-decl>
    <!-- union {struct {int32_t max; int32_t min;} limits_32_bit; struct {int64_t max; int64_t min;} limits_64_bit;} -->
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='52' column='1' id='type-id-72'>
      <data-member access='private'>
        <!-- struct {int32_t max; int32_t min;} limits_32_bit -->
        <var-decl name='limits_32_bit' type-id='type-id-80' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='55' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int64_t max; int64_t min;} limits_64_bit -->
        <var-decl name='limits_64_bit' type-id='type-id-81' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='58' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {int32_t max; int32_t min;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='53' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t max -->
        <var-decl name='max' type-id='type-id-82' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int32_t min -->
        <var-decl name='min' type-id='type-id-82' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __int32_t int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-83' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-82'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-83'/>
    <!-- struct {int64_t max; int64_t min;} -->
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='56' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int64_t max -->
        <var-decl name='max' type-id='type-id-69' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int64_t min -->
        <var-decl name='min' type-id='type-id-69' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {int8_t s8; int16_t s16; int32_t s32; int64_t s64;} -->
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='60' column='1' id='type-id-73'>
      <data-member access='private'>
        <!-- int8_t s8 -->
        <var-decl name='s8' type-id='type-id-84' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='61' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- int16_t s16 -->
        <var-decl name='s16' type-id='type-id-85' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='62' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- int32_t s32 -->
        <var-decl name='s32' type-id='type-id-82' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='63' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- int64_t s64 -->
        <var-decl name='s64' type-id='type-id-69' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='64' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef __int8_t int8_t -->
    <typedef-decl name='int8_t' type-id='type-id-86' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' id='type-id-84'/>
    <!-- typedef signed char __int8_t -->
    <typedef-decl name='__int8_t' type-id='type-id-54' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-86'/>
    <!-- typedef __int16_t int16_t -->
    <typedef-decl name='int16_t' type-id='type-id-87' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-85'/>
    <!-- typedef short int __int16_t -->
    <typedef-decl name='__int16_t' type-id='type-id-53' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-87'/>
    <!-- struct lib_counter_config -->
    <class-decl name='lib_counter_config' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/counter/counter-config.h' line='24' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lib_counter_config::alloc -->
        <var-decl name='alloc' type-id='type-id-88' visibility='default' filepath='../../../src/common/counter/counter-config.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- lib_counter_config_sync lib_counter_config::sync -->
        <var-decl name='sync' type-id='type-id-89' visibility='default' filepath='../../../src/common/counter/counter-config.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __anonymous_enum__ lib_counter_config::arithmetic -->
        <var-decl name='arithmetic' type-id='type-id-90' visibility='default' filepath='../../../src/common/counter/counter-config.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- __anonymous_enum__1 lib_counter_config::counter_size -->
        <var-decl name='counter_size' type-id='type-id-91' visibility='default' filepath='../../../src/common/counter/counter-config.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint32_t uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-92' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-88'/>
    <!-- typedef unsigned int __uint32_t -->
    <typedef-decl name='__uint32_t' type-id='type-id-60' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-92'/>
    <!-- enum lib_counter_config_sync -->
    <enum-decl name='lib_counter_config_sync' filepath='../../../src/common/counter/counter-config.h' line='19' column='1' id='type-id-89'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='COUNTER_SYNC_PER_CPU' value='0'/>
      <enumerator name='COUNTER_SYNC_GLOBAL' value='1'/>
    </enum-decl>
    <!-- enum __anonymous_enum__ -->
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../../src/common/counter/counter-config.h' line='27' column='1' id='type-id-90'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='COUNTER_ARITHMETIC_MODULAR' value='0'/>
      <enumerator name='COUNTER_ARITHMETIC_SATURATE' value='1'/>
    </enum-decl>
    <!-- enum __anonymous_enum__1 -->
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../../src/common/counter/counter-config.h' line='31' column='1' id='type-id-91'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='COUNTER_SIZE_8_BIT' value='1'/>
      <enumerator name='COUNTER_SIZE_16_BIT' value='2'/>
      <enumerator name='COUNTER_SIZE_32_BIT' value='4'/>
      <enumerator name='COUNTER_SIZE_64_BIT' value='8'/>
    </enum-decl>
    <!-- struct lib_counter_layout -->
    <class-decl name='lib_counter_layout' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='33' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* lib_counter_layout::counters -->
        <var-decl name='counters' type-id='type-id-93' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned long int* lib_counter_layout::overflow_bitmap -->
        <var-decl name='overflow_bitmap' type-id='type-id-94' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned long int* lib_counter_layout::underflow_bitmap -->
        <var-decl name='underflow_bitmap' type-id='type-id-94' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int lib_counter_layout::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- size_t lib_counter_layout::shm_len -->
        <var-decl name='shm_len' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_counter_shm_handle lib_counter_layout::handle -->
        <var-decl name='handle' type-id='type-id-95' visibility='default' filepath='../../../src/common/counter/counter-types.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_counter_shm_handle -->
    <class-decl name='lttng_counter_shm_handle' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='36' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_counter_shm_object_table* lttng_counter_shm_handle::table -->
        <var-decl name='table' type-id='type-id-77' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_counter_shm_object_table -->
    <class-decl name='lttng_counter_shm_object_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='30' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- size_t lttng_counter_shm_object_table::size -->
        <var-decl name='size' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t lttng_counter_shm_object_table::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_counter_shm_object lttng_counter_shm_object_table::objects[] -->
        <var-decl name='objects' type-id='type-id-46' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_counter_shm_object -->
    <class-decl name='lttng_counter_shm_object' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='20' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_counter_shm_object_type lttng_counter_shm_object::type -->
        <var-decl name='type' type-id='type-id-97' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t lttng_counter_shm_object::index -->
        <var-decl name='index' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int lttng_counter_shm_object::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- char* lttng_counter_shm_object::memory_map -->
        <var-decl name='memory_map' type-id='type-id-98' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- size_t lttng_counter_shm_object::memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-68' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint64_t lttng_counter_shm_object::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-99' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- int lttng_counter_shm_object::shm_fd_ownership -->
        <var-decl name='shm_fd_ownership' type-id='type-id-41' visibility='default' filepath='../../../src/common/counter/shm_types.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_counter_shm_object_type -->
    <enum-decl name='lttng_counter_shm_object_type' filepath='../../../src/common/counter/shm_types.h' line='15' column='1' id='type-id-97'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_COUNTER_SHM_OBJECT_SHM' value='0'/>
      <enumerator name='LTTNG_COUNTER_SHM_OBJECT_MEM' value='1'/>
    </enum-decl>
    <!-- typedef __uint64_t uint64_t -->
    <typedef-decl name='uint64_t' type-id='type-id-100' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-99'/>
    <!-- typedef unsigned long int __uint64_t -->
    <typedef-decl name='__uint64_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-100'/>
    <!-- struct lttng_counter_ops -->
    <class-decl name='lttng_counter_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='190' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lib_counter* (typedef size_t, const lttng_counter_dimension*, typedef int64_t, int, int, const int*, bool)* lttng_counter_ops::counter_create -->
        <var-decl name='counter_create' type-id='type-id-102' visibility='default' filepath='../../../src/common/events.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (lib_counter*)* lttng_counter_ops::counter_destroy -->
        <var-decl name='counter_destroy' type-id='type-id-103' visibility='default' filepath='../../../src/common/events.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int (lib_counter*, const size_t*, typedef int64_t)* lttng_counter_ops::counter_add -->
        <var-decl name='counter_add' type-id='type-id-104' visibility='default' filepath='../../../src/common/events.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int (lib_counter*, const size_t*, int, int64_t*, bool*, bool*)* lttng_counter_ops::counter_read -->
        <var-decl name='counter_read' type-id='type-id-105' visibility='default' filepath='../../../src/common/events.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int (lib_counter*, const size_t*, int64_t*, bool*, bool*)* lttng_counter_ops::counter_aggregate -->
        <var-decl name='counter_aggregate' type-id='type-id-106' visibility='default' filepath='../../../src/common/events.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int (lib_counter*, const size_t*)* lttng_counter_ops::counter_clear -->
        <var-decl name='counter_clear' type-id='type-id-107' visibility='default' filepath='../../../src/common/events.h' line='207' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_counter_dimension -->
    <class-decl name='lttng_counter_dimension' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='182' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_counter_dimension::size -->
        <var-decl name='size' type-id='type-id-99' visibility='default' filepath='../../../src/common/events.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_counter_dimension::underflow_index -->
        <var-decl name='underflow_index' type-id='type-id-99' visibility='default' filepath='../../../src/common/events.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint64_t lttng_counter_dimension::overflow_index -->
        <var-decl name='overflow_index' type-id='type-id-99' visibility='default' filepath='../../../src/common/events.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint8_t lttng_counter_dimension::has_underflow -->
        <var-decl name='has_underflow' type-id='type-id-55' visibility='default' filepath='../../../src/common/events.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <!-- uint8_t lttng_counter_dimension::has_overflow -->
        <var-decl name='has_overflow' type-id='type-id-55' visibility='default' filepath='../../../src/common/events.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint8_t uint8_t -->
    <typedef-decl name='uint8_t' type-id='type-id-109' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-55'/>
    <!-- typedef unsigned char __uint8_t -->
    <typedef-decl name='__uint8_t' type-id='type-id-58' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-109'/>
    <!-- struct lttng_ust_ctl_counter_attr -->
    <class-decl name='lttng_ust_ctl_counter_attr' size-in-bits='2304' is-struct='yes' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='71' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctl_counter_arithmetic lttng_ust_ctl_counter_attr::arithmetic -->
        <var-decl name='arithmetic' type-id='type-id-111' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- lttng_ust_ctl_counter_bitness lttng_ust_ctl_counter_attr::bitness -->
        <var-decl name='bitness' type-id='type-id-112' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_ctl_counter_attr::nr_dimensions -->
        <var-decl name='nr_dimensions' type-id='type-id-88' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int64_t lttng_ust_ctl_counter_attr::global_sum_step -->
        <var-decl name='global_sum_step' type-id='type-id-69' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_ctl_counter_dimension lttng_ust_ctl_counter_attr::dimensions[8] -->
        <var-decl name='dimensions' type-id='type-id-48' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <!-- bool lttng_ust_ctl_counter_attr::coalesce_hits -->
        <var-decl name='coalesce_hits' type-id='type-id-1' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_ctl_counter_arithmetic -->
    <enum-decl name='lttng_ust_ctl_counter_arithmetic' filepath='../../../include/lttng/ust-ctl.h' line='588' column='1' id='type-id-111'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_CTL_COUNTER_ARITHMETIC_MODULAR' value='0'/>
      <enumerator name='LTTNG_UST_CTL_COUNTER_ARITHMETIC_SATURATION' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_ctl_counter_bitness -->
    <enum-decl name='lttng_ust_ctl_counter_bitness' filepath='../../../include/lttng/ust-ctl.h' line='583' column='1' id='type-id-112'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_CTL_COUNTER_BITNESS_32' value='0'/>
      <enumerator name='LTTNG_UST_CTL_COUNTER_BITNESS_64' value='1'/>
    </enum-decl>
    <!-- struct lttng_ust_ctl_counter_dimension -->
    <class-decl name='lttng_ust_ctl_counter_dimension' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='603' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_ctl_counter_dimension::size -->
        <var-decl name='size' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_ctl_counter_dimension::underflow_index -->
        <var-decl name='underflow_index' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint64_t lttng_ust_ctl_counter_dimension::overflow_index -->
        <var-decl name='overflow_index' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint8_t lttng_ust_ctl_counter_dimension::has_underflow -->
        <var-decl name='has_underflow' type-id='type-id-55' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <!-- uint8_t lttng_ust_ctl_counter_dimension::has_overflow -->
        <var-decl name='has_overflow' type-id='type-id-55' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='608' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_object_data -->
    <class-decl name='lttng_ust_abi_object_data' size-in-bits='2688' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='276' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t lttng_ust_abi_object_data::type -->
        <var-decl name='type' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int lttng_ust_abi_object_data::handle -->
        <var-decl name='handle' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_abi_object_data::size -->
        <var-decl name='size' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_ust_abi_object_data::padding1[32] -->
        <var-decl name='padding1' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {struct {void* data; int32_t type; int wakeup_fd;} channel; struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} stream; struct {void* data;} counter; struct {int shm_fd;} counter_global; struct {int shm_fd; uint32_t cpu_nr;} counter_cpu; char padding2[288];} lttng_ust_abi_object_data::u -->
        <var-decl name='u' type-id='type-id-114' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='303' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {void* data; int32_t type; int wakeup_fd;} channel; struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} stream; struct {void* data;} counter; struct {int shm_fd;} counter_global; struct {int shm_fd; uint32_t cpu_nr;} counter_cpu; char padding2[288];} -->
    <union-decl name='__anonymous_union__2' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='281' column='1' id='type-id-114'>
      <data-member access='private'>
        <!-- struct {void* data; int32_t type; int wakeup_fd;} channel -->
        <var-decl name='channel' type-id='type-id-115' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='286' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} stream -->
        <var-decl name='stream' type-id='type-id-116' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='291' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {void* data;} counter -->
        <var-decl name='counter' type-id='type-id-117' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='294' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int shm_fd;} counter_global -->
        <var-decl name='counter_global' type-id='type-id-118' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='297' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int shm_fd; uint32_t cpu_nr;} counter_cpu -->
        <var-decl name='counter_cpu' type-id='type-id-119' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='301' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding2[288] -->
        <var-decl name='padding2' type-id='type-id-23' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='302' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {void* data; int32_t type; int wakeup_fd;} -->
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='282' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* data -->
        <var-decl name='data' type-id='type-id-93' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int32_t type -->
        <var-decl name='type' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='285' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int shm_fd; int wakeup_fd; uint32_t stream_nr;} -->
    <class-decl name='__anonymous_struct__3' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='287' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t stream_nr -->
        <var-decl name='stream_nr' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='290' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {void* data;} -->
    <class-decl name='__anonymous_struct__4' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='292' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* data -->
        <var-decl name='data' type-id='type-id-93' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='293' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int shm_fd;} -->
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='295' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int shm_fd; uint32_t cpu_nr;} -->
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='298' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t cpu_nr -->
        <var-decl name='cpu_nr' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_ctl_channel_header -->
    <enum-decl name='lttng_ust_ctl_channel_header' filepath='../../../include/lttng/ust-ctl.h' line='315' column='1' id='type-id-120'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_CTL_CHANNEL_HEADER_UNKNOWN' value='0'/>
      <enumerator name='LTTNG_UST_CTL_CHANNEL_HEADER_COMPACT' value='1'/>
      <enumerator name='LTTNG_UST_CTL_CHANNEL_HEADER_LARGE' value='2'/>
    </enum-decl>
    <!-- struct lttng_ust_ctl_field -->
    <class-decl name='lttng_ust_ctl_field' size-in-bits='7360' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='480' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_ctl_field::name[256] -->
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- lttng_ust_ctl_type lttng_ust_ctl_field::type -->
        <var-decl name='type' type-id='type-id-122' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <!-- char lttng_ust_ctl_field::padding[28] -->
        <var-decl name='padding' type-id='type-id-25' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='483' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctl_type -->
    <class-decl name='lttng_ust_ctl_type' size-in-bits='5088' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='419' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctl_abstract_types lttng_ust_ctl_type::atype -->
        <var-decl name='atype' type-id='type-id-123' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {lttng_ust_ctl_integer_type integer; lttng_ust_ctl_float_type _float; struct {int32_t encoding;} string; struct {char name[256]; uint64_t id;} enum_nestable; struct {uint32_t length; uint32_t alignment;} array_nestable; struct {char length_name[256]; uint32_t alignment;} sequence_nestable; struct {uint32_t nr_fields; uint32_t alignment;} struct_nestable; struct {uint32_t nr_choices; char tag_name[256]; uint32_t alignment;} variant_nestable; union {_lttng_ust_ctl_basic_type basic; struct {lttng_ust_ctl_basic_type elem_type; uint32_t length;} array; struct {lttng_ust_ctl_basic_type length_type; lttng_ust_ctl_basic_type elem_type;} sequence; struct {uint32_t nr_fields;} _struct; struct {uint32_t nr_choices; char tag_name[256];} variant;} legacy; char padding[592];} lttng_ust_ctl_type::u -->
        <var-decl name='u' type-id='type-id-124' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='476' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_ctl_abstract_types -->
    <enum-decl name='lttng_ust_ctl_abstract_types' filepath='../../../include/lttng/ust-ctl.h' line='323' column='1' id='type-id-123'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='lttng_ust_ctl_atype_integer' value='0'/>
      <enumerator name='lttng_ust_ctl_atype_enum' value='1'/>
      <enumerator name='lttng_ust_ctl_atype_array' value='2'/>
      <enumerator name='lttng_ust_ctl_atype_sequence' value='3'/>
      <enumerator name='lttng_ust_ctl_atype_string' value='4'/>
      <enumerator name='lttng_ust_ctl_atype_float' value='5'/>
      <enumerator name='lttng_ust_ctl_atype_variant' value='6'/>
      <enumerator name='lttng_ust_ctl_atype_struct' value='7'/>
      <enumerator name='lttng_ust_ctl_atype_enum_nestable' value='8'/>
      <enumerator name='lttng_ust_ctl_atype_array_nestable' value='9'/>
      <enumerator name='lttng_ust_ctl_atype_sequence_nestable' value='10'/>
      <enumerator name='lttng_ust_ctl_atype_struct_nestable' value='11'/>
      <enumerator name='lttng_ust_ctl_atype_variant_nestable' value='12'/>
      <enumerator name='NR_LTTNG_UST_CTL_ABSTRACT_TYPES' value='13'/>
    </enum-decl>
    <!-- union {lttng_ust_ctl_integer_type integer; lttng_ust_ctl_float_type _float; struct {int32_t encoding;} string; struct {char name[256]; uint64_t id;} enum_nestable; struct {uint32_t length; uint32_t alignment;} array_nestable; struct {char length_name[256]; uint32_t alignment;} sequence_nestable; struct {uint32_t nr_fields; uint32_t alignment;} struct_nestable; struct {uint32_t nr_choices; char tag_name[256]; uint32_t alignment;} variant_nestable; union {_lttng_ust_ctl_basic_type basic; struct {lttng_ust_ctl_basic_type elem_type; uint32_t length;} array; struct {lttng_ust_ctl_basic_type length_type; lttng_ust_ctl_basic_type elem_type;} sequence; struct {uint32_t nr_fields;} _struct; struct {uint32_t nr_choices; char tag_name[256];} variant;} legacy; char padding[592];} -->
    <union-decl name='__anonymous_union__3' size-in-bits='5056' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='421' column='1' id='type-id-124'>
      <data-member access='private'>
        <!-- lttng_ust_ctl_integer_type integer -->
        <var-decl name='integer' type-id='type-id-125' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='422' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ctl_float_type _float -->
        <var-decl name='_float' type-id='type-id-126' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='423' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int32_t encoding;} string -->
        <var-decl name='string' type-id='type-id-127' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='426' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char name[256]; uint64_t id;} enum_nestable -->
        <var-decl name='enum_nestable' type-id='type-id-128' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='431' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t length; uint32_t alignment;} array_nestable -->
        <var-decl name='array_nestable' type-id='type-id-129' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='436' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char length_name[256]; uint32_t alignment;} sequence_nestable -->
        <var-decl name='sequence_nestable' type-id='type-id-130' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='441' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_fields; uint32_t alignment;} struct_nestable -->
        <var-decl name='struct_nestable' type-id='type-id-131' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='446' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_choices; char tag_name[256]; uint32_t alignment;} variant_nestable -->
        <var-decl name='variant_nestable' type-id='type-id-132' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='452' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- union {_lttng_ust_ctl_basic_type basic; struct {lttng_ust_ctl_basic_type elem_type; uint32_t length;} array; struct {lttng_ust_ctl_basic_type length_type; lttng_ust_ctl_basic_type elem_type;} sequence; struct {uint32_t nr_fields;} _struct; struct {uint32_t nr_choices; char tag_name[256];} variant;} legacy -->
        <var-decl name='legacy' type-id='type-id-133' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='474' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[592] -->
        <var-decl name='padding' type-id='type-id-31' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='475' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ctl_integer_type -->
    <class-decl name='lttng_ust_ctl_integer_type' size-in-bits='368' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='348' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_ctl_integer_type::size -->
        <var-decl name='size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_ctl_integer_type::signedness -->
        <var-decl name='signedness' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_ctl_integer_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t lttng_ust_ctl_integer_type::base -->
        <var-decl name='base' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int32_t lttng_ust_ctl_integer_type::encoding -->
        <var-decl name='encoding' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint16_t lttng_ust_ctl_integer_type::alignment -->
        <var-decl name='alignment' type-id='type-id-134' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <!-- char lttng_ust_ctl_integer_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-13' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='355' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __uint16_t uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-135' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-134'/>
    <!-- typedef unsigned short int __uint16_t -->
    <typedef-decl name='__uint16_t' type-id='type-id-61' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-135'/>
    <!-- struct lttng_ust_ctl_float_type -->
    <class-decl name='lttng_ust_ctl_float_type' size-in-bits='304' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='359' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_ctl_float_type::exp_dig -->
        <var-decl name='exp_dig' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_ctl_float_type::mant_dig -->
        <var-decl name='mant_dig' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_ctl_float_type::reverse_byte_order -->
        <var-decl name='reverse_byte_order' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint16_t lttng_ust_ctl_float_type::alignment -->
        <var-decl name='alignment' type-id='type-id-134' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <!-- char lttng_ust_ctl_float_type::padding[24] -->
        <var-decl name='padding' type-id='type-id-13' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='364' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int32_t encoding;} -->
    <class-decl name='__anonymous_struct__7' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='424' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t encoding -->
        <var-decl name='encoding' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {char name[256]; uint64_t id;} -->
    <class-decl name='__anonymous_struct__8' size-in-bits='2112' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='427' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char name[256] -->
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- uint64_t id -->
        <var-decl name='id' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='429' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t length; uint32_t alignment;} -->
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='432' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t length -->
        <var-decl name='length' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t alignment -->
        <var-decl name='alignment' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {char length_name[256]; uint32_t alignment;} -->
    <class-decl name='__anonymous_struct__10' size-in-bits='2080' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='437' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char length_name[256] -->
        <var-decl name='length_name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- uint32_t alignment -->
        <var-decl name='alignment' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='439' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_fields; uint32_t alignment;} -->
    <class-decl name='__anonymous_struct__11' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='442' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t alignment -->
        <var-decl name='alignment' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='444' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_choices; char tag_name[256]; uint32_t alignment;} -->
    <class-decl name='__anonymous_struct__12' size-in-bits='2112' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='447' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_choices -->
        <var-decl name='nr_choices' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char tag_name[256] -->
        <var-decl name='tag_name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- uint32_t alignment -->
        <var-decl name='alignment' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {_lttng_ust_ctl_basic_type basic; struct {lttng_ust_ctl_basic_type elem_type; uint32_t length;} array; struct {lttng_ust_ctl_basic_type length_type; lttng_ust_ctl_basic_type elem_type;} sequence; struct {uint32_t nr_fields;} _struct; struct {uint32_t nr_choices; char tag_name[256];} variant;} -->
    <union-decl name='__anonymous_union__4' size-in-bits='5056' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='455' column='1' id='type-id-133'>
      <data-member access='private'>
        <!-- _lttng_ust_ctl_basic_type basic -->
        <var-decl name='basic' type-id='type-id-136' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='456' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_ust_ctl_basic_type elem_type; uint32_t length;} array -->
        <var-decl name='array' type-id='type-id-137' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='460' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {lttng_ust_ctl_basic_type length_type; lttng_ust_ctl_basic_type elem_type;} sequence -->
        <var-decl name='sequence' type-id='type-id-138' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='464' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_fields;} _struct -->
        <var-decl name='_struct' type-id='type-id-139' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='468' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {uint32_t nr_choices; char tag_name[256];} variant -->
        <var-decl name='variant' type-id='type-id-140' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='473' column='1'/>
      </data-member>
    </union-decl>
    <!-- union _lttng_ust_ctl_basic_type -->
    <union-decl name='_lttng_ust_ctl_basic_type' size-in-bits='2496' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='392' column='1' id='type-id-136'>
      <data-member access='private'>
        <!-- lttng_ust_ctl_integer_type _lttng_ust_ctl_basic_type::integer -->
        <var-decl name='integer' type-id='type-id-125' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='393' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char name[256]; lttng_ust_ctl_integer_type container_type; uint64_t id;} _lttng_ust_ctl_basic_type::enumeration -->
        <var-decl name='enumeration' type-id='type-id-141' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='398' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {int32_t encoding;} _lttng_ust_ctl_basic_type::string -->
        <var-decl name='string' type-id='type-id-142' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='401' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ctl_float_type _lttng_ust_ctl_basic_type::_float -->
        <var-decl name='_float' type-id='type-id-126' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='402' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char _lttng_ust_ctl_basic_type::padding[296] -->
        <var-decl name='padding' type-id='type-id-27' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='403' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {char name[256]; lttng_ust_ctl_integer_type container_type; uint64_t id;} -->
    <class-decl name='__anonymous_struct__13' size-in-bits='2496' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='394' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char name[256] -->
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- lttng_ust_ctl_integer_type container_type -->
        <var-decl name='container_type' type-id='type-id-125' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <!-- uint64_t id -->
        <var-decl name='id' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='397' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int32_t encoding;} -->
    <class-decl name='__anonymous_struct__14' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='399' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t encoding -->
        <var-decl name='encoding' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='400' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {lttng_ust_ctl_basic_type elem_type; uint32_t length;} -->
    <class-decl name='__anonymous_struct__15' size-in-bits='2560' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='457' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctl_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-143' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <!-- uint32_t length -->
        <var-decl name='length' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='459' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctl_basic_type -->
    <class-decl name='lttng_ust_ctl_basic_type' size-in-bits='2528' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='407' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctl_abstract_types lttng_ust_ctl_basic_type::atype -->
        <var-decl name='atype' type-id='type-id-123' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {_lttng_ust_ctl_basic_type basic;} lttng_ust_ctl_basic_type::u -->
        <var-decl name='u' type-id='type-id-144' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {_lttng_ust_ctl_basic_type basic;} -->
    <union-decl name='__anonymous_union__5' size-in-bits='2496' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='409' column='1' id='type-id-144'>
      <data-member access='private'>
        <!-- _lttng_ust_ctl_basic_type basic -->
        <var-decl name='basic' type-id='type-id-136' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='410' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {lttng_ust_ctl_basic_type length_type; lttng_ust_ctl_basic_type elem_type;} -->
    <class-decl name='__anonymous_struct__16' size-in-bits='5056' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='461' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctl_basic_type length_type -->
        <var-decl name='length_type' type-id='type-id-143' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <!-- lttng_ust_ctl_basic_type elem_type -->
        <var-decl name='elem_type' type-id='type-id-143' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_fields;} -->
    <class-decl name='__anonymous_struct__17' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='465' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='466' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t nr_choices; char tag_name[256];} -->
    <class-decl name='__anonymous_struct__18' size-in-bits='2080' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='469' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t nr_choices -->
        <var-decl name='nr_choices' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char tag_name[256] -->
        <var-decl name='tag_name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='471' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctl_enum_entry -->
    <class-decl name='lttng_ust_ctl_enum_entry' size-in-bits='2688' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='379' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctl_enum_value lttng_ust_ctl_enum_entry::start -->
        <var-decl name='start' type-id='type-id-146' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_ctl_enum_value lttng_ust_ctl_enum_entry::end -->
        <var-decl name='end' type-id='type-id-146' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_ctl_enum_entry::string[256] -->
        <var-decl name='string' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <!-- union {struct {uint32_t options;} extra; char padding[32];} lttng_ust_ctl_enum_entry::u -->
        <var-decl name='u' type-id='type-id-147' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='387' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctl_enum_value -->
    <class-decl name='lttng_ust_ctl_enum_value' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='368' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_ctl_enum_value::value -->
        <var-decl name='value' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint8_t lttng_ust_ctl_enum_value::signedness -->
        <var-decl name='signedness' type-id='type-id-55' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <!-- char lttng_ust_ctl_enum_value::padding[15] -->
        <var-decl name='padding' type-id='type-id-7' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='371' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {uint32_t options;} extra; char padding[32];} -->
    <union-decl name='__anonymous_union__6' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='382' column='1' id='type-id-147'>
      <data-member access='private'>
        <!-- struct {uint32_t options;} extra -->
        <var-decl name='extra' type-id='type-id-148' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='385' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='386' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {uint32_t options;} -->
    <class-decl name='__anonymous_struct__19' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='383' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t options -->
        <var-decl name='options' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='384' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_ctl_notify_cmd -->
    <enum-decl name='lttng_ust_ctl_notify_cmd' filepath='../../../include/lttng/ust-ctl.h' line='309' column='1' id='type-id-149'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_CTL_NOTIFY_CMD_EVENT' value='0'/>
      <enumerator name='LTTNG_UST_CTL_NOTIFY_CMD_CHANNEL' value='1'/>
      <enumerator name='LTTNG_UST_CTL_NOTIFY_CMD_ENUM' value='2'/>
    </enum-decl>
    <!-- enum lttng_ust_ctl_socket_type -->
    <enum-decl name='lttng_ust_ctl_socket_type' filepath='../../../include/lttng/ust-ctl.h' line='304' column='1' id='type-id-150'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_CTL_SOCKET_CMD' value='0'/>
      <enumerator name='LTTNG_UST_CTL_SOCKET_NOTIFY' value='1'/>
    </enum-decl>
    <!-- struct lttng_ust_ctl_consumer_stream -->
    <class-decl name='lttng_ust_ctl_consumer_stream' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='61' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ring_buffer* lttng_ust_ctl_consumer_stream::buf -->
        <var-decl name='buf' type-id='type-id-152' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_ctl_consumer_channel* lttng_ust_ctl_consumer_stream::chan -->
        <var-decl name='chan' type-id='type-id-153' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int lttng_ust_ctl_consumer_stream::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int lttng_ust_ctl_consumer_stream::wait_fd -->
        <var-decl name='wait_fd' type-id='type-id-41' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int lttng_ust_ctl_consumer_stream::wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-41' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int lttng_ust_ctl_consumer_stream::cpu -->
        <var-decl name='cpu' type-id='type-id-41' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint64_t lttng_ust_ctl_consumer_stream::memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-99' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* lttng_ust_ctl_consumer_stream::memory_map_addr -->
        <var-decl name='memory_map_addr' type-id='type-id-93' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ring_buffer -->
    <class-decl name='lttng_ust_ring_buffer' size-in-bits='5120' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='168' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_crash_abi lttng_ust_ring_buffer::crash_abi -->
        <var-decl name='crash_abi' type-id='type-id-155' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- v_atomic lttng_ust_ring_buffer::offset -->
        <var-decl name='offset' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- union {shm_ref _ref; commit_counters_hot* _type;} lttng_ust_ring_buffer::commit_hot -->
        <var-decl name='commit_hot' type-id='type-id-157' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- long int lttng_ust_ring_buffer::consumed -->
        <var-decl name='consumed' type-id='type-id-44' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- int lttng_ust_ring_buffer::record_disabled -->
        <var-decl name='record_disabled' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- v_atomic lttng_ust_ring_buffer::last_tsc -->
        <var-decl name='last_tsc' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- lttng_ust_ring_buffer_backend lttng_ust_ring_buffer::backend -->
        <var-decl name='backend' type-id='type-id-158' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <!-- union {shm_ref _ref; commit_counters_cold* _type;} lttng_ust_ring_buffer::commit_cold -->
        <var-decl name='commit_cold' type-id='type-id-159' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <!-- union {shm_ref _ref; uint64_t* _type;} lttng_ust_ring_buffer::ts_end -->
        <var-decl name='ts_end' type-id='type-id-160' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <!-- long int lttng_ust_ring_buffer::active_readers -->
        <var-decl name='active_readers' type-id='type-id-44' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <!-- v_atomic lttng_ust_ring_buffer::records_lost_full -->
        <var-decl name='records_lost_full' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <!-- v_atomic lttng_ust_ring_buffer::records_lost_wrap -->
        <var-decl name='records_lost_wrap' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <!-- v_atomic lttng_ust_ring_buffer::records_lost_big -->
        <var-decl name='records_lost_big' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <!-- v_atomic lttng_ust_ring_buffer::records_count -->
        <var-decl name='records_count' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <!-- v_atomic lttng_ust_ring_buffer::records_overrun -->
        <var-decl name='records_overrun' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <!-- int lttng_ust_ring_buffer::finalized -->
        <var-decl name='finalized' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <!-- unsigned long int lttng_ust_ring_buffer::get_subbuf_consumed -->
        <var-decl name='get_subbuf_consumed' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <!-- unsigned long int lttng_ust_ring_buffer::prod_snapshot -->
        <var-decl name='prod_snapshot' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <!-- unsigned long int lttng_ust_ring_buffer::cons_snapshot -->
        <var-decl name='cons_snapshot' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_ust_ring_buffer::get_subbuf -->
        <var-decl name='get_subbuf' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer* _type;} lttng_ust_ring_buffer::self -->
        <var-decl name='self' type-id='type-id-161' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <!-- char lttng_ust_ring_buffer::padding[60] -->
        <var-decl name='padding' type-id='type-id-33' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='225' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_crash_abi -->
    <class-decl name='lttng_crash_abi' size-in-bits='992' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='121' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint8_t lttng_crash_abi::magic[16] -->
        <var-decl name='magic' type-id='type-id-56' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint64_t lttng_crash_abi::mmap_length -->
        <var-decl name='mmap_length' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint16_t lttng_crash_abi::endian -->
        <var-decl name='endian' type-id='type-id-134' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <!-- uint16_t lttng_crash_abi::major -->
        <var-decl name='major' type-id='type-id-134' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint16_t lttng_crash_abi::minor -->
        <var-decl name='minor' type-id='type-id-134' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <!-- uint8_t lttng_crash_abi::word_size -->
        <var-decl name='word_size' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <!-- uint8_t lttng_crash_abi::layout_type -->
        <var-decl name='layout_type' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- struct {uint32_t prod_offset; uint32_t consumed_offset; uint32_t commit_hot_array; uint32_t commit_hot_seq; uint32_t buf_wsb_array; uint32_t buf_wsb_id; uint32_t sb_array; uint32_t sb_array_shmp_offset; uint32_t sb_backend_p_offset; uint32_t content_size; uint32_t packet_size;} lttng_crash_abi::offset -->
        <var-decl name='offset' type-id='type-id-162' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- struct {uint8_t prod_offset; uint8_t consumed_offset; uint8_t commit_hot_seq; uint8_t buf_wsb_id; uint8_t sb_array_shmp_offset; uint8_t sb_backend_p_offset; uint8_t content_size; uint8_t packet_size;} lttng_crash_abi::length -->
        <var-decl name='length' type-id='type-id-163' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- struct {uint32_t commit_hot_array; uint32_t buf_wsb_array; uint32_t sb_array;} lttng_crash_abi::stride -->
        <var-decl name='stride' type-id='type-id-164' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- uint64_t lttng_crash_abi::buf_size -->
        <var-decl name='buf_size' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- uint64_t lttng_crash_abi::subbuf_size -->
        <var-decl name='subbuf_size' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- uint64_t lttng_crash_abi::num_subbuf -->
        <var-decl name='num_subbuf' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- uint32_t lttng_crash_abi::mode -->
        <var-decl name='mode' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t prod_offset; uint32_t consumed_offset; uint32_t commit_hot_array; uint32_t commit_hot_seq; uint32_t buf_wsb_array; uint32_t buf_wsb_id; uint32_t sb_array; uint32_t sb_array_shmp_offset; uint32_t sb_backend_p_offset; uint32_t content_size; uint32_t packet_size;} -->
    <class-decl name='__anonymous_struct__20' size-in-bits='352' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='133' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t prod_offset -->
        <var-decl name='prod_offset' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t consumed_offset -->
        <var-decl name='consumed_offset' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t commit_hot_array -->
        <var-decl name='commit_hot_array' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t commit_hot_seq -->
        <var-decl name='commit_hot_seq' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t buf_wsb_array -->
        <var-decl name='buf_wsb_array' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t buf_wsb_id -->
        <var-decl name='buf_wsb_id' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t sb_array -->
        <var-decl name='sb_array' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t sb_array_shmp_offset -->
        <var-decl name='sb_array_shmp_offset' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t sb_backend_p_offset -->
        <var-decl name='sb_backend_p_offset' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t content_size -->
        <var-decl name='content_size' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t packet_size -->
        <var-decl name='packet_size' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint8_t prod_offset; uint8_t consumed_offset; uint8_t commit_hot_seq; uint8_t buf_wsb_id; uint8_t sb_array_shmp_offset; uint8_t sb_backend_p_offset; uint8_t content_size; uint8_t packet_size;} -->
    <class-decl name='__anonymous_struct__21' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='146' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint8_t prod_offset -->
        <var-decl name='prod_offset' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <!-- uint8_t consumed_offset -->
        <var-decl name='consumed_offset' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- uint8_t commit_hot_seq -->
        <var-decl name='commit_hot_seq' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <!-- uint8_t buf_wsb_id -->
        <var-decl name='buf_wsb_id' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint8_t sb_array_shmp_offset -->
        <var-decl name='sb_array_shmp_offset' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <!-- uint8_t sb_backend_p_offset -->
        <var-decl name='sb_backend_p_offset' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- uint8_t content_size -->
        <var-decl name='content_size' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <!-- uint8_t packet_size -->
        <var-decl name='packet_size' type-id='type-id-55' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {uint32_t commit_hot_array; uint32_t buf_wsb_array; uint32_t sb_array;} -->
    <class-decl name='__anonymous_struct__22' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='156' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t commit_hot_array -->
        <var-decl name='commit_hot_array' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t buf_wsb_array -->
        <var-decl name='buf_wsb_array' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t sb_array -->
        <var-decl name='sb_array' type-id='type-id-88' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='159' column='1'/>
      </data-member>
    </class-decl>
    <!-- union v_atomic -->
    <union-decl name='v_atomic' size-in-bits='64' visibility='default' filepath='../../../src/common/ringbuffer/vatomic.h' line='21' column='1' id='type-id-156'>
      <data-member access='private'>
        <!-- long int v_atomic::a -->
        <var-decl name='a' type-id='type-id-44' visibility='default' filepath='../../../src/common/ringbuffer/vatomic.h' line='22' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long int v_atomic::v -->
        <var-decl name='v' type-id='type-id-44' visibility='default' filepath='../../../src/common/ringbuffer/vatomic.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; commit_counters_hot* _type;} -->
    <union-decl name='__anonymous_union__7' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='175' column='1' id='type-id-157'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='175' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- commit_counters_hot* _type -->
        <var-decl name='_type' type-id='type-id-166' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='175' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct shm_ref -->
    <class-decl name='shm_ref' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/shm_internal.h' line='10' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- volatile ssize_t shm_ref::index -->
        <var-decl name='index' type-id='type-id-167' visibility='default' filepath='../../../src/common/ringbuffer/shm_internal.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- volatile ssize_t shm_ref::offset -->
        <var-decl name='offset' type-id='type-id-167' visibility='default' filepath='../../../src/common/ringbuffer/shm_internal.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __ssize_t ssize_t -->
    <typedef-decl name='ssize_t' type-id='type-id-168' filepath='/usr/include/unistd.h' line='220' column='1' id='type-id-169'/>
    <!-- typedef long int __ssize_t -->
    <typedef-decl name='__ssize_t' type-id='type-id-44' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-168'/>
    <!-- struct commit_counters_hot -->
    <class-decl name='commit_counters_hot' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='77' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- v_atomic commit_counters_hot::cc -->
        <var-decl name='cc' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- v_atomic commit_counters_hot::seq -->
        <var-decl name='seq' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char commit_counters_hot::padding[16] -->
        <var-decl name='padding' type-id='type-id-9' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ring_buffer_backend -->
    <class-decl name='lttng_ust_ring_buffer_backend' size-in-bits='1408' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='53' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_subbuffer* _type;} lttng_ust_ring_buffer_backend::buf_wsb -->
        <var-decl name='buf_wsb' type-id='type-id-171' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_ring_buffer_backend_subbuffer lttng_ust_ring_buffer_backend::buf_rsb -->
        <var-decl name='buf_rsb' type-id='type-id-172' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_counts* _type;} lttng_ust_ring_buffer_backend::buf_cnt -->
        <var-decl name='buf_cnt' type-id='type-id-173' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_pages_shmp* _type;} lttng_ust_ring_buffer_backend::array -->
        <var-decl name='array' type-id='type-id-174' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- union {shm_ref _ref; char* _type;} lttng_ust_ring_buffer_backend::memory_map -->
        <var-decl name='memory_map' type-id='type-id-175' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer_channel* _type;} lttng_ust_ring_buffer_backend::chan -->
        <var-decl name='chan' type-id='type-id-176' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int lttng_ust_ring_buffer_backend::cpu -->
        <var-decl name='cpu' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- v_atomic lttng_ust_ring_buffer_backend::records_read -->
        <var-decl name='records_read' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_ust_ring_buffer_backend::allocated -->
        <var-decl name='allocated' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <!-- char lttng_ust_ring_buffer_backend::padding[64] -->
        <var-decl name='padding' type-id='type-id-35' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_subbuffer* _type;} -->
    <union-decl name='__anonymous_union__8' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='55' column='1' id='type-id-171'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='55' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer_backend_subbuffer* _type -->
        <var-decl name='_type' type-id='type-id-177' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='55' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ring_buffer_backend_subbuffer -->
    <class-decl name='lttng_ust_ring_buffer_backend_subbuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='27' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int lttng_ust_ring_buffer_backend_subbuffer::id -->
        <var-decl name='id' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_counts* _type;} -->
    <union-decl name='__anonymous_union__9' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='59' column='1' id='type-id-173'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='59' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer_backend_counts* _type -->
        <var-decl name='_type' type-id='type-id-178' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='59' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ring_buffer_backend_counts -->
    <class-decl name='lttng_ust_ring_buffer_backend_counts' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='32' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint64_t lttng_ust_ring_buffer_backend_counts::seq_cnt -->
        <var-decl name='seq_cnt' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_pages_shmp* _type;} -->
    <union-decl name='__anonymous_union__10' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='64' column='1' id='type-id-174'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='64' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer_backend_pages_shmp* _type -->
        <var-decl name='_type' type-id='type-id-180' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='64' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ring_buffer_backend_pages_shmp -->
    <class-decl name='lttng_ust_ring_buffer_backend_pages_shmp' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='48' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_pages* _type;} lttng_ust_ring_buffer_backend_pages_shmp::shmp -->
        <var-decl name='shmp' type-id='type-id-182' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer_backend_pages* _type;} -->
    <union-decl name='__anonymous_union__11' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='49' column='1' id='type-id-182'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='49' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer_backend_pages* _type -->
        <var-decl name='_type' type-id='type-id-183' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='49' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ring_buffer_backend_pages -->
    <class-decl name='lttng_ust_ring_buffer_backend_pages' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='18' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int lttng_ust_ring_buffer_backend_pages::mmap_offset -->
        <var-decl name='mmap_offset' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- v_atomic lttng_ust_ring_buffer_backend_pages::records_commit -->
        <var-decl name='records_commit' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- v_atomic lttng_ust_ring_buffer_backend_pages::records_unread -->
        <var-decl name='records_unread' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned long int lttng_ust_ring_buffer_backend_pages::data_size -->
        <var-decl name='data_size' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- union {shm_ref _ref; char* _type;} lttng_ust_ring_buffer_backend_pages::p -->
        <var-decl name='p' type-id='type-id-185' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_ring_buffer_backend_pages::padding[16] -->
        <var-decl name='padding' type-id='type-id-9' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; char* _type;} -->
    <union-decl name='__anonymous_union__12' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='23' column='1' id='type-id-185'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='23' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char* _type -->
        <var-decl name='_type' type-id='type-id-98' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; char* _type;} -->
    <union-decl name='__anonymous_union__13' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='65' column='1' id='type-id-175'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='65' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char* _type -->
        <var-decl name='_type' type-id='type-id-98' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='65' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer_channel* _type;} -->
    <union-decl name='__anonymous_union__14' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='67' column='1' id='type-id-176'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='67' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer_channel* _type -->
        <var-decl name='_type' type-id='type-id-186' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='67' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ring_buffer_channel -->
    <class-decl name='lttng_ust_ring_buffer_channel' size-in-bits='6144' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='39' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int lttng_ust_ring_buffer_channel::record_disabled -->
        <var-decl name='record_disabled' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned long int lttng_ust_ring_buffer_channel::commit_count_mask -->
        <var-decl name='commit_count_mask' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned long int lttng_ust_ring_buffer_channel::switch_timer_interval -->
        <var-decl name='switch_timer_interval' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- timer_t lttng_ust_ring_buffer_channel::switch_timer -->
        <var-decl name='switch_timer' type-id='type-id-188' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_ust_ring_buffer_channel::switch_timer_enabled -->
        <var-decl name='switch_timer_enabled' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned long int lttng_ust_ring_buffer_channel::read_timer_interval -->
        <var-decl name='read_timer_interval' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- timer_t lttng_ust_ring_buffer_channel::read_timer -->
        <var-decl name='read_timer' type-id='type-id-188' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int lttng_ust_ring_buffer_channel::read_timer_enabled -->
        <var-decl name='read_timer_enabled' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int lttng_ust_ring_buffer_channel::finalized -->
        <var-decl name='finalized' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- size_t lttng_ust_ring_buffer_channel::priv_data_offset -->
        <var-decl name='priv_data_offset' type-id='type-id-68' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- unsigned int lttng_ust_ring_buffer_channel::nr_streams -->
        <var-decl name='nr_streams' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- lttng_ust_shm_handle* lttng_ust_ring_buffer_channel::handle -->
        <var-decl name='handle' type-id='type-id-189' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- union {struct {int32_t blocking_timeout_ms; void* priv;} s; char padding[32];} lttng_ust_ring_buffer_channel::u -->
        <var-decl name='u' type-id='type-id-190' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- channel_backend lttng_ust_ring_buffer_channel::backend -->
        <var-decl name='backend' type-id='type-id-191' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __timer_t timer_t -->
    <typedef-decl name='timer_t' type-id='type-id-192' filepath='/usr/include/bits/types/timer_t.h' line='7' column='1' id='type-id-188'/>
    <!-- typedef void* __timer_t -->
    <typedef-decl name='__timer_t' type-id='type-id-93' filepath='/usr/include/bits/types.h' line='172' column='1' id='type-id-192'/>
    <!-- struct lttng_ust_shm_handle -->
    <class-decl name='lttng_ust_shm_handle' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='39' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- shm_object_table* lttng_ust_shm_handle::table -->
        <var-decl name='table' type-id='type-id-194' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer_channel* _type;} lttng_ust_shm_handle::chan -->
        <var-decl name='chan' type-id='type-id-195' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct shm_object_table -->
    <class-decl name='shm_object_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='33' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- size_t shm_object_table::size -->
        <var-decl name='size' type-id='type-id-68' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t shm_object_table::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-68' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- shm_object shm_object_table::objects[] -->
        <var-decl name='objects' type-id='type-id-52' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct shm_object -->
    <class-decl name='shm_object' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='22' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- shm_object_type shm_object::type -->
        <var-decl name='type' type-id='type-id-197' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t shm_object::index -->
        <var-decl name='index' type-id='type-id-68' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int shm_object::shm_fd -->
        <var-decl name='shm_fd' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int shm_object::wait_fd[2] -->
        <var-decl name='wait_fd' type-id='type-id-42' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- char* shm_object::memory_map -->
        <var-decl name='memory_map' type-id='type-id-98' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- size_t shm_object::memory_map_size -->
        <var-decl name='memory_map_size' type-id='type-id-68' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint64_t shm_object::allocated_len -->
        <var-decl name='allocated_len' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int shm_object::shm_fd_ownership -->
        <var-decl name='shm_fd_ownership' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum shm_object_type -->
    <enum-decl name='shm_object_type' filepath='../../../src/common/ringbuffer/shm_types.h' line='17' column='1' id='type-id-197'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='SHM_OBJECT_SHM' value='0'/>
      <enumerator name='SHM_OBJECT_MEM' value='1'/>
    </enum-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer_channel* _type;} -->
    <union-decl name='__anonymous_union__15' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='41' column='1' id='type-id-195'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='41' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer_channel* _type -->
        <var-decl name='_type' type-id='type-id-186' visibility='default' filepath='../../../src/common/ringbuffer/shm_types.h' line='41' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {struct {int32_t blocking_timeout_ms; void* priv;} s; char padding[32];} -->
    <union-decl name='__anonymous_union__16' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='61' column='1' id='type-id-190'>
      <data-member access='private'>
        <!-- struct {int32_t blocking_timeout_ms; void* priv;} s -->
        <var-decl name='s' type-id='type-id-198' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='65' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char padding[32] -->
        <var-decl name='padding' type-id='type-id-29' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='66' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {int32_t blocking_timeout_ms; void* priv;} -->
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='62' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t blocking_timeout_ms -->
        <var-decl name='blocking_timeout_ms' type-id='type-id-82' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* priv -->
        <var-decl name='priv' type-id='type-id-93' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct channel_backend -->
    <class-decl name='channel_backend' size-in-bits='4352' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='79' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int channel_backend::buf_size -->
        <var-decl name='buf_size' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned long int channel_backend::subbuf_size -->
        <var-decl name='subbuf_size' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int channel_backend::subbuf_size_order -->
        <var-decl name='subbuf_size_order' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- unsigned int channel_backend::num_subbuf_order -->
        <var-decl name='num_subbuf_order' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int channel_backend::buf_size_order -->
        <var-decl name='buf_size_order' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int channel_backend::extra_reader_sb -->
        <var-decl name='extra_reader_sb' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned long int channel_backend::num_subbuf -->
        <var-decl name='num_subbuf' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint64_t channel_backend::start_tsc -->
        <var-decl name='start_tsc' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- union {shm_ref _ref; void** _type;} channel_backend::priv_data -->
        <var-decl name='priv_data' type-id='type-id-199' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- lttng_ust_ring_buffer_config channel_backend::config -->
        <var-decl name='config' type-id='type-id-200' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <!-- char channel_backend::name[255] -->
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3832'>
        <!-- char channel_backend::padding[64] -->
        <var-decl name='padding' type-id='type-id-35' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <!-- lttng_ust_ring_buffer_shmp channel_backend::buf[] -->
        <var-decl name='buf' type-id='type-id-50' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; void** _type;} -->
    <union-decl name='__anonymous_union__17' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='91' column='1' id='type-id-199'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='91' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- void** _type -->
        <var-decl name='_type' type-id='type-id-201' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='91' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ring_buffer_config -->
    <class-decl name='lttng_ust_ring_buffer_config' size-in-bits='1280' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='177' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ring_buffer_alloc_types lttng_ust_ring_buffer_config::alloc -->
        <var-decl name='alloc' type-id='type-id-202' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- lttng_ust_ring_buffer_sync_types lttng_ust_ring_buffer_config::sync -->
        <var-decl name='sync' type-id='type-id-203' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_ring_buffer_mode_types lttng_ust_ring_buffer_config::mode -->
        <var-decl name='mode' type-id='type-id-204' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- lttng_ust_ring_buffer_output_types lttng_ust_ring_buffer_config::output -->
        <var-decl name='output' type-id='type-id-205' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_ring_buffer_backend_types lttng_ust_ring_buffer_config::backend -->
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- lttng_ust_ring_buffer_oops_types lttng_ust_ring_buffer_config::oops -->
        <var-decl name='oops' type-id='type-id-207' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_ring_buffer_ipi_types lttng_ust_ring_buffer_config::ipi -->
        <var-decl name='ipi' type-id='type-id-208' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- lttng_ust_ring_buffer_wakeup_types lttng_ust_ring_buffer_config::wakeup -->
        <var-decl name='wakeup' type-id='type-id-209' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned int lttng_ust_ring_buffer_config::tsc_bits -->
        <var-decl name='tsc_bits' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_ring_buffer_client_cb lttng_ust_ring_buffer_config::cb -->
        <var-decl name='cb' type-id='type-id-210' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- int lttng_ust_ring_buffer_config::client_type -->
        <var-decl name='client_type' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <!-- int lttng_ust_ring_buffer_config::_unused1 -->
        <var-decl name='_unused1' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- const lttng_ust_ring_buffer_client_cb* lttng_ust_ring_buffer_config::cb_ptr -->
        <var-decl name='cb_ptr' type-id='type-id-211' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- char lttng_ust_ring_buffer_config::padding[20] -->
        <var-decl name='padding' type-id='type-id-11' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_ring_buffer_alloc_types -->
    <enum-decl name='lttng_ust_ring_buffer_alloc_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='129' column='1' id='type-id-202'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_ALLOC_PER_CPU' value='0'/>
      <enumerator name='RING_BUFFER_ALLOC_GLOBAL' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_sync_types -->
    <enum-decl name='lttng_ust_ring_buffer_sync_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='134' column='1' id='type-id-203'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_SYNC_PER_CPU' value='0'/>
      <enumerator name='RING_BUFFER_SYNC_GLOBAL' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_mode_types -->
    <enum-decl name='lttng_ust_ring_buffer_mode_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='139' column='1' id='type-id-204'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_OVERWRITE' value='0'/>
      <enumerator name='RING_BUFFER_DISCARD' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_output_types -->
    <enum-decl name='lttng_ust_ring_buffer_output_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='144' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_SPLICE' value='0'/>
      <enumerator name='RING_BUFFER_MMAP' value='1'/>
      <enumerator name='RING_BUFFER_READ' value='2'/>
      <enumerator name='RING_BUFFER_ITERATOR' value='3'/>
      <enumerator name='RING_BUFFER_NONE' value='4'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_backend_types -->
    <enum-decl name='lttng_ust_ring_buffer_backend_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='152' column='1' id='type-id-206'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_PAGE' value='0'/>
      <enumerator name='RING_BUFFER_VMAP' value='1'/>
      <enumerator name='RING_BUFFER_STATIC' value='2'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_oops_types -->
    <enum-decl name='lttng_ust_ring_buffer_oops_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='158' column='1' id='type-id-207'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_NO_OOPS_CONSISTENCY' value='0'/>
      <enumerator name='RING_BUFFER_OOPS_CONSISTENCY' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_ipi_types -->
    <enum-decl name='lttng_ust_ring_buffer_ipi_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='163' column='1' id='type-id-208'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_IPI_BARRIER' value='0'/>
      <enumerator name='RING_BUFFER_NO_IPI_BARRIER' value='1'/>
    </enum-decl>
    <!-- enum lttng_ust_ring_buffer_wakeup_types -->
    <enum-decl name='lttng_ust_ring_buffer_wakeup_types' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='168' column='1' id='type-id-209'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='RING_BUFFER_WAKEUP_BY_TIMER' value='0'/>
      <enumerator name='RING_BUFFER_WAKEUP_BY_WRITER' value='1'/>
    </enum-decl>
    <!-- struct lttng_ust_ring_buffer_client_cb -->
    <class-decl name='lttng_ust_ring_buffer_client_cb' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='35' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- typedef uint64_t (lttng_ust_ring_buffer_channel*)* lttng_ust_ring_buffer_client_cb::ring_buffer_clock_read -->
        <var-decl name='ring_buffer_clock_read' type-id='type-id-212' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- typedef size_t (const lttng_ust_ring_buffer_config*, lttng_ust_ring_buffer_channel*, typedef size_t, size_t*, lttng_ust_ring_buffer_ctx*, void*)* lttng_ust_ring_buffer_client_cb::record_header_size -->
        <var-decl name='record_header_size' type-id='type-id-213' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- typedef size_t ()* lttng_ust_ring_buffer_client_cb::subbuffer_header_size -->
        <var-decl name='subbuffer_header_size' type-id='type-id-214' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (lttng_ust_ring_buffer*, typedef uint64_t, unsigned int, lttng_ust_shm_handle*)* lttng_ust_ring_buffer_client_cb::buffer_begin -->
        <var-decl name='buffer_begin' type-id='type-id-215' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (lttng_ust_ring_buffer*, typedef uint64_t, unsigned int, unsigned long int, lttng_ust_shm_handle*)* lttng_ust_ring_buffer_client_cb::buffer_end -->
        <var-decl name='buffer_end' type-id='type-id-216' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int (lttng_ust_ring_buffer*, void*, int, const char*, lttng_ust_shm_handle*)* lttng_ust_ring_buffer_client_cb::buffer_create -->
        <var-decl name='buffer_create' type-id='type-id-217' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (lttng_ust_ring_buffer*, void*, int, lttng_ust_shm_handle*)* lttng_ust_ring_buffer_client_cb::buffer_finalize -->
        <var-decl name='buffer_finalize' type-id='type-id-218' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- void (const lttng_ust_ring_buffer_config*, lttng_ust_ring_buffer_channel*, lttng_ust_ring_buffer*, typedef size_t, size_t*, size_t*, uint64_t*, lttng_ust_shm_handle*)* lttng_ust_ring_buffer_client_cb::record_get -->
        <var-decl name='record_get' type-id='type-id-219' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void (const lttng_ust_ring_buffer_config*, size_t*, size_t*)* lttng_ust_ring_buffer_client_cb::content_size_field -->
        <var-decl name='content_size_field' type-id='type-id-220' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- void (const lttng_ust_ring_buffer_config*, size_t*, size_t*)* lttng_ust_ring_buffer_client_cb::packet_size_field -->
        <var-decl name='packet_size_field' type-id='type-id-220' visibility='default' filepath='../../../src/common/ringbuffer/ringbuffer-config.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ring_buffer_ctx -->
    <class-decl name='lttng_ust_ring_buffer_ctx' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='39' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_ring_buffer_ctx::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_ring_buffer_ctx::client_priv -->
        <var-decl name='client_priv' type-id='type-id-93' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t lttng_ust_ring_buffer_ctx::data_size -->
        <var-decl name='data_size' type-id='type-id-68' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int lttng_ust_ring_buffer_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- lttng_ust_probe_ctx* lttng_ust_ring_buffer_ctx::probe_ctx -->
        <var-decl name='probe_ctx' type-id='type-id-222' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_ring_buffer_ctx_private* lttng_ust_ring_buffer_ctx::priv -->
        <var-decl name='priv' type-id='type-id-223' visibility='default' filepath='../../../include/lttng/ust-ringbuffer-context.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_probe_ctx -->
    <class-decl name='lttng_ust_probe_ctx' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='341' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_probe_ctx::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-events.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_probe_ctx::ip -->
        <var-decl name='ip' type-id='type-id-93' visibility='default' filepath='../../../include/lttng/ust-events.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ring_buffer_ctx_private -->
    <class-decl name='lttng_ust_ring_buffer_ctx_private' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='239' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ring_buffer_ctx* lttng_ust_ring_buffer_ctx_private::pub -->
        <var-decl name='pub' type-id='type-id-226' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_ring_buffer_channel* lttng_ust_ring_buffer_ctx_private::chan -->
        <var-decl name='chan' type-id='type-id-186' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int lttng_ust_ring_buffer_ctx_private::reserve_cpu -->
        <var-decl name='reserve_cpu' type-id='type-id-41' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- size_t lttng_ust_ring_buffer_ctx_private::slot_size -->
        <var-decl name='slot_size' type-id='type-id-68' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned long int lttng_ust_ring_buffer_ctx_private::buf_offset -->
        <var-decl name='buf_offset' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned long int lttng_ust_ring_buffer_ctx_private::pre_offset -->
        <var-decl name='pre_offset' type-id='type-id-4' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint64_t lttng_ust_ring_buffer_ctx_private::tsc -->
        <var-decl name='tsc' type-id='type-id-99' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned int lttng_ust_ring_buffer_ctx_private::rflags -->
        <var-decl name='rflags' type-id='type-id-60' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- lttng_ust_ring_buffer* lttng_ust_ring_buffer_ctx_private::buf -->
        <var-decl name='buf' type-id='type-id-152' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- lttng_ust_ring_buffer_backend_pages* lttng_ust_ring_buffer_ctx_private::backend_pages -->
        <var-decl name='backend_pages' type-id='type-id-183' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='261' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ring_buffer_shmp -->
    <class-decl name='lttng_ust_ring_buffer_shmp' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='74' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {shm_ref _ref; lttng_ust_ring_buffer* _type;} lttng_ust_ring_buffer_shmp::shmp -->
        <var-decl name='shmp' type-id='type-id-227' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer* _type;} -->
    <union-decl name='__anonymous_union__18' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='75' column='1' id='type-id-227'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='75' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer* _type -->
        <var-decl name='_type' type-id='type-id-152' visibility='default' filepath='../../../src/common/ringbuffer/backend_types.h' line='75' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; commit_counters_cold* _type;} -->
    <union-decl name='__anonymous_union__19' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='191' column='1' id='type-id-159'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='191' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- commit_counters_cold* _type -->
        <var-decl name='_type' type-id='type-id-228' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='191' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct commit_counters_cold -->
    <class-decl name='commit_counters_cold' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='85' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- v_atomic commit_counters_cold::cc_sb -->
        <var-decl name='cc_sb' type-id='type-id-156' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char commit_counters_cold::padding[24] -->
        <var-decl name='padding' type-id='type-id-13' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {shm_ref _ref; uint64_t* _type;} -->
    <union-decl name='__anonymous_union__20' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='193' column='1' id='type-id-160'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='193' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- uint64_t* _type -->
        <var-decl name='_type' type-id='type-id-230' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='193' column='1'/>
      </data-member>
    </union-decl>
    <!-- union {shm_ref _ref; lttng_ust_ring_buffer* _type;} -->
    <union-decl name='__anonymous_union__21' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='224' column='1' id='type-id-161'>
      <data-member access='private'>
        <!-- shm_ref _ref -->
        <var-decl name='_ref' type-id='type-id-165' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='224' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- lttng_ust_ring_buffer* _type -->
        <var-decl name='_type' type-id='type-id-152' visibility='default' filepath='../../../src/common/ringbuffer/frontend_types.h' line='224' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_ctl_consumer_channel -->
    <class-decl name='lttng_ust_ctl_consumer_channel' size-in-bits='640' is-struct='yes' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='49' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_channel_buffer* lttng_ust_ctl_consumer_channel::chan -->
        <var-decl name='chan' type-id='type-id-232' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_ctl_consumer_channel_attr lttng_ust_ctl_consumer_channel::attr -->
        <var-decl name='attr' type-id='type-id-233' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int lttng_ust_ctl_consumer_channel::wait_fd -->
        <var-decl name='wait_fd' type-id='type-id-41' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- int lttng_ust_ctl_consumer_channel::wakeup_fd -->
        <var-decl name='wakeup_fd' type-id='type-id-41' visibility='default' filepath='src/lib/lttng-ust-ctl/ustctl.c' line='55' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_channel_buffer -->
    <class-decl name='lttng_ust_channel_buffer' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='548' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_channel_buffer::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-events.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_channel_common* lttng_ust_channel_buffer::parent -->
        <var-decl name='parent' type-id='type-id-235' visibility='default' filepath='../../../include/lttng/ust-events.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_channel_buffer_private* lttng_ust_channel_buffer::priv -->
        <var-decl name='priv' type-id='type-id-236' visibility='default' filepath='../../../include/lttng/ust-events.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- lttng_ust_channel_buffer_ops* lttng_ust_channel_buffer::ops -->
        <var-decl name='ops' type-id='type-id-237' visibility='default' filepath='../../../include/lttng/ust-events.h' line='554' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_channel_common -->
    <class-decl name='lttng_ust_channel_common' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='523' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_channel_common::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-events.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_channel_common_private* lttng_ust_channel_common::priv -->
        <var-decl name='priv' type-id='type-id-239' visibility='default' filepath='../../../include/lttng/ust-events.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_channel_type lttng_ust_channel_common::type -->
        <var-decl name='type' type-id='type-id-240' visibility='default' filepath='../../../include/lttng/ust-events.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* lttng_ust_channel_common::child -->
        <var-decl name='child' type-id='type-id-93' visibility='default' filepath='../../../include/lttng/ust-events.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int lttng_ust_channel_common::enabled -->
        <var-decl name='enabled' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-events.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- lttng_ust_session* lttng_ust_channel_common::session -->
        <var-decl name='session' type-id='type-id-241' visibility='default' filepath='../../../include/lttng/ust-events.h' line='532' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_channel_common_private -->
    <class-decl name='lttng_ust_channel_common_private' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='377' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_channel_common* lttng_ust_channel_common_private::pub -->
        <var-decl name='pub' type-id='type-id-235' visibility='default' filepath='../../../src/common/events.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_ust_channel_common_private::objd -->
        <var-decl name='objd' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_ust_channel_common_private::tstate -->
        <var-decl name='tstate' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='381' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_channel_type -->
    <enum-decl name='lttng_ust_channel_type' filepath='../../../include/lttng/ust-events.h' line='508' column='1' id='type-id-240'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_CHANNEL_TYPE_BUFFER' value='0'/>
    </enum-decl>
    <!-- struct lttng_ust_session -->
    <class-decl name='lttng_ust_session' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='587' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_session::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-events.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_session_private* lttng_ust_session::priv -->
        <var-decl name='priv' type-id='type-id-244' visibility='default' filepath='../../../include/lttng/ust-events.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int lttng_ust_session::active -->
        <var-decl name='active' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-events.h' line='592' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_session_private -->
    <class-decl name='lttng_ust_session_private' size-in-bits='525440' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='318' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_session* lttng_ust_session_private::pub -->
        <var-decl name='pub' type-id='type-id-241' visibility='default' filepath='../../../src/common/events.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_ust_session_private::been_active -->
        <var-decl name='been_active' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int lttng_ust_session_private::objd -->
        <var-decl name='objd' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- cds_list_head lttng_ust_session_private::chan_head -->
        <var-decl name='chan_head' type-id='type-id-246' visibility='default' filepath='../../../src/common/events.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- cds_list_head lttng_ust_session_private::events_head -->
        <var-decl name='events_head' type-id='type-id-246' visibility='default' filepath='../../../src/common/events.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- cds_list_head lttng_ust_session_private::node -->
        <var-decl name='node' type-id='type-id-246' visibility='default' filepath='../../../src/common/events.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- cds_list_head lttng_ust_session_private::enablers_head -->
        <var-decl name='enablers_head' type-id='type-id-246' visibility='default' filepath='../../../src/common/events.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- lttng_ust_event_ht lttng_ust_session_private::events_ht -->
        <var-decl name='events_ht' type-id='type-id-247' visibility='default' filepath='../../../src/common/events.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='262784'>
        <!-- void* lttng_ust_session_private::owner -->
        <var-decl name='owner' type-id='type-id-93' visibility='default' filepath='../../../src/common/events.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- int lttng_ust_session_private::tstate -->
        <var-decl name='tstate' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <!-- int lttng_ust_session_private::statedump_pending -->
        <var-decl name='statedump_pending' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='262912'>
        <!-- lttng_ust_enum_ht lttng_ust_session_private::enums_ht -->
        <var-decl name='enums_ht' type-id='type-id-248' visibility='default' filepath='../../../src/common/events.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525056'>
        <!-- cds_list_head lttng_ust_session_private::enums_head -->
        <var-decl name='enums_head' type-id='type-id-246' visibility='default' filepath='../../../src/common/events.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525184'>
        <!-- lttng_ust_ctx* lttng_ust_session_private::ctx -->
        <var-decl name='ctx' type-id='type-id-249' visibility='default' filepath='../../../src/common/events.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525248'>
        <!-- unsigned char lttng_ust_session_private::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-59' visibility='default' filepath='../../../src/common/events.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='525376'>
        <!-- bool lttng_ust_session_private::uuid_set -->
        <var-decl name='uuid_set' type-id='type-id-1' visibility='default' filepath='../../../src/common/events.h' line='340' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_list_head -->
    <class-decl name='cds_list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/urcu/list.h' line='35' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head* cds_list_head::next -->
        <var-decl name='next' type-id='type-id-250' visibility='default' filepath='/usr/include/urcu/list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head* cds_list_head::prev -->
        <var-decl name='prev' type-id='type-id-250' visibility='default' filepath='/usr/include/urcu/list.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_ht -->
    <class-decl name='lttng_ust_event_ht' size-in-bits='262144' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='221' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_head lttng_ust_event_ht::table[4096] -->
        <var-decl name='table' type-id='type-id-3' visibility='default' filepath='../../../src/common/events.h' line='222' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_hlist_head -->
    <class-decl name='cds_hlist_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/urcu/hlist.h' line='21' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_node* cds_hlist_head::next -->
        <var-decl name='next' type-id='type-id-251' visibility='default' filepath='/usr/include/urcu/hlist.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_hlist_node -->
    <class-decl name='cds_hlist_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/urcu/hlist.h' line='25' column='1' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_node* cds_hlist_node::next -->
        <var-decl name='next' type-id='type-id-251' visibility='default' filepath='/usr/include/urcu/hlist.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_hlist_node* cds_hlist_node::prev -->
        <var-decl name='prev' type-id='type-id-251' visibility='default' filepath='/usr/include/urcu/hlist.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_enum_ht -->
    <class-decl name='lttng_ust_enum_ht' size-in-bits='262144' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='234' column='1' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_hlist_head lttng_ust_enum_ht::table[4096] -->
        <var-decl name='table' type-id='type-id-3' visibility='default' filepath='../../../src/common/events.h' line='235' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctx -->
    <class-decl name='lttng_ust_ctx' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='427' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_ctx_field* lttng_ust_ctx::fields -->
        <var-decl name='fields' type-id='type-id-254' visibility='default' filepath='../../../src/common/events.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int lttng_ust_ctx::nr_fields -->
        <var-decl name='nr_fields' type-id='type-id-60' visibility='default' filepath='../../../src/common/events.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int lttng_ust_ctx::allocated_fields -->
        <var-decl name='allocated_fields' type-id='type-id-60' visibility='default' filepath='../../../src/common/events.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int lttng_ust_ctx::largest_align -->
        <var-decl name='largest_align' type-id='type-id-60' visibility='default' filepath='../../../src/common/events.h' line='431' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctx_field -->
    <class-decl name='lttng_ust_ctx_field' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='446' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const lttng_ust_event_field* lttng_ust_ctx_field::event_field -->
        <var-decl name='event_field' type-id='type-id-256' visibility='default' filepath='../../../src/common/events.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- typedef size_t (void*, lttng_ust_probe_ctx*, typedef size_t)* lttng_ust_ctx_field::get_size -->
        <var-decl name='get_size' type-id='type-id-257' visibility='default' filepath='../../../src/common/events.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (void*, lttng_ust_probe_ctx*, lttng_ust_ring_buffer_ctx*, lttng_ust_channel_buffer*)* lttng_ust_ctx_field::record -->
        <var-decl name='record' type-id='type-id-258' visibility='default' filepath='../../../src/common/events.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (void*, lttng_ust_probe_ctx*, lttng_ust_ctx_value*)* lttng_ust_ctx_field::get_value -->
        <var-decl name='get_value' type-id='type-id-259' visibility='default' filepath='../../../src/common/events.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (void*)* lttng_ust_ctx_field::destroy -->
        <var-decl name='destroy' type-id='type-id-260' visibility='default' filepath='../../../src/common/events.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* lttng_ust_ctx_field::priv -->
        <var-decl name='priv' type-id='type-id-93' visibility='default' filepath='../../../src/common/events.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_event_field -->
    <class-decl name='lttng_ust_event_field' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='250' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_event_field::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-events.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* lttng_ust_event_field::name -->
        <var-decl name='name' type-id='type-id-262' visibility='default' filepath='../../../include/lttng/ust-events.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const lttng_ust_type_common* lttng_ust_event_field::type -->
        <var-decl name='type' type-id='type-id-263' visibility='default' filepath='../../../include/lttng/ust-events.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int lttng_ust_event_field::nowrite -->
        <var-decl name='nowrite' type-id='type-id-60' visibility='default' filepath='../../../include/lttng/ust-events.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <!-- unsigned int lttng_ust_event_field::nofilter -->
        <var-decl name='nofilter' type-id='type-id-60' visibility='default' filepath='../../../include/lttng/ust-events.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_type_common -->
    <class-decl name='lttng_ust_type_common' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='110' column='1' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_type lttng_ust_type_common::type -->
        <var-decl name='type' type-id='type-id-265' visibility='default' filepath='../../../include/lttng/ust-events.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_type -->
    <enum-decl name='lttng_ust_type' filepath='../../../include/lttng/ust-events.h' line='56' column='1' id='type-id-265'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='lttng_ust_type_integer' value='0'/>
      <enumerator name='lttng_ust_type_string' value='1'/>
      <enumerator name='lttng_ust_type_float' value='2'/>
      <enumerator name='lttng_ust_type_dynamic' value='3'/>
      <enumerator name='lttng_ust_type_enum' value='4'/>
      <enumerator name='lttng_ust_type_array' value='5'/>
      <enumerator name='lttng_ust_type_sequence' value='6'/>
      <enumerator name='lttng_ust_type_struct' value='7'/>
      <enumerator name='NR_LTTNG_UST_TYPE' value='8'/>
    </enum-decl>
    <!-- struct lttng_ust_ctx_value -->
    <class-decl name='lttng_ust_ctx_value' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='32' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_dynamic_type lttng_ust_ctx_value::sel -->
        <var-decl name='sel' type-id='type-id-267' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {int64_t s64; uint64_t u64; const char* str; double d;} lttng_ust_ctx_value::u -->
        <var-decl name='u' type-id='type-id-268' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_dynamic_type -->
    <enum-decl name='lttng_ust_dynamic_type' filepath='../../../src/common/dynamic-type.h' line='12' column='1' id='type-id-267'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_NONE' value='0'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S8' value='1'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S16' value='2'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S32' value='3'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_S64' value='4'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U8' value='5'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U16' value='6'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U32' value='7'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_U64' value='8'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_FLOAT' value='9'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_DOUBLE' value='10'/>
      <enumerator name='LTTNG_UST_DYNAMIC_TYPE_STRING' value='11'/>
      <enumerator name='_NR_LTTNG_UST_DYNAMIC_TYPES' value='12'/>
    </enum-decl>
    <!-- union {int64_t s64; uint64_t u64; const char* str; double d;} -->
    <union-decl name='__anonymous_union__22' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='34' column='1' id='type-id-268'>
      <data-member access='private'>
        <!-- int64_t s64 -->
        <var-decl name='s64' type-id='type-id-69' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='35' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- uint64_t u64 -->
        <var-decl name='u64' type-id='type-id-99' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='36' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- const char* str -->
        <var-decl name='str' type-id='type-id-262' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='37' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- double d -->
        <var-decl name='d' type-id='type-id-40' visibility='default' filepath='../../../src/common/ust-context-provider.h' line='38' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_channel_buffer_private -->
    <class-decl name='lttng_ust_channel_buffer_private' size-in-bits='704' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='384' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_channel_common_private lttng_ust_channel_buffer_private::parent -->
        <var-decl name='parent' type-id='type-id-242' visibility='default' filepath='../../../src/common/events.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_channel_buffer* lttng_ust_channel_buffer_private::pub -->
        <var-decl name='pub' type-id='type-id-232' visibility='default' filepath='../../../src/common/events.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- cds_list_head lttng_ust_channel_buffer_private::node -->
        <var-decl name='node' type-id='type-id-246' visibility='default' filepath='../../../src/common/events.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int lttng_ust_channel_buffer_private::header_type -->
        <var-decl name='header_type' type-id='type-id-41' visibility='default' filepath='../../../src/common/events.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- unsigned int lttng_ust_channel_buffer_private::id -->
        <var-decl name='id' type-id='type-id-60' visibility='default' filepath='../../../src/common/events.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- lttng_ust_abi_chan_type lttng_ust_channel_buffer_private::type -->
        <var-decl name='type' type-id='type-id-270' visibility='default' filepath='../../../src/common/events.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- lttng_ust_ctx* lttng_ust_channel_buffer_private::ctx -->
        <var-decl name='ctx' type-id='type-id-249' visibility='default' filepath='../../../src/common/events.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- lttng_ust_ring_buffer_channel* lttng_ust_channel_buffer_private::rb_chan -->
        <var-decl name='rb_chan' type-id='type-id-186' visibility='default' filepath='../../../src/common/events.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- unsigned char lttng_ust_channel_buffer_private::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-59' visibility='default' filepath='../../../src/common/events.h' line='394' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_abi_chan_type -->
    <enum-decl name='lttng_ust_abi_chan_type' filepath='../../../include/lttng/ust-abi.h' line='42' column='1' id='type-id-270'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_ABI_CHAN_PER_CPU' value='0'/>
      <enumerator name='LTTNG_UST_ABI_CHAN_METADATA' value='1'/>
    </enum-decl>
    <!-- struct lttng_ust_channel_buffer_ops -->
    <class-decl name='lttng_ust_channel_buffer_ops' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-events.h' line='491' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_channel_buffer_ops::struct_size -->
        <var-decl name='struct_size' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-events.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_channel_buffer_ops_private* lttng_ust_channel_buffer_ops::priv -->
        <var-decl name='priv' type-id='type-id-272' visibility='default' filepath='../../../include/lttng/ust-events.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int (lttng_ust_ring_buffer_ctx*)* lttng_ust_channel_buffer_ops::event_reserve -->
        <var-decl name='event_reserve' type-id='type-id-273' visibility='default' filepath='../../../include/lttng/ust-events.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (lttng_ust_ring_buffer_ctx*)* lttng_ust_channel_buffer_ops::event_commit -->
        <var-decl name='event_commit' type-id='type-id-274' visibility='default' filepath='../../../include/lttng/ust-events.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (lttng_ust_ring_buffer_ctx*, void*, typedef size_t, typedef size_t)* lttng_ust_channel_buffer_ops::event_write -->
        <var-decl name='event_write' type-id='type-id-275' visibility='default' filepath='../../../include/lttng/ust-events.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void (lttng_ust_ring_buffer_ctx*, const char*, typedef size_t)* lttng_ust_channel_buffer_ops::event_strcpy -->
        <var-decl name='event_strcpy' type-id='type-id-276' visibility='default' filepath='../../../include/lttng/ust-events.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (lttng_ust_ring_buffer_ctx*, const char*, typedef size_t)* lttng_ust_channel_buffer_ops::event_pstrcpy_pad -->
        <var-decl name='event_pstrcpy_pad' type-id='type-id-276' visibility='default' filepath='../../../include/lttng/ust-events.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_channel_buffer_ops_private -->
    <class-decl name='lttng_ust_channel_buffer_ops_private' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../src/common/events.h' line='353' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_channel_buffer_ops* lttng_ust_channel_buffer_ops_private::pub -->
        <var-decl name='pub' type-id='type-id-237' visibility='default' filepath='../../../src/common/events.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- lttng_ust_channel_buffer* (const char*, void*, typedef size_t, typedef size_t, unsigned int, unsigned int, unsigned char*, typedef uint32_t, const int*, int, typedef int64_t)* lttng_ust_channel_buffer_ops_private::channel_create -->
        <var-decl name='channel_create' type-id='type-id-278' visibility='default' filepath='../../../src/common/events.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (lttng_ust_channel_buffer*)* lttng_ust_channel_buffer_ops_private::channel_destroy -->
        <var-decl name='channel_destroy' type-id='type-id-279' visibility='default' filepath='../../../src/common/events.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- typedef size_t (lttng_ust_channel_buffer*)* lttng_ust_channel_buffer_ops_private::packet_avail_size -->
        <var-decl name='packet_avail_size' type-id='type-id-280' visibility='default' filepath='../../../src/common/events.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int (lttng_ust_channel_buffer*)* lttng_ust_channel_buffer_ops_private::is_finalized -->
        <var-decl name='is_finalized' type-id='type-id-281' visibility='default' filepath='../../../src/common/events.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int (lttng_ust_channel_buffer*)* lttng_ust_channel_buffer_ops_private::is_disabled -->
        <var-decl name='is_disabled' type-id='type-id-281' visibility='default' filepath='../../../src/common/events.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- int (lttng_ust_channel_buffer*)* lttng_ust_channel_buffer_ops_private::flush_buffer -->
        <var-decl name='flush_buffer' type-id='type-id-281' visibility='default' filepath='../../../src/common/events.h' line='374' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_ctl_consumer_channel_attr -->
    <class-decl name='lttng_ust_ctl_consumer_channel_attr' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='38' column='1' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_abi_chan_type lttng_ust_ctl_consumer_channel_attr::type -->
        <var-decl name='type' type-id='type-id-270' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint64_t lttng_ust_ctl_consumer_channel_attr::subbuf_size -->
        <var-decl name='subbuf_size' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint64_t lttng_ust_ctl_consumer_channel_attr::num_subbuf -->
        <var-decl name='num_subbuf' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int lttng_ust_ctl_consumer_channel_attr::overwrite -->
        <var-decl name='overwrite' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int lttng_ust_ctl_consumer_channel_attr::switch_timer_interval -->
        <var-decl name='switch_timer_interval' type-id='type-id-60' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- unsigned int lttng_ust_ctl_consumer_channel_attr::read_timer_interval -->
        <var-decl name='read_timer_interval' type-id='type-id-60' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- lttng_ust_abi_output lttng_ust_ctl_consumer_channel_attr::output -->
        <var-decl name='output' type-id='type-id-282' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t lttng_ust_ctl_consumer_channel_attr::chan_id -->
        <var-decl name='chan_id' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned char lttng_ust_ctl_consumer_channel_attr::uuid[16] -->
        <var-decl name='uuid' type-id='type-id-59' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int64_t lttng_ust_ctl_consumer_channel_attr::blocking_timeout -->
        <var-decl name='blocking_timeout' type-id='type-id-69' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_abi_output -->
    <enum-decl name='lttng_ust_abi_output' filepath='../../../include/lttng/ust-abi.h' line='38' column='1' id='type-id-282'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_ABI_MMAP' value='0'/>
    </enum-decl>
    <!-- struct lttng_ust_abi_calibrate -->
    <class-decl name='lttng_ust_abi_calibrate' size-in-bits='2464' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='312' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_abi_calibrate_type lttng_ust_abi_calibrate::type -->
        <var-decl name='type' type-id='type-id-284' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_abi_calibrate::padding[16] -->
        <var-decl name='padding' type-id='type-id-9' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- union {char padding[288];} lttng_ust_abi_calibrate::u -->
        <var-decl name='u' type-id='type-id-285' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_abi_calibrate_type -->
    <enum-decl name='lttng_ust_abi_calibrate_type' filepath='../../../include/lttng/ust-abi.h' line='306' column='1' id='type-id-284'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_ABI_CALIBRATE_TRACEPOINT' value='0'/>
    </enum-decl>
    <!-- union {char padding[288];} -->
    <union-decl name='__anonymous_union__23' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='316' column='1' id='type-id-285'>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-23' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='317' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_abi_tracer_version -->
    <class-decl name='lttng_ust_abi_tracer_version' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='47' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_abi_tracer_version::major -->
        <var-decl name='major' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_abi_tracer_version::minor -->
        <var-decl name='minor' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t lttng_ust_abi_tracer_version::patchlevel -->
        <var-decl name='patchlevel' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_field_iter -->
    <class-decl name='lttng_ust_abi_field_iter' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='177' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_abi_field_iter::event_name[256] -->
        <var-decl name='event_name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- char lttng_ust_abi_field_iter::field_name[256] -->
        <var-decl name='field_name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <!-- int32_t lttng_ust_abi_field_iter::type -->
        <var-decl name='type' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <!-- int lttng_ust_abi_field_iter::loglevel -->
        <var-decl name='loglevel' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <!-- int lttng_ust_abi_field_iter::nowrite -->
        <var-decl name='nowrite' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <!-- char lttng_ust_abi_field_iter::padding[284] -->
        <var-decl name='padding' type-id='type-id-21' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='183' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_tracepoint_iter -->
    <class-decl name='lttng_ust_abi_tracepoint_iter' size-in-bits='2208' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='254' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char lttng_ust_abi_tracepoint_iter::name[256] -->
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- int lttng_ust_abi_tracepoint_iter::loglevel -->
        <var-decl name='loglevel' type-id='type-id-41' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- char lttng_ust_abi_tracepoint_iter::padding[16] -->
        <var-decl name='padding' type-id='type-id-9' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_event_notifier -->
    <class-decl name='lttng_ust_abi_event_notifier' size-in-bits='4896' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='134' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_abi_event lttng_ust_abi_event_notifier::event -->
        <var-decl name='event' type-id='type-id-290' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <!-- uint64_t lttng_ust_abi_event_notifier::error_counter_index -->
        <var-decl name='error_counter_index' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <!-- char lttng_ust_abi_event_notifier::padding[32] -->
        <var-decl name='padding' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_event -->
    <class-decl name='lttng_ust_abi_event' size-in-bits='4576' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='118' column='1' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32_t lttng_ust_abi_event::instrumentation -->
        <var-decl name='instrumentation' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_abi_event::name[256] -->
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- int32_t lttng_ust_abi_event::loglevel_type -->
        <var-decl name='loglevel_type' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <!-- int32_t lttng_ust_abi_event::loglevel -->
        <var-decl name='loglevel' type-id='type-id-82' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <!-- uint64_t lttng_ust_abi_event::token -->
        <var-decl name='token' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <!-- char lttng_ust_abi_event::padding[8] -->
        <var-decl name='padding' type-id='type-id-37' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <!-- union {char padding[288];} lttng_ust_abi_event::u -->
        <var-decl name='u' type-id='type-id-291' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='130' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {char padding[288];} -->
    <union-decl name='__anonymous_union__24' size-in-bits='2304' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='128' column='1' id='type-id-291'>
      <data-member access='private'>
        <!-- char padding[288] -->
        <var-decl name='padding' type-id='type-id-23' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='129' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_abi_event_exclusion -->
    <class-decl name='lttng_ust_abi_event_exclusion' size-in-bits='288' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='342' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_abi_event_exclusion::count -->
        <var-decl name='count' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char lttng_ust_abi_event_exclusion::padding[32] -->
        <var-decl name='padding' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- char lttng_ust_abi_event_exclusion::names[256][] -->
        <var-decl name='names' type-id='type-id-19' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='345' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_capture_bytecode -->
    <class-decl name='lttng_ust_abi_capture_bytecode' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='333' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_abi_capture_bytecode::len -->
        <var-decl name='len' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_abi_capture_bytecode::reloc_offset -->
        <var-decl name='reloc_offset' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_abi_capture_bytecode::seqnum -->
        <var-decl name='seqnum' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_ust_abi_capture_bytecode::padding[32] -->
        <var-decl name='padding' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_abi_capture_bytecode::data[] -->
        <var-decl name='data' type-id='type-id-39' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='338' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_abi_filter_bytecode -->
    <class-decl name='lttng_ust_abi_filter_bytecode' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='323' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_abi_filter_bytecode::len -->
        <var-decl name='len' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t lttng_ust_abi_filter_bytecode::reloc_offset -->
        <var-decl name='reloc_offset' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint64_t lttng_ust_abi_filter_bytecode::seqnum -->
        <var-decl name='seqnum' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char lttng_ust_abi_filter_bytecode::padding[32] -->
        <var-decl name='padding' type-id='type-id-29' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char lttng_ust_abi_filter_bytecode::data[] -->
        <var-decl name='data' type-id='type-id-39' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='328' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_context_attr -->
    <class-decl name='lttng_ust_context_attr' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='55' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- lttng_ust_abi_context_type lttng_ust_context_attr::ctx -->
        <var-decl name='ctx' type-id='type-id-296' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {lttng_ust_abi_perf_counter_ctx perf_counter; struct {char* provider_name; char* ctx_name;} app_ctx;} lttng_ust_context_attr::u -->
        <var-decl name='u' type-id='type-id-297' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum lttng_ust_abi_context_type -->
    <enum-decl name='lttng_ust_abi_context_type' filepath='../../../include/lttng/ust-abi.h' line='186' column='1' id='type-id-296'>
      <underlying-type type-id='type-id-57'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VTID' value='0'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VPID' value='1'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_PTHREAD_ID' value='2'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_PROCNAME' value='3'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_IP' value='4'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_PERF_THREAD_COUNTER' value='5'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_CPU_ID' value='6'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_APP_CONTEXT' value='7'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_CGROUP_NS' value='8'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_IPC_NS' value='9'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_MNT_NS' value='10'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_NET_NS' value='11'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_PID_NS' value='12'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_USER_NS' value='13'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_UTS_NS' value='14'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VUID' value='15'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VEUID' value='16'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VSUID' value='17'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VGID' value='18'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VEGID' value='19'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_VSGID' value='20'/>
      <enumerator name='LTTNG_UST_ABI_CONTEXT_TIME_NS' value='21'/>
    </enum-decl>
    <!-- union {lttng_ust_abi_perf_counter_ctx perf_counter; struct {char* provider_name; char* ctx_name;} app_ctx;} -->
    <union-decl name='__anonymous_union__25' size-in-bits='2176' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='57' column='1' id='type-id-297'>
      <data-member access='private'>
        <!-- lttng_ust_abi_perf_counter_ctx perf_counter -->
        <var-decl name='perf_counter' type-id='type-id-298' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {char* provider_name; char* ctx_name;} app_ctx -->
        <var-decl name='app_ctx' type-id='type-id-299' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='62' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct lttng_ust_abi_perf_counter_ctx -->
    <class-decl name='lttng_ust_abi_perf_counter_ctx' size-in-bits='2144' is-struct='yes' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='211' column='1' id='type-id-298'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t lttng_ust_abi_perf_counter_ctx::type -->
        <var-decl name='type' type-id='type-id-88' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint64_t lttng_ust_abi_perf_counter_ctx::config -->
        <var-decl name='config' type-id='type-id-99' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- char lttng_ust_abi_perf_counter_ctx::name[256] -->
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='../../../include/lttng/ust-abi.h' line='214' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {char* provider_name; char* ctx_name;} -->
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='59' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char* provider_name -->
        <var-decl name='provider_name' type-id='type-id-98' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* ctx_name -->
        <var-decl name='ctx_name' type-id='type-id-98' visibility='default' filepath='../../../include/lttng/ust-ctl.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <!-- bool* -->
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-300'/>
    <!-- cds_hlist_node* -->
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-251'/>
    <!-- cds_list_head* -->
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-250'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-98'/>
    <!-- char** -->
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-301'/>
    <!-- commit_counters_cold* -->
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-228'/>
    <!-- commit_counters_hot* -->
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-166'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-302'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-262'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-303'/>
    <!-- const int* -->
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-304'/>
    <!-- const lttng_counter_dimension -->
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-305'/>
    <!-- const lttng_counter_dimension* -->
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-306'/>
    <!-- const lttng_counter_ops -->
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-307'/>
    <!-- const lttng_counter_ops* -->
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-65'/>
    <!-- const lttng_ust_ctl_counter_dimension -->
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-308'/>
    <!-- const lttng_ust_ctl_counter_dimension* -->
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <!-- const lttng_ust_event_field -->
    <qualified-type-def type-id='type-id-261' const='yes' id='type-id-310'/>
    <!-- const lttng_ust_event_field* -->
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-256'/>
    <!-- const lttng_ust_ring_buffer_client_cb -->
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-311'/>
    <!-- const lttng_ust_ring_buffer_client_cb* -->
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-211'/>
    <!-- const lttng_ust_ring_buffer_config -->
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-312'/>
    <!-- const lttng_ust_ring_buffer_config* -->
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <!-- const lttng_ust_type_common -->
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-314'/>
    <!-- const lttng_ust_type_common* -->
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-263'/>
    <!-- const size_t -->
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-315'/>
    <!-- const size_t* -->
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <!-- int (lib_counter*, const size_t*)* -->
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-107'/>
    <!-- int (lib_counter*, const size_t*, int, int64_t*, bool*, bool*)* -->
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-105'/>
    <!-- int (lib_counter*, const size_t*, int64_t*, bool*, bool*)* -->
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-106'/>
    <!-- int (lib_counter*, const size_t*, typedef int64_t)* -->
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-104'/>
    <!-- int (lttng_ust_channel_buffer*)* -->
