<abi-corpus architecture='elf-amd-x86_64' soname='liblttng-ust-cyg-profile.so.0'>
  <elf-needed>
    <dependency name='liblttng-ust.so.0'/>
    <dependency name='liblttng-ust-tracepoint.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libnuma.so.1'/>
    <dependency name='liburcu-bp.so.6'/>
    <dependency name='liburcu-cds.so.6'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- __cyg_profile_func_enter -->
    <elf-symbol name='__cyg_profile_func_enter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __cyg_profile_func_exit -->
    <elf-symbol name='__cyg_profile_func_exit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __tracepoint_lttng_ust_cyg_profile___func_entry -->
    <elf-symbol name='__tracepoint_lttng_ust_cyg_profile___func_entry' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_lttng_ust_cyg_profile___func_exit -->
    <elf-symbol name='__tracepoint_lttng_ust_cyg_profile___func_exit' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __tracepoint_provider_lttng_ust_cyg_profile -->
    <elf-symbol name='__tracepoint_provider_lttng_ust_cyg_profile' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='lttng-ust-cyg-profile.c' comp-dir-path='liblttng-ust-cyg-profile' language='LANG_C99'>

    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-2'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- void -->
    <type-decl name='void' id='type-id-6'/>
    <!-- struct lttng_ust_tracepoint_dlopen -->
    <class-decl name='lttng_ust_tracepoint_dlopen' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint.h' line='230' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* lttng_ust_tracepoint_dlopen::liblttngust_handle -->
        <var-decl name='liblttngust_handle' type-id='type-id-8' visibility='default' filepath='../include/lttng/tracepoint.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int (lttng_ust_tracepoint* const*, int)* lttng_ust_tracepoint_dlopen::tracepoint_register_lib -->
        <var-decl name='tracepoint_register_lib' type-id='type-id-9' visibility='default' filepath='../include/lttng/tracepoint.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int (lttng_ust_tracepoint* const*)* lttng_ust_tracepoint_dlopen::tracepoint_unregister_lib -->
        <var-decl name='tracepoint_unregister_lib' type-id='type-id-10' visibility='default' filepath='../include/lttng/tracepoint.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_lock_sym_bp -->
        <var-decl name='rcu_read_lock_sym_bp' type-id='type-id-11' visibility='default' filepath='../include/lttng/tracepoint.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void ()* lttng_ust_tracepoint_dlopen::rcu_read_unlock_sym_bp -->
        <var-decl name='rcu_read_unlock_sym_bp' type-id='type-id-11' visibility='default' filepath='../include/lttng/tracepoint.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* (void*)* lttng_ust_tracepoint_dlopen::rcu_dereference_sym_bp -->
        <var-decl name='rcu_dereference_sym_bp' type-id='type-id-12' visibility='default' filepath='../include/lttng/tracepoint.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint -->
    <class-decl name='lttng_ust_tracepoint' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='32' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* lttng_ust_tracepoint::name -->
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int lttng_ust_tracepoint::state -->
        <var-decl name='state' type-id='type-id-5' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- lttng_ust_tracepoint_probe* lttng_ust_tracepoint::probes -->
        <var-decl name='probes' type-id='type-id-15' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int* lttng_ust_tracepoint::tracepoint_provider_ref -->
        <var-decl name='tracepoint_provider_ref' type-id='type-id-16' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- const char* lttng_ust_tracepoint::signature -->
        <var-decl name='signature' type-id='type-id-14' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char lttng_ust_tracepoint::padding[16] -->
        <var-decl name='padding' type-id='type-id-2' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_probe -->
    <class-decl name='lttng_ust_tracepoint_probe' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='26' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* lttng_ust_tracepoint_probe::func -->
        <var-decl name='func' type-id='type-id-11' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* lttng_ust_tracepoint_probe::data -->
        <var-decl name='data' type-id='type-id-8' visibility='default' filepath='../include/lttng/tracepoint-types.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lttng_ust_tracepoint_destructors_syms -->
    <class-decl name='lttng_ust_tracepoint_destructors_syms' size-in-bits='192' is-struct='yes' visibility='default' filepath='../include/lttng/tracepoint.h' line='273' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int* lttng_ust_tracepoint_destructors_syms::old_tracepoint_disable_destructors -->
        <var-decl name='old_tracepoint_disable_destructors' type-id='type-id-16' visibility='default' filepath='../include/lttng/tracepoint.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void ()* lttng_ust_tracepoint_destructors_syms::tracepoint_disable_destructors -->
        <var-decl name='tracepoint_disable_destructors' type-id='type-id-11' visibility='default' filepath='../include/lttng/tracepoint.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int ()* lttng_ust_tracepoint_destructors_syms::tracepoint_get_destructors_state -->
        <var-decl name='tracepoint_get_destructors_state' type-id='type-id-19' visibility='default' filepath='../include/lttng/tracepoint.h' line='276' column='1'/>
      </data-member>
    </class-decl>
    <!-- const char -->
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-20'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-14'/>
    <!-- int ()* -->
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-19'/>
    <!-- int (lttng_ust_tracepoint* const*)* -->
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-10'/>
    <!-- int (lttng_ust_tracepoint* const*, int)* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-9'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-16'/>
    <!-- lttng_ust_tracepoint* -->
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-24'/>
    <!-- lttng_ust_tracepoint* const -->
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-25'/>
    <!-- lttng_ust_tracepoint* const* -->
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-26'/>
    <!-- lttng_ust_tracepoint_destructors_syms* -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-27'/>
    <!-- lttng_ust_tracepoint_dlopen* -->
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-28'/>
    <!-- lttng_ust_tracepoint_probe* -->
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-15'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-11'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-8'/>
    <!-- void* (void*)* -->
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-12'/>
    <!-- lttng_ust_tracepoint_dlopen tracepoint_dlopen -->
    <var-decl name='tracepoint_dlopen' type-id='type-id-7' visibility='default' filepath='../include/lttng/tracepoint.h' line='241' column='1'/>
    <!-- lttng_ust_tracepoint_dlopen* tracepoint_dlopen_ptr -->
    <var-decl name='tracepoint_dlopen_ptr' type-id='type-id-28' visibility='default' filepath='../include/lttng/tracepoint.h' line='242' column='1'/>
    <!-- lttng_ust_tracepoint_destructors_syms tracepoint_destructors_syms -->
    <var-decl name='tracepoint_destructors_syms' type-id='type-id-18' visibility='default' filepath='../include/lttng/tracepoint.h' line='279' column='1'/>
    <!-- lttng_ust_tracepoint_destructors_syms* tracepoint_destructors_syms_ptr -->
    <var-decl name='tracepoint_destructors_syms_ptr' type-id='type-id-27' visibility='default' filepath='../include/lttng/tracepoint.h' line='280' column='1'/>
    <!-- lttng_ust_tracepoint __tracepoint_lttng_ust_cyg_profile___func_entry -->
    <var-decl name='__tracepoint_lttng_ust_cyg_profile___func_entry' type-id='type-id-13' mangled-name='__tracepoint_lttng_ust_cyg_profile___func_entry' visibility='default' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.h' line='45' column='1' elf-symbol-id='__tracepoint_lttng_ust_cyg_profile___func_entry'/>
    <!-- lttng_ust_tracepoint __tracepoint_lttng_ust_cyg_profile___func_exit -->
    <var-decl name='__tracepoint_lttng_ust_cyg_profile___func_exit' type-id='type-id-13' mangled-name='__tracepoint_lttng_ust_cyg_profile___func_exit' visibility='default' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.h' line='53' column='1' elf-symbol-id='__tracepoint_lttng_ust_cyg_profile___func_exit'/>
    <!-- int __tracepoint_provider_lttng_ust_cyg_profile -->
    <var-decl name='__tracepoint_provider_lttng_ust_cyg_profile' type-id='type-id-5' mangled-name='__tracepoint_provider_lttng_ust_cyg_profile' visibility='default' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.h' line='45' column='1' elf-symbol-id='__tracepoint_provider_lttng_ust_cyg_profile'/>
    <!-- void __cyg_profile_func_exit(void*, void*) -->
    <function-decl name='__cyg_profile_func_exit' mangled-name='__cyg_profile_func_exit' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__cyg_profile_func_exit'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8' name='this_fn' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.c' line='41' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8' name='call_site' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.c' line='41' column='1'/>
      <!-- void -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- void __cyg_profile_func_enter(void*, void*) -->
    <function-decl name='__cyg_profile_func_enter' mangled-name='__cyg_profile_func_enter' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__cyg_profile_func_enter'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8' name='this_fn' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.c' line='36' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8' name='call_site' filepath='liblttng-ust-cyg-profile/lttng-ust-cyg-profile.c' line='36' column='1'/>
      <!-- void -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int () -->
    <function-type size-in-bits='64' id='type-id-21'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (lttng_ust_tracepoint* const*) -->
    <function-type size-in-bits='64' id='type-id-22'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-26'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- int (lttng_ust_tracepoint* const*, int) -->
    <function-type size-in-bits='64' id='type-id-23'>
      <!-- parameter of type 'lttng_ust_tracepoint* const*' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-29'>
      <!-- void -->
      <return type-id='type-id-6'/>
    </function-type>
    <!-- void* (void*) -->
    <function-type size-in-bits='64' id='type-id-30'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-8'/>
      <!-- void* -->
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
</abi-corpus>
